frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
/* Based on CPU DB MC9S12XDP512_144, version 2.87.293 (RegistersPrg V1.081) */
/*
** ###################################################################
**     Filename  : MC9S12XDP512.h
**     Processor : MC9S12XDP512BCPV
**     FileFormat: V1.081
**     DataSheet : 9S12XDP512DGV1/D V01.10
**     Compiler  : Metrowerks C compiler
**     Date/Time : 8.6.2004, 16:03
**     Abstract  :
**         This header implements the mapping of IO devices.
**
**     (c) Copyright UNIS, spol. s r.o. 1997-2003
**     UNIS, spol. s r.o.
**     Jundrovska 33
**     624 00 Brno
**     Czech Republic
**     http      : www.processorexpert.com
**     mail      : info@processorexpert.com
** ###################################################################
*/

#ifndef _MC9S12XDP512_144_H
#define _MC9S12XDP512_144_H

/* Types definition */
typedef unsigned char byte;
typedef unsigned int word;
typedef unsigned long dword;
typedef unsigned long dlong[2];

#define REG_BASE 0x0000                /* Base address for the I/O register block */


#pragma MESSAGE DISABLE C1106 /* WARNING C1106: Non-standard bitfield type */
#pragma OPTION ADD V30toV31Compatible "-BfaGapLimitBits4294967295" /*this guarantee correct bitfield positions*/

/**************** interrupt vector table ****************/
#define Vsi                     0x0000FF10
#define Reserved119             0x0000FF12
#define Reserved118             0x0000FF14
#define Reserved117             0x0000FF16
#define Reserved116             0x0000FF18
#define Reserved115             0x0000FF1A
#define Reserved114             0x0000FF1C
#define Reserved113             0x0000FF1E
#define Reserved112             0x0000FF20
#define Reserved111             0x0000FF22
#define Reserved110             0x0000FF24
#define Reserved109             0x0000FF26
#define Reserved108             0x0000FF28
#define Reserved107             0x0000FF2A
#define Reserved106             0x0000FF2C
#define Reserved105             0x0000FF2E
#define Reserved104             0x0000FF30
#define Reserved103             0x0000FF32
#define Reserved102             0x0000FF34
#define Reserved101             0x0000FF36
#define Reserved100             0x0000FF38
#define Reserved99              0x0000FF3A
#define Reserved98              0x0000FF3C
#define Reserved97              0x0000FF3E
#define Reserved96              0x0000FF40
#define Reserved95              0x0000FF42
#define Reserved94              0x0000FF44
#define Reserved93              0x0000FF46
#define Reserved92              0x0000FF48
#define Reserved91              0x0000FF4A
#define Reserved90              0x0000FF4C
#define Reserved89              0x0000FF4E
#define Reserved88              0x0000FF50
#define Reserved87              0x0000FF52
#define Reserved86              0x0000FF54
#define Reserved85              0x0000FF56
#define Reserved84              0x0000FF58
#define Reserved83              0x0000FF5A
#define Reserved82              0x0000FF5C
#define Reserved81              0x0000FF5E
#define Vxsramav                0x0000FF60
#define Vxsei                   0x0000FF62
#define Vxst7                   0x0000FF64
#define Vxst6                   0x0000FF66
#define Vxst5                   0x0000FF68
#define Vxst4                   0x0000FF6A
#define Vxst3                   0x0000FF6C
#define Vxst2                   0x0000FF6E
#define Vxst1                   0x0000FF70
#define Vxst0                   0x0000FF72
#define Vpit3                   0x0000FF74
#define Vpit2                   0x0000FF76
#define Vpit1                   0x0000FF78
#define Vpit0                   0x0000FF7A
#define VReserved65             0x0000FF7C
#define Vapi                    0x0000FF7E
#define Vlvi                    0x0000FF80
#define Viic1                   0x0000FF82
#define Vsci5                   0x0000FF84
#define Vsci4                   0x0000FF86
#define Vsci3                   0x0000FF88
#define Vsci2                   0x0000FF8A
#define Vpwmesdn                0x0000FF8C
#define Vportp                  0x0000FF8E
#define Vcan4tx                 0x0000FF90
#define Vcan4rx                 0x0000FF92
#define Vcan4err                0x0000FF94
#define Vcan4wkup               0x0000FF96
#define Vcan3tx                 0x0000FF98
#define Vcan3rx                 0x0000FF9A
#define Vcan3err                0x0000FF9C
#define Vcan3wkup               0x0000FF9E
#define Vcan2tx                 0x0000FFA0
#define Vcan2rx                 0x0000FFA2
#define Vcan2err                0x0000FFA4
#define Vcan2wkup               0x0000FFA6
#define Vcan1tx                 0x0000FFA8
#define Vcan1rx                 0x0000FFAA
#define Vcan1err                0x0000FFAC
#define Vcan1wkup               0x0000FFAE
#define Vcan0tx                 0x0000FFB0
#define Vcan0rx                 0x0000FFB2
#define Vcan0err                0x0000FFB4
#define Vcan0wkup               0x0000FFB6
#define Vflash                  0x0000FFB8
#define Veeprom                 0x0000FFBA
#define Vspi2                   0x0000FFBC
#define Vspi1                   0x0000FFBE
#define Viic0                   0x0000FFC0
#define VReserved30             0x0000FFC2
#define Vcrgscm                 0x0000FFC4
#define Vcrgplllck              0x0000FFC6
#define Vtimpabovf              0x0000FFC8
#define Vtimmdcu                0x0000FFCA
#define Vporth                  0x0000FFCC
#define Vportj                  0x0000FFCE
#define Vatd1                   0x0000FFD0
#define Vatd0                   0x0000FFD2
#define Vsci1                   0x0000FFD4
#define Vsci0                   0x0000FFD6
#define Vspi0                   0x0000FFD8
#define Vtimpaie                0x0000FFDA
#define Vtimpaaovf              0x0000FFDC
#define Vtimovf                 0x0000FFDE
#define Vtimch7                 0x0000FFE0
#define Vtimch6                 0x0000FFE2
#define Vtimch5                 0x0000FFE4
#define Vtimch4                 0x0000FFE6
#define Vtimch3                 0x0000FFE8
#define Vtimch2                 0x0000FFEA
#define Vtimch1                 0x0000FFEC
#define Vtimch0                 0x0000FFEE
#define Vrti                    0x0000FFF0
#define Virq                    0x0000FFF2
#define Vxirq                   0x0000FFF4
#define Vswi                    0x0000FFF6
#define Vtrap                   0x0000FFF8
#define Vcop                    0x0000FFFA
#define Vclkmon                 0x0000FFFC
#define Vreset                  0x0000FFFE

/**************** registers I/O map ****************/

/*** PORTAB - Port AB; 0x00000000 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PORTA - Port A Register; 0x00000000 ***/
    union {
      byte Byte;
      struct {
        byte PA0         :1;                                       /* Port A Bit 0 */
        byte PA1         :1;                                       /* Port A Bit 1 */
        byte PA2         :1;                                       /* Port A Bit 2 */
        byte PA3         :1;                                       /* Port A Bit 3 */
        byte PA4         :1;                                       /* Port A Bit 4 */
        byte PA5         :1;                                       /* Port A Bit 5 */
        byte PA6         :1;                                       /* Port A Bit 6 */
        byte PA7         :1;                                       /* Port A Bit 7 */
      } Bits;
      struct {
        byte grpPA :8;
      } MergedBits;
    } PORTASTR;
    #define PORTA _PORTAB.Overlap_STR.PORTASTR.Byte
    #define PORTA_PA0 _PORTAB.Overlap_STR.PORTASTR.Bits.PA0
    #define PORTA_PA1 _PORTAB.Overlap_STR.PORTASTR.Bits.PA1
    #define PORTA_PA2 _PORTAB.Overlap_STR.PORTASTR.Bits.PA2
    #define PORTA_PA3 _PORTAB.Overlap_STR.PORTASTR.Bits.PA3
    #define PORTA_PA4 _PORTAB.Overlap_STR.PORTASTR.Bits.PA4
    #define PORTA_PA5 _PORTAB.Overlap_STR.PORTASTR.Bits.PA5
    #define PORTA_PA6 _PORTAB.Overlap_STR.PORTASTR.Bits.PA6
    #define PORTA_PA7 _PORTAB.Overlap_STR.PORTASTR.Bits.PA7
    
    #define PORTA_PA _PORTAB.Overlap_STR.PORTASTR.MergedBits.grpPA
    
    #define PORTA_PA0_MASK   1
    #define PORTA_PA1_MASK   2
    #define PORTA_PA2_MASK   4
    #define PORTA_PA3_MASK   8
    #define PORTA_PA4_MASK   16
    #define PORTA_PA5_MASK   32
    #define PORTA_PA6_MASK   64
    #define PORTA_PA7_MASK   128
    #define PORTA_PA_MASK  255
    #define PORTA_PA_BITNUM  0


    /*** PORTB - Port B Register; 0x00000001 ***/
    union {
      byte Byte;
      struct {
        byte PB0         :1;                                       /* Port B Bit 0 */
        byte PB1         :1;                                       /* Port B Bit 1 */
        byte PB2         :1;                                       /* Port B Bit 2 */
        byte PB3         :1;                                       /* Port B Bit 3 */
        byte PB4         :1;                                       /* Port B Bit 4 */
        byte PB5         :1;                                       /* Port B Bit 5 */
        byte PB6         :1;                                       /* Port B Bit 6 */
        byte PB7         :1;                                       /* Port B Bit 7 */
      } Bits;
      struct {
        byte grpPB :8;
      } MergedBits;
    } PORTBSTR;
    #define PORTB _PORTAB.Overlap_STR.PORTBSTR.Byte
    #define PORTB_PB0 _PORTAB.Overlap_STR.PORTBSTR.Bits.PB0
    #define PORTB_PB1 _PORTAB.Overlap_STR.PORTBSTR.Bits.PB1
    #define PORTB_PB2 _PORTAB.Overlap_STR.PORTBSTR.Bits.PB2
    #define PORTB_PB3 _PORTAB.Overlap_STR.PORTBSTR.Bits.PB3
    #define PORTB_PB4 _PORTAB.Overlap_STR.PORTBSTR.Bits.PB4
    #define PORTB_PB5 _PORTAB.Overlap_STR.PORTBSTR.Bits.PB5
    #define PORTB_PB6 _PORTAB.Overlap_STR.PORTBSTR.Bits.PB6
    #define PORTB_PB7 _PORTAB.Overlap_STR.PORTBSTR.Bits.PB7
    
    #define PORTB_PB _PORTAB.Overlap_STR.PORTBSTR.MergedBits.grpPB
    
    #define PORTB_PB0_MASK   1
    #define PORTB_PB1_MASK   2
    #define PORTB_PB2_MASK   4
    #define PORTB_PB3_MASK   8
    #define PORTB_PB4_MASK   16
    #define PORTB_PB5_MASK   32
    #define PORTB_PB6_MASK   64
    #define PORTB_PB7_MASK   128
    #define PORTB_PB_MASK  255
    #define PORTB_PB_BITNUM  0

  } Overlap_STR;

