frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
  struct {
    word PD0         :1;                                       /* Port D Bit 0 */
    word PD1         :1;                                       /* Port D Bit 1 */
    word PD2         :1;                                       /* Port D Bit 2 */
    word PD3         :1;                                       /* Port D Bit 3 */
    word PD4         :1;                                       /* Port D Bit 4 */
    word PD5         :1;                                       /* Port D Bit 5 */
    word PD6         :1;                                       /* Port D Bit 6 */
    word PD7         :1;                                       /* Port D Bit 7 */
    word PC0         :1;                                       /* Port C Bit 0 */
    word PC1         :1;                                       /* Port C Bit 1 */
    word PC2         :1;                                       /* Port C Bit 2 */
    word PC3         :1;                                       /* Port C Bit 3 */
    word PC4         :1;                                       /* Port C Bit 4 */
    word PC5         :1;                                       /* Port C Bit 5 */
    word PC6         :1;                                       /* Port C Bit 6 */
    word PC7         :1;                                       /* Port C Bit 7 */
  } Bits;
  struct {
    word grpPD   :8;
    word grpPC   :8;
  } MergedBits;
} PORTCDSTR;
extern volatile PORTCDSTR _PORTCD @(REG_BASE + 0x00000004);
#define PORTCD _PORTCD.Word
#define PORTCD_PD0 _PORTCD.Bits.PD0
#define PORTCD_PD1 _PORTCD.Bits.PD1
#define PORTCD_PD2 _PORTCD.Bits.PD2
#define PORTCD_PD3 _PORTCD.Bits.PD3
#define PORTCD_PD4 _PORTCD.Bits.PD4
#define PORTCD_PD5 _PORTCD.Bits.PD5
#define PORTCD_PD6 _PORTCD.Bits.PD6
#define PORTCD_PD7 _PORTCD.Bits.PD7
#define PORTCD_PC0 _PORTCD.Bits.PC0
#define PORTCD_PC1 _PORTCD.Bits.PC1
#define PORTCD_PC2 _PORTCD.Bits.PC2
#define PORTCD_PC3 _PORTCD.Bits.PC3
#define PORTCD_PC4 _PORTCD.Bits.PC4
#define PORTCD_PC5 _PORTCD.Bits.PC5
#define PORTCD_PC6 _PORTCD.Bits.PC6
#define PORTCD_PC7 _PORTCD.Bits.PC7
#define PORTCD_PD _PORTCD.MergedBits.grpPD
#define PORTCD_PC _PORTCD.MergedBits.grpPC

#define PORTCD_PD0_MASK   1
#define PORTCD_PD1_MASK   2
#define PORTCD_PD2_MASK   4
#define PORTCD_PD3_MASK   8
#define PORTCD_PD4_MASK   16
#define PORTCD_PD5_MASK   32
#define PORTCD_PD6_MASK   64
#define PORTCD_PD7_MASK   128
#define PORTCD_PC0_MASK   256
#define PORTCD_PC1_MASK   512
#define PORTCD_PC2_MASK   1024
#define PORTCD_PC3_MASK   2048
#define PORTCD_PC4_MASK   4096
#define PORTCD_PC5_MASK   8192
#define PORTCD_PC6_MASK   16384
#define PORTCD_PC7_MASK   32768
#define PORTCD_PD_MASK  255
#define PORTCD_PD_BITNUM  0
#define PORTCD_PC_MASK  65280
#define PORTCD_PC_BITNUM  8


/*** DDRCD - Port CD Data Direction; 0x00000006 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** DDRC - Port C Data Direction Register; 0x00000006 ***/
    union {
      byte Byte;
      struct {
        byte DDRC0       :1;                                       /* Data Direction Port C Bit 0 */
        byte DDRC1       :1;                                       /* Data Direction Port C Bit 1 */
        byte DDRC2       :1;                                       /* Data Direction Port C Bit 2 */
        byte DDRC3       :1;                                       /* Data Direction Port C Bit 3 */
        byte DDRC4       :1;                                       /* Data Direction Port C Bit 4 */
        byte DDRC5       :1;                                       /* Data Direction Port C Bit 5 */
        byte DDRC6       :1;                                       /* Data Direction Port C Bit 6 */
        byte DDRC7       :1;                                       /* Data Direction Port C Bit 7 */
      } Bits;
      struct {
        byte grpDDRC :8;
      } MergedBits;
    } DDRCSTR;
    #define DDRC _DDRCD.Overlap_STR.DDRCSTR.Byte
    #define DDRC_DDRC0 _DDRCD.Overlap_STR.DDRCSTR.Bits.DDRC0
    #define DDRC_DDRC1 _DDRCD.Overlap_STR.DDRCSTR.Bits.DDRC1
    #define DDRC_DDRC2 _DDRCD.Overlap_STR.DDRCSTR.Bits.DDRC2
    #define DDRC_DDRC3 _DDRCD.Overlap_STR.DDRCSTR.Bits.DDRC3
    #define DDRC_DDRC4 _DDRCD.Overlap_STR.DDRCSTR.Bits.DDRC4
    #define DDRC_DDRC5 _DDRCD.Overlap_STR.DDRCSTR.Bits.DDRC5
    #define DDRC_DDRC6 _DDRCD.Overlap_STR.DDRCSTR.Bits.DDRC6
    #define DDRC_DDRC7 _DDRCD.Overlap_STR.DDRCSTR.Bits.DDRC7
    
    #define DDRC_DDRC _DDRCD.Overlap_STR.DDRCSTR.MergedBits.grpDDRC
    
    #define DDRC_DDRC0_MASK   1
    #define DDRC_DDRC1_MASK   2
    #define DDRC_DDRC2_MASK   4
    #define DDRC_DDRC3_MASK   8
    #define DDRC_DDRC4_MASK   16
    #define DDRC_DDRC5_MASK   32
    #define DDRC_DDRC6_MASK   64
    #define DDRC_DDRC7_MASK   128
    #define DDRC_DDRC_MASK  255
    #define DDRC_DDRC_BITNUM  0


    /*** DDRD - Port D Data Direction Register; 0x00000007 ***/
    union {
      byte Byte;
      struct {
        byte DDRD0       :1;                                       /* Data Direction Port D Bit 0 */
        byte DDRD1       :1;                                       /* Data Direction Port D Bit 1 */
        byte DDRD2       :1;                                       /* Data Direction Port D Bit 2 */
        byte DDRD3       :1;                                       /* Data Direction Port D Bit 3 */
        byte DDRD4       :1;                                       /* Data Direction Port D Bit 4 */
        byte DDRD5       :1;                                       /* Data Direction Port D Bit 5 */
        byte DDRD6       :1;                                       /* Data Direction Port D Bit 6 */
        byte DDRD7       :1;                                       /* Data Direction Port D Bit 7 */
      } Bits;
      struct {
        byte grpDDRD :8;
      } MergedBits;
    } DDRDSTR;
    #define DDRD _DDRCD.Overlap_STR.DDRDSTR.Byte
    #define DDRD_DDRD0 _DDRCD.Overlap_STR.DDRDSTR.Bits.DDRD0
    #define DDRD_DDRD1 _DDRCD.Overlap_STR.DDRDSTR.Bits.DDRD1
    #define DDRD_DDRD2 _DDRCD.Overlap_STR.DDRDSTR.Bits.DDRD2
    #define DDRD_DDRD3 _DDRCD.Overlap_STR.DDRDSTR.Bits.DDRD3
    #define DDRD_DDRD4 _DDRCD.Overlap_STR.DDRDSTR.Bits.DDRD4
    #define DDRD_DDRD5 _DDRCD.Overlap_STR.DDRDSTR.Bits.DDRD5
    #define DDRD_DDRD6 _DDRCD.Overlap_STR.DDRDSTR.Bits.DDRD6
    #define DDRD_DDRD7 _DDRCD.Overlap_STR.DDRDSTR.Bits.DDRD7
    
