frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
/*** EIFCTL - External Bus Interface Control Register; 0x0000000A ***/
typedef union {
  byte Byte;
  struct {
    byte EWAIT       :1;                                       /* External Wait Enable */
    byte NCLKX2      :1;                                       /* No External 2X (cpu) Clock */
    byte EDIV0       :1;                                       /* Divider for Free-Running External E Clock Bit 0 */
    byte EDIV1       :1;                                       /* Divider for Free-Running External E Clock Bit 1 */
    byte NECLK       :1;                                       /* No External E Clock */
    byte CS0E        :1;                                       /* Chip Select Enable 0 */
    byte CS1E        :1;                                       /* Chip Select Enable 1 */
    byte CS2E        :1;                                       /* Chip Select Enable 2 */
  } Bits;
  struct {
    byte         :1;
    byte grpNCLKX_2 :1;
    byte grpEDIV :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} EIFCTLSTR;
extern volatile EIFCTLSTR _EIFCTL @(REG_BASE + 0x0000000A);
#define EIFCTL _EIFCTL.Byte
#define EIFCTL_EWAIT _EIFCTL.Bits.EWAIT
#define EIFCTL_NCLKX2 _EIFCTL.Bits.NCLKX2
#define EIFCTL_EDIV0 _EIFCTL.Bits.EDIV0
#define EIFCTL_EDIV1 _EIFCTL.Bits.EDIV1
#define EIFCTL_NECLK _EIFCTL.Bits.NECLK
#define EIFCTL_CS0E _EIFCTL.Bits.CS0E
#define EIFCTL_CS1E _EIFCTL.Bits.CS1E
#define EIFCTL_CS2E _EIFCTL.Bits.CS2E
#define EIFCTL_EDIV _EIFCTL.MergedBits.grpEDIV

#define EIFCTL_EWAIT_MASK   1
#define EIFCTL_NCLKX2_MASK   2
#define EIFCTL_EDIV0_MASK   4
#define EIFCTL_EDIV1_MASK   8
#define EIFCTL_NECLK_MASK   16
#define EIFCTL_CS0E_MASK   32
#define EIFCTL_CS1E_MASK   64
#define EIFCTL_CS2E_MASK   128
#define EIFCTL_EDIV_MASK  12
#define EIFCTL_EDIV_BITNUM  2


/*** MODE - Mode Register; 0x0000000B ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte IVIS        :1;                                       /* Internal Visibility */
    byte ITHRS       :1;                                       /* Input Threshold */
    byte MODA        :1;                                       /* Mode Select Bit A */
    byte MODB        :1;                                       /* Mode Select Bit B */
    byte MODC        :1;                                       /* Mode Select Bit C */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpMODx :3;
  } MergedBits;
} MODESTR;
extern volatile MODESTR _MODE @(REG_BASE + 0x0000000B);
#define MODE _MODE.Byte
#define MODE_IVIS _MODE.Bits.IVIS
#define MODE_ITHRS _MODE.Bits.ITHRS
#define MODE_MODA _MODE.Bits.MODA
#define MODE_MODB _MODE.Bits.MODB
#define MODE_MODC _MODE.Bits.MODC
#define MODE_MODx _MODE.MergedBits.grpMODx

#define MODE_IVIS_MASK   8
#define MODE_ITHRS_MASK   16
#define MODE_MODA_MASK   32
#define MODE_MODB_MASK   64
#define MODE_MODC_MASK   128
#define MODE_MODx_MASK  224
#define MODE_MODx_BITNUM  5


/*** PUCR - Pull-Up Control Register; 0x0000000C ***/
typedef union {
  byte Byte;
  struct {
    byte PUPAE       :1;                                       /* Pull-Up Port A Enable */
    byte PUPBE       :1;                                       /* Pull-Up Port B Enable */
    byte PUPCE       :1;                                       /* Pull-Up Port C Enable */
    byte PUPDE       :1;                                       /* Pull-Up Port D Enable */
    byte PUPEE       :1;                                       /* Pull-Up Port E Enable */
    byte             :1; 
    byte PUPUE       :1;                                       /* Pull-Up Port U Enable */
    byte PUPKE       :1;                                       /* Pull-Up Port K Enable */
  } Bits;
} PUCRSTR;
extern volatile PUCRSTR _PUCR @(REG_BASE + 0x0000000C);
#define PUCR _PUCR.Byte
#define PUCR_PUPAE _PUCR.Bits.PUPAE
#define PUCR_PUPBE _PUCR.Bits.PUPBE
#define PUCR_PUPCE _PUCR.Bits.PUPCE
#define PUCR_PUPDE _PUCR.Bits.PUPDE
#define PUCR_PUPEE _PUCR.Bits.PUPEE
#define PUCR_PUPUE _PUCR.Bits.PUPUE
#define PUCR_PUPKE _PUCR.Bits.PUPKE

#define PUCR_PUPAE_MASK   1
#define PUCR_PUPBE_MASK   2
#define PUCR_PUPCE_MASK   4
#define PUCR_PUPDE_MASK   8
#define PUCR_PUPEE_MASK   16
#define PUCR_PUPUE_MASK   64
#define PUCR_PUPKE_MASK   128


/*** RDRIV - Reduced Drive of I/O Lines; 0x0000000D ***/
typedef union {
  byte Byte;
  struct {
    byte RDPA        :1;                                       /* Reduced Drive of Port A */
    byte RDPB        :1;                                       /* Reduced Drive of Port B */
    byte RDPC        :1;                                       /* Reduced Drive of Port C */
    byte RDPD        :1;                                       /* Reduced Drive of Port D */
    byte RDPE        :1;                                       /* Reduced Drive of Port E */
    byte             :1; 
    byte             :1; 
    byte RDPK        :1;                                       /* Reduced Drive of Port K */
  } Bits;
  struct {
    byte grpRDPx :5;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} RDRIVSTR;
extern volatile RDRIVSTR _RDRIV @(REG_BASE + 0x0000000D);
#define RDRIV _RDRIV.Byte
#define RDRIV_RDPA _RDRIV.Bits.RDPA
#define RDRIV_RDPB _RDRIV.Bits.RDPB
#define RDRIV_RDPC _RDRIV.Bits.RDPC
#define RDRIV_RDPD _RDRIV.Bits.RDPD
#define RDRIV_RDPE _RDRIV.Bits.RDPE
#define RDRIV_RDPK _RDRIV.Bits.RDPK
#define RDRIV_RDPx _RDRIV.MergedBits.grpRDPx

#define RDRIV_RDPA_MASK   1
#define RDRIV_RDPB_MASK   2
#define RDRIV_RDPC_MASK   4
#define RDRIV_RDPD_MASK   8
#define RDRIV_RDPE_MASK   16
#define RDRIV_RDPK_MASK   128
#define RDRIV_RDPx_MASK  31
#define RDRIV_RDPx_BITNUM  0


/*** GPAGE - Global Page Index Register; 0x00000010 ***/
typedef union {
  byte Byte;
  struct {
    byte GP0         :1;                                       /* Global Page Index Bit 0 */
    byte GP1         :1;                                       /* Global Page Index Bit 1 */
    byte GP2         :1;                                       /* Global Page Index Bit 2 */
    byte GP3         :1;                                       /* Global Page Index Bit 3 */
    byte GP4         :1;                                       /* Global Page Index Bit 4 */
    byte GP5         :1;                                       /* Global Page Index Bit 5 */
    byte GP6         :1;                                       /* Global Page Index Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpGP   :7;
    byte         :1;
  } MergedBits;
} GPAGESTR;
