frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
#define DBGXAM_BIT8_MASK   1
#define DBGXAM_BIT9_MASK   2
#define DBGXAM_BIT10_MASK   4
#define DBGXAM_BIT11_MASK   8
#define DBGXAM_BIT12_MASK   16
#define DBGXAM_BIT13_MASK   32
#define DBGXAM_BIT14_MASK   64
#define DBGXAM_BIT15_MASK   128
#define DBGXAM_BIT_8_MASK  255
#define DBGXAM_BIT_8_BITNUM  0


/*** DBGXAL - Debug Comparator Address Low Register; 0x0000002B ***/
typedef union {
  byte Byte;
  struct {
    byte BIT0        :1;                                       /* Comparator Address Low Compare Bit 0 */
    byte BIT1        :1;                                       /* Comparator Address Low Compare Bit 1 */
    byte BIT2        :1;                                       /* Comparator Address Low Compare Bit 2 */
    byte BIT3        :1;                                       /* Comparator Address Low Compare Bit 3 */
    byte BIT4        :1;                                       /* Comparator Address Low Compare Bit 4 */
    byte BIT5        :1;                                       /* Comparator Address Low Compare Bit 5 */
    byte BIT6        :1;                                       /* Comparator Address Low Compare Bit 6 */
    byte BIT7        :1;                                       /* Comparator Address Low Compare Bit 7 */
  } Bits;
  struct {
    byte grpBIT  :8;
  } MergedBits;
} DBGXALSTR;
extern volatile DBGXALSTR _DBGXAL @(REG_BASE + 0x0000002B);
#define DBGXAL _DBGXAL.Byte
#define DBGXAL_BIT0 _DBGXAL.Bits.BIT0
#define DBGXAL_BIT1 _DBGXAL.Bits.BIT1
#define DBGXAL_BIT2 _DBGXAL.Bits.BIT2
#define DBGXAL_BIT3 _DBGXAL.Bits.BIT3
#define DBGXAL_BIT4 _DBGXAL.Bits.BIT4
#define DBGXAL_BIT5 _DBGXAL.Bits.BIT5
#define DBGXAL_BIT6 _DBGXAL.Bits.BIT6
#define DBGXAL_BIT7 _DBGXAL.Bits.BIT7
#define DBGXAL_BIT _DBGXAL.MergedBits.grpBIT

#define DBGXAL_BIT0_MASK   1
#define DBGXAL_BIT1_MASK   2
#define DBGXAL_BIT2_MASK   4
#define DBGXAL_BIT3_MASK   8
#define DBGXAL_BIT4_MASK   16
#define DBGXAL_BIT5_MASK   32
#define DBGXAL_BIT6_MASK   64
#define DBGXAL_BIT7_MASK   128
#define DBGXAL_BIT_MASK  255
#define DBGXAL_BIT_BITNUM  0


/*** DBGXDH - Debug Comparator Data High Register; 0x0000002C ***/
typedef union {
  byte Byte;
  struct {
    byte BIT0        :1;                                       /* Comparator A Compare Bit 0 */
    byte BIT1        :1;                                       /* Comparator A Compare Bit 1 */
    byte BIT2        :1;                                       /* Comparator A Compare Bit 2 */
    byte BIT3        :1;                                       /* Comparator A Compare Bit 3 */
    byte BIT4        :1;                                       /* Comparator A Compare Bit 4 */
    byte BIT5        :1;                                       /* Comparator A Compare Bit 5 */
    byte BIT6        :1;                                       /* Comparator A Compare Bit 6 */
    byte BIT7        :1;                                       /* Comparator A Compare Bit 7 */
  } Bits;
  struct {
    byte grpBIT  :8;
  } MergedBits;
} DBGXDHSTR;
extern volatile DBGXDHSTR _DBGXDH @(REG_BASE + 0x0000002C);
#define DBGXDH _DBGXDH.Byte
#define DBGXDH_BIT0 _DBGXDH.Bits.BIT0
#define DBGXDH_BIT1 _DBGXDH.Bits.BIT1
#define DBGXDH_BIT2 _DBGXDH.Bits.BIT2
#define DBGXDH_BIT3 _DBGXDH.Bits.BIT3
#define DBGXDH_BIT4 _DBGXDH.Bits.BIT4
#define DBGXDH_BIT5 _DBGXDH.Bits.BIT5
#define DBGXDH_BIT6 _DBGXDH.Bits.BIT6
#define DBGXDH_BIT7 _DBGXDH.Bits.BIT7
#define DBGXDH_BIT _DBGXDH.MergedBits.grpBIT

#define DBGXDH_BIT0_MASK   1
#define DBGXDH_BIT1_MASK   2
#define DBGXDH_BIT2_MASK   4
#define DBGXDH_BIT3_MASK   8
#define DBGXDH_BIT4_MASK   16
#define DBGXDH_BIT5_MASK   32
#define DBGXDH_BIT6_MASK   64
#define DBGXDH_BIT7_MASK   128
#define DBGXDH_BIT_MASK  255
#define DBGXDH_BIT_BITNUM  0


/*** DBGXDL - Debug Comparator Data Low Register; 0x0000002D ***/
typedef union {
  byte Byte;
  struct {
    byte BIT0        :1;                                       /* Comparator Address Low Compare Bit 0 */
    byte BIT1        :1;                                       /* Comparator Address Low Compare Bit 1 */
    byte BIT2        :1;                                       /* Comparator Address Low Compare Bit 2 */
    byte BIT3        :1;                                       /* Comparator Address Low Compare Bit 3 */
    byte BIT4        :1;                                       /* Comparator Address Low Compare Bit 4 */
    byte BIT5        :1;                                       /* Comparator Address Low Compare Bit 5 */
    byte BIT6        :1;                                       /* Comparator Address Low Compare Bit 6 */
    byte BIT7        :1;                                       /* Comparator Address Low Compare Bit 7 */
  } Bits;
  struct {
    byte grpBIT  :8;
  } MergedBits;
} DBGXDLSTR;
extern volatile DBGXDLSTR _DBGXDL @(REG_BASE + 0x0000002D);
#define DBGXDL _DBGXDL.Byte
#define DBGXDL_BIT0 _DBGXDL.Bits.BIT0
#define DBGXDL_BIT1 _DBGXDL.Bits.BIT1
#define DBGXDL_BIT2 _DBGXDL.Bits.BIT2
#define DBGXDL_BIT3 _DBGXDL.Bits.BIT3
#define DBGXDL_BIT4 _DBGXDL.Bits.BIT4
#define DBGXDL_BIT5 _DBGXDL.Bits.BIT5
#define DBGXDL_BIT6 _DBGXDL.Bits.BIT6
#define DBGXDL_BIT7 _DBGXDL.Bits.BIT7
#define DBGXDL_BIT _DBGXDL.MergedBits.grpBIT

#define DBGXDL_BIT0_MASK   1
#define DBGXDL_BIT1_MASK   2
#define DBGXDL_BIT2_MASK   4
#define DBGXDL_BIT3_MASK   8
#define DBGXDL_BIT4_MASK   16
#define DBGXDL_BIT5_MASK   32
#define DBGXDL_BIT6_MASK   64
#define DBGXDL_BIT7_MASK   128
#define DBGXDL_BIT_MASK  255
#define DBGXDL_BIT_BITNUM  0


/*** DBGXDHM - Debug Comparator Data High Mask Register; 0x0000002E ***/
typedef union {
  byte Byte;
  struct {
    byte BIT8        :1;                                       /* Comparator Data High Mask Bit 8 */
    byte BIT9        :1;                                       /* Comparator Data High Mask Bit 9 */
    byte BIT10       :1;                                       /* Comparator Data High Mask Bit 10 */
    byte BIT11       :1;                                       /* Comparator Data High Mask Bit 11 */
    byte BIT12       :1;                                       /* Comparator Data High Mask Bit 12 */
    byte BIT13       :1;                                       /* Comparator Data High Mask Bit 13 */
    byte BIT14       :1;                                       /* Comparator Data High Mask Bit 14 */
    byte BIT15       :1;                                       /* Comparator Data High Mask Bit 15 */
  } Bits;
  struct {
    byte grpBIT_8 :8;
  } MergedBits;
} DBGXDHMSTR;
extern volatile DBGXDHMSTR _DBGXDHM @(REG_BASE + 0x0000002E);
#define DBGXDHM _DBGXDHM.Byte
#define DBGXDHM_BIT8 _DBGXDHM.Bits.BIT8
#define DBGXDHM_BIT9 _DBGXDHM.Bits.BIT9
#define DBGXDHM_BIT10 _DBGXDHM.Bits.BIT10
#define DBGXDHM_BIT11 _DBGXDHM.Bits.BIT11
#define DBGXDHM_BIT12 _DBGXDHM.Bits.BIT12
#define DBGXDHM_BIT13 _DBGXDHM.Bits.BIT13
#define DBGXDHM_BIT14 _DBGXDHM.Bits.BIT14
#define DBGXDHM_BIT15 _DBGXDHM.Bits.BIT15
#define DBGXDHM_BIT_8 _DBGXDHM.MergedBits.grpBIT_8
#define DBGXDHM_BIT DBGXDHM_BIT_8

#define DBGXDHM_BIT8_MASK   1
#define DBGXDHM_BIT9_MASK   2
#define DBGXDHM_BIT10_MASK   4
#define DBGXDHM_BIT11_MASK   8
#define DBGXDHM_BIT12_MASK   16
#define DBGXDHM_BIT13_MASK   32
#define DBGXDHM_BIT14_MASK   64
#define DBGXDHM_BIT15_MASK   128
#define DBGXDHM_BIT_8_MASK  255
#define DBGXDHM_BIT_8_BITNUM  0


/*** DBGXDLM - Debug Comparator Data Low Mask Register; 0x0000002F ***/
typedef union {
  byte Byte;
  struct {
    byte BIT0        :1;                                       /* Comparator Data High Mask Bit 0 */
    byte BIT1        :1;                                       /* Comparator Data High Mask Bit 1 */
    byte BIT2        :1;                                       /* Comparator Data High Mask Bit 2 */
    byte BIT3        :1;                                       /* Comparator Data High Mask Bit 3 */
    byte BIT4        :1;                                       /* Comparator Data High Mask Bit 4 */
    byte BIT5        :1;                                       /* Comparator Data High Mask Bit 5 */
    byte BIT6        :1;                                       /* Comparator Data High Mask Bit 6 */
    byte BIT7        :1;                                       /* Comparator Data High Mask Bit 7 */
  } Bits;
  struct {
    byte grpBIT  :8;
  } MergedBits;
} DBGXDLMSTR;
extern volatile DBGXDLMSTR _DBGXDLM @(REG_BASE + 0x0000002F);
#define DBGXDLM _DBGXDLM.Byte
#define DBGXDLM_BIT0 _DBGXDLM.Bits.BIT0
#define DBGXDLM_BIT1 _DBGXDLM.Bits.BIT1
#define DBGXDLM_BIT2 _DBGXDLM.Bits.BIT2
#define DBGXDLM_BIT3 _DBGXDLM.Bits.BIT3
#define DBGXDLM_BIT4 _DBGXDLM.Bits.BIT4
#define DBGXDLM_BIT5 _DBGXDLM.Bits.BIT5
#define DBGXDLM_BIT6 _DBGXDLM.Bits.BIT6
#define DBGXDLM_BIT7 _DBGXDLM.Bits.BIT7
#define DBGXDLM_BIT _DBGXDLM.MergedBits.grpBIT

#define DBGXDLM_BIT0_MASK   1
#define DBGXDLM_BIT1_MASK   2
#define DBGXDLM_BIT2_MASK   4
#define DBGXDLM_BIT3_MASK   8
#define DBGXDLM_BIT4_MASK   16
#define DBGXDLM_BIT5_MASK   32
#define DBGXDLM_BIT6_MASK   64
#define DBGXDLM_BIT7_MASK   128
#define DBGXDLM_BIT_MASK  255
#define DBGXDLM_BIT_BITNUM  0


/*** PPAGE - Program Page Index Register; 0x00000030 ***/
typedef union {
  byte Byte;
  struct {
    byte PIX0        :1;                                       /* Program Page Index Bit 0 */
    byte PIX1        :1;                                       /* Program Page Index Bit 1 */
    byte PIX2        :1;                                       /* Program Page Index Bit 2 */
    byte PIX3        :1;                                       /* Program Page Index Bit 3 */
    byte PIX4        :1;                                       /* Program Page Index Bit 4 */
    byte PIX5        :1;                                       /* Program Page Index Bit 5 */
    byte PIX6        :1;                                       /* Program Page Index Bit 6 */
    byte PIX7        :1;                                       /* Program Page Index Bit 7 */
  } Bits;
  struct {
    byte grpPIX  :8;
  } MergedBits;
} PPAGESTR;
