frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
/*** ICPAR - Input Control Pulse Accumulator Register; 0x00000068 ***/
typedef union {
  byte Byte;
  struct {
    byte PA0EN       :1;                                       /* 8-Bit Pulse Accumulator 0 Enable */
    byte PA1EN       :1;                                       /* 8-Bit Pulse Accumulator 1 Enable */
    byte PA2EN       :1;                                       /* 8-Bit Pulse Accumulator 2 Enable */
    byte PA3EN       :1;                                       /* 8-Bit Pulse Accumulator 3 Enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} ICPARSTR;
extern volatile ICPARSTR _ICPAR @(REG_BASE + 0x00000068);
#define ICPAR _ICPAR.Byte
#define ICPAR_PA0EN _ICPAR.Bits.PA0EN
#define ICPAR_PA1EN _ICPAR.Bits.PA1EN
#define ICPAR_PA2EN _ICPAR.Bits.PA2EN
#define ICPAR_PA3EN _ICPAR.Bits.PA3EN

#define ICPAR_PA0EN_MASK   1
#define ICPAR_PA1EN_MASK   2
#define ICPAR_PA2EN_MASK   4
#define ICPAR_PA3EN_MASK   8


/*** DLYCT - Delay Counter Control Register; 0x00000069 ***/
typedef union {
  byte Byte;
  struct {
    byte DLY0        :1;                                       /* Delay Counter Select Bit 0 */
    byte DLY1        :1;                                       /* Delay Counter Select Bit 1 */
    byte DLY2        :1;                                       /* Delay Counter Select Bit 2 */
    byte DLY3        :1;                                       /* Delay Counter Select Bit 3 */
    byte DLY4        :1;                                       /* Delay Counter Select Bit 4 */
    byte DLY5        :1;                                       /* Delay Counter Select Bit 5 */
    byte DLY6        :1;                                       /* Delay Counter Select Bit 6 */
    byte DLY7        :1;                                       /* Delay Counter Select Bit 7 */
  } Bits;
  struct {
    byte grpDLY  :8;
  } MergedBits;
} DLYCTSTR;
extern volatile DLYCTSTR _DLYCT @(REG_BASE + 0x00000069);
#define DLYCT _DLYCT.Byte
#define DLYCT_DLY0 _DLYCT.Bits.DLY0
#define DLYCT_DLY1 _DLYCT.Bits.DLY1
#define DLYCT_DLY2 _DLYCT.Bits.DLY2
#define DLYCT_DLY3 _DLYCT.Bits.DLY3
#define DLYCT_DLY4 _DLYCT.Bits.DLY4
#define DLYCT_DLY5 _DLYCT.Bits.DLY5
#define DLYCT_DLY6 _DLYCT.Bits.DLY6
#define DLYCT_DLY7 _DLYCT.Bits.DLY7
#define DLYCT_DLY _DLYCT.MergedBits.grpDLY

#define DLYCT_DLY0_MASK   1
#define DLYCT_DLY1_MASK   2
#define DLYCT_DLY2_MASK   4
#define DLYCT_DLY3_MASK   8
#define DLYCT_DLY4_MASK   16
#define DLYCT_DLY5_MASK   32
#define DLYCT_DLY6_MASK   64
#define DLYCT_DLY7_MASK   128
#define DLYCT_DLY_MASK  255
#define DLYCT_DLY_BITNUM  0


/*** ICOVW - Input Control Overwrite Register; 0x0000006A ***/
typedef union {
  byte Byte;
  struct {
    byte NOVW0       :1;                                       /* No Input Capture Overwrite 0 */
    byte NOVW1       :1;                                       /* No Input Capture Overwrite 1 */
    byte NOVW2       :1;                                       /* No Input Capture Overwrite 2 */
    byte NOVW3       :1;                                       /* No Input Capture Overwrite 3 */
    byte NOVW4       :1;                                       /* No Input Capture Overwrite 4 */
    byte NOVW5       :1;                                       /* No Input Capture Overwrite 5 */
    byte NOVW6       :1;                                       /* No Input Capture Overwrite 6 */
    byte NOVW7       :1;                                       /* No Input Capture Overwrite 7 */
  } Bits;
  struct {
    byte grpNOVW :8;
  } MergedBits;
} ICOVWSTR;
extern volatile ICOVWSTR _ICOVW @(REG_BASE + 0x0000006A);
#define ICOVW _ICOVW.Byte
#define ICOVW_NOVW0 _ICOVW.Bits.NOVW0
#define ICOVW_NOVW1 _ICOVW.Bits.NOVW1
#define ICOVW_NOVW2 _ICOVW.Bits.NOVW2
#define ICOVW_NOVW3 _ICOVW.Bits.NOVW3
#define ICOVW_NOVW4 _ICOVW.Bits.NOVW4
#define ICOVW_NOVW5 _ICOVW.Bits.NOVW5
#define ICOVW_NOVW6 _ICOVW.Bits.NOVW6
#define ICOVW_NOVW7 _ICOVW.Bits.NOVW7
#define ICOVW_NOVW _ICOVW.MergedBits.grpNOVW

#define ICOVW_NOVW0_MASK   1
#define ICOVW_NOVW1_MASK   2
#define ICOVW_NOVW2_MASK   4
#define ICOVW_NOVW3_MASK   8
#define ICOVW_NOVW4_MASK   16
#define ICOVW_NOVW5_MASK   32
#define ICOVW_NOVW6_MASK   64
#define ICOVW_NOVW7_MASK   128
#define ICOVW_NOVW_MASK  255
#define ICOVW_NOVW_BITNUM  0


/*** ICSYS - Input Control System Control Register; 0x0000006B ***/
typedef union {
  byte Byte;
  struct {
    byte LATQ        :1;                                       /* Input Control Latch or Queue Mode Enable */
    byte BUFEN       :1;                                       /* IC Buffer Enable */
    byte PACMX       :1;                                       /* 8-Bit Pulse Accumulators Maximum Count */
    byte TFMOD       :1;                                       /* Timer Flag-setting Mode */
    byte SH04        :1;                                       /* Share Input action of Input Capture Channels 0 and 4 */
    byte SH15        :1;                                       /* Share Input action of Input Capture Channels 1 and 5 */
    byte SH26        :1;                                       /* Share Input action of Input Capture Channels 2 and 6 */
    byte SH37        :1;                                       /* Share Input action of Input Capture Channels 3 and 7 */
  } Bits;
} ICSYSSTR;
extern volatile ICSYSSTR _ICSYS @(REG_BASE + 0x0000006B);
#define ICSYS _ICSYS.Byte
#define ICSYS_LATQ _ICSYS.Bits.LATQ
#define ICSYS_BUFEN _ICSYS.Bits.BUFEN
#define ICSYS_PACMX _ICSYS.Bits.PACMX
#define ICSYS_TFMOD _ICSYS.Bits.TFMOD
#define ICSYS_SH04 _ICSYS.Bits.SH04
#define ICSYS_SH15 _ICSYS.Bits.SH15
#define ICSYS_SH26 _ICSYS.Bits.SH26
#define ICSYS_SH37 _ICSYS.Bits.SH37

#define ICSYS_LATQ_MASK   1
#define ICSYS_BUFEN_MASK   2
#define ICSYS_PACMX_MASK   4
#define ICSYS_TFMOD_MASK   8
#define ICSYS_SH04_MASK   16
#define ICSYS_SH15_MASK   32
#define ICSYS_SH26_MASK   64
#define ICSYS_SH37_MASK   128


/*** PTPSR - Precision Timer Prescaler Select; 0x0000006E ***/
typedef union {
  byte Byte;
  struct {
    byte PTPS0       :1;                                       /* Precision Timer Prescaler Select Bit 0 */
    byte PTPS1       :1;                                       /* Precision Timer Prescaler Select Bit 1 */
    byte PTPS2       :1;                                       /* Precision Timer Prescaler Select Bit 2 */
    byte PTPS3       :1;                                       /* Precision Timer Prescaler Select Bit 3 */
    byte PTPS4       :1;                                       /* Precision Timer Prescaler Select Bit 4 */
    byte PTPS5       :1;                                       /* Precision Timer Prescaler Select Bit 5 */
    byte PTPS6       :1;                                       /* Precision Timer Prescaler Select Bit 6 */
    byte PTPS7       :1;                                       /* Precision Timer Prescaler Select Bit 7 */
  } Bits;
  struct {
    byte grpPTPS :8;
  } MergedBits;
} PTPSRSTR;
extern volatile PTPSRSTR _PTPSR @(REG_BASE + 0x0000006E);
#define PTPSR _PTPSR.Byte
#define PTPSR_PTPS0 _PTPSR.Bits.PTPS0
#define PTPSR_PTPS1 _PTPSR.Bits.PTPS1
#define PTPSR_PTPS2 _PTPSR.Bits.PTPS2
#define PTPSR_PTPS3 _PTPSR.Bits.PTPS3
#define PTPSR_PTPS4 _PTPSR.Bits.PTPS4
#define PTPSR_PTPS5 _PTPSR.Bits.PTPS5
#define PTPSR_PTPS6 _PTPSR.Bits.PTPS6
#define PTPSR_PTPS7 _PTPSR.Bits.PTPS7
#define PTPSR_PTPS _PTPSR.MergedBits.grpPTPS

#define PTPSR_PTPS0_MASK   1
#define PTPSR_PTPS1_MASK   2
#define PTPSR_PTPS2_MASK   4
#define PTPSR_PTPS3_MASK   8
#define PTPSR_PTPS4_MASK   16
#define PTPSR_PTPS5_MASK   32
#define PTPSR_PTPS6_MASK   64
#define PTPSR_PTPS7_MASK   128
#define PTPSR_PTPS_MASK  255
#define PTPSR_PTPS_BITNUM  0


/*** PTMCPSR - Precision Timer Modulus Counter Prescaler Select Register; 0x0000006F ***/
typedef union {
  byte Byte;
  struct {
    byte PTMPS0      :1;                                       /* Precision Timer Modulus Counter Prescaler Select bit 0 */
    byte PTMPS1      :1;                                       /* Precision Timer Modulus Counter Prescaler Select bit 1 */
    byte PTMPS2      :1;                                       /* Precision Timer Modulus Counter Prescaler Select bit 2 */
    byte PTMPS3      :1;                                       /* Precision Timer Modulus Counter Prescaler Select bit 3 */
    byte PTMPS4      :1;                                       /* Precision Timer Modulus Counter Prescaler Select bit 4 */
    byte PTMPS5      :1;                                       /* Precision Timer Modulus Counter Prescaler Select bit 5 */
    byte PTMPS6      :1;                                       /* Precision Timer Modulus Counter Prescaler Select bit 6 */
    byte PTMPS7      :1;                                       /* Precision Timer Modulus Counter Prescaler Select bit 7 */
  } Bits;
  struct {
    byte grpPTMPS :8;
  } MergedBits;
} PTMCPSRSTR;
extern volatile PTMCPSRSTR _PTMCPSR @(REG_BASE + 0x0000006F);
#define PTMCPSR _PTMCPSR.Byte
#define PTMCPSR_PTMPS0 _PTMCPSR.Bits.PTMPS0
#define PTMCPSR_PTMPS1 _PTMCPSR.Bits.PTMPS1
#define PTMCPSR_PTMPS2 _PTMCPSR.Bits.PTMPS2
#define PTMCPSR_PTMPS3 _PTMCPSR.Bits.PTMPS3
#define PTMCPSR_PTMPS4 _PTMCPSR.Bits.PTMPS4
#define PTMCPSR_PTMPS5 _PTMCPSR.Bits.PTMPS5
#define PTMCPSR_PTMPS6 _PTMCPSR.Bits.PTMPS6
#define PTMCPSR_PTMPS7 _PTMCPSR.Bits.PTMPS7
#define PTMCPSR_PTMPS _PTMCPSR.MergedBits.grpPTMPS

