frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
    #define PA1H_BIT _PA10H.Overlap_STR.PA1HSTR.MergedBits.grpBIT
    
    #define PA1H_BIT0_MASK   1
    #define PA1H_BIT1_MASK   2
    #define PA1H_BIT2_MASK   4
    #define PA1H_BIT3_MASK   8
    #define PA1H_BIT4_MASK   16
    #define PA1H_BIT5_MASK   32
    #define PA1H_BIT6_MASK   64
    #define PA1H_BIT7_MASK   128
    #define PA1H_BIT_MASK  255
    #define PA1H_BIT_BITNUM  0


    /*** PA0H - 8-Bit Pulse Accumulators Holding 0 Register; 0x00000075 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Pulse Accumulator Bit 0 */
        byte BIT1        :1;                                       /* Pulse Accumulator Bit 1 */
        byte BIT2        :1;                                       /* Pulse Accumulator Bit 2 */
        byte BIT3        :1;                                       /* Pulse Accumulator Bit 3 */
        byte BIT4        :1;                                       /* Pulse Accumulator Bit 4 */
        byte BIT5        :1;                                       /* Pulse Accumulator Bit 5 */
        byte BIT6        :1;                                       /* Pulse Accumulator Bit 6 */
        byte BIT7        :1;                                       /* Pulse Accumulator Bit 7 */
      } Bits;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } PA0HSTR;
    #define PA0H _PA10H.Overlap_STR.PA0HSTR.Byte
    #define PA0H_BIT0 _PA10H.Overlap_STR.PA0HSTR.Bits.BIT0
    #define PA0H_BIT1 _PA10H.Overlap_STR.PA0HSTR.Bits.BIT1
    #define PA0H_BIT2 _PA10H.Overlap_STR.PA0HSTR.Bits.BIT2
    #define PA0H_BIT3 _PA10H.Overlap_STR.PA0HSTR.Bits.BIT3
    #define PA0H_BIT4 _PA10H.Overlap_STR.PA0HSTR.Bits.BIT4
    #define PA0H_BIT5 _PA10H.Overlap_STR.PA0HSTR.Bits.BIT5
    #define PA0H_BIT6 _PA10H.Overlap_STR.PA0HSTR.Bits.BIT6
    #define PA0H_BIT7 _PA10H.Overlap_STR.PA0HSTR.Bits.BIT7
    
    #define PA0H_BIT _PA10H.Overlap_STR.PA0HSTR.MergedBits.grpBIT
    
    #define PA0H_BIT0_MASK   1
    #define PA0H_BIT1_MASK   2
    #define PA0H_BIT2_MASK   4
    #define PA0H_BIT3_MASK   8
    #define PA0H_BIT4_MASK   16
    #define PA0H_BIT5_MASK   32
    #define PA0H_BIT6_MASK   64
    #define PA0H_BIT7_MASK   128
    #define PA0H_BIT_MASK  255
    #define PA0H_BIT_BITNUM  0

  } Overlap_STR;

  struct {
    word BIT0        :1;                                       /* Pulse Accumulator Bit 0 */
    word BIT1        :1;                                       /* Pulse Accumulator Bit 1 */
    word BIT2        :1;                                       /* Pulse Accumulator Bit 2 */
    word BIT3        :1;                                       /* Pulse Accumulator Bit 3 */
    word BIT4        :1;                                       /* Pulse Accumulator Bit 4 */
    word BIT5        :1;                                       /* Pulse Accumulator Bit 5 */
    word BIT6        :1;                                       /* Pulse Accumulator Bit 6 */
    word BIT7        :1;                                       /* Pulse Accumulator Bit 7 */
    word BIT8        :1;                                       /* Pulse Accumulator Bit 8 */
    word BIT9        :1;                                       /* Pulse Accumulator Bit 9 */
    word BIT10       :1;                                       /* Pulse Accumulator Bit 10 */
    word BIT11       :1;                                       /* Pulse Accumulator Bit 11 */
    word BIT12       :1;                                       /* Pulse Accumulator Bit 12 */
    word BIT13       :1;                                       /* Pulse Accumulator Bit 13 */
    word BIT14       :1;                                       /* Pulse Accumulator Bit 14 */
    word BIT15       :1;                                       /* Pulse Accumulator Bit 15 */
  } Bits;
  struct {
    word grpBIT  :16;
  } MergedBits;
} PA10HSTR;
extern volatile PA10HSTR _PA10H @(REG_BASE + 0x00000074);
#define PA10H _PA10H.Word
#define PA10H_BIT0 _PA10H.Bits.BIT0
#define PA10H_BIT1 _PA10H.Bits.BIT1
#define PA10H_BIT2 _PA10H.Bits.BIT2
#define PA10H_BIT3 _PA10H.Bits.BIT3
#define PA10H_BIT4 _PA10H.Bits.BIT4
#define PA10H_BIT5 _PA10H.Bits.BIT5
#define PA10H_BIT6 _PA10H.Bits.BIT6
#define PA10H_BIT7 _PA10H.Bits.BIT7
#define PA10H_BIT8 _PA10H.Bits.BIT8
#define PA10H_BIT9 _PA10H.Bits.BIT9
#define PA10H_BIT10 _PA10H.Bits.BIT10
#define PA10H_BIT11 _PA10H.Bits.BIT11
#define PA10H_BIT12 _PA10H.Bits.BIT12
#define PA10H_BIT13 _PA10H.Bits.BIT13
#define PA10H_BIT14 _PA10H.Bits.BIT14
#define PA10H_BIT15 _PA10H.Bits.BIT15
#define PA10H_BIT _PA10H.MergedBits.grpBIT

#define PA10H_BIT0_MASK   1
#define PA10H_BIT1_MASK   2
#define PA10H_BIT2_MASK   4
#define PA10H_BIT3_MASK   8
#define PA10H_BIT4_MASK   16
#define PA10H_BIT5_MASK   32
#define PA10H_BIT6_MASK   64
#define PA10H_BIT7_MASK   128
#define PA10H_BIT8_MASK   256
#define PA10H_BIT9_MASK   512
#define PA10H_BIT10_MASK   1024
#define PA10H_BIT11_MASK   2048
#define PA10H_BIT12_MASK   4096
#define PA10H_BIT13_MASK   8192
#define PA10H_BIT14_MASK   16384
#define PA10H_BIT15_MASK   32768
#define PA10H_BIT_MASK  65535
#define PA10H_BIT_BITNUM  0


/*** MCCNT - Modulus Down-Counter Count Register; 0x00000076 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** MCCNThi - Modulus Down-Counter Count Register High; 0x00000076 ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Modulus Down-Counter Bit 8 */
        byte BIT9        :1;                                       /* Modulus Down-Counter Bit 9 */
        byte BIT10       :1;                                       /* Modulus Down-Counter Bit 10 */
        byte BIT11       :1;                                       /* Modulus Down-Counter Bit 11 */
        byte BIT12       :1;                                       /* Modulus Down-Counter Bit 12 */
        byte BIT13       :1;                                       /* Modulus Down-Counter Bit 13 */
        byte BIT14       :1;                                       /* Modulus Down-Counter Bit 14 */
        byte BIT15       :1;                                       /* Modulus Down-Counter Bit 15 */
      } Bits;
      struct {
        byte grpBIT_8 :8;
      } MergedBits;
    } MCCNThiSTR;
    #define MCCNThi _MCCNT.Overlap_STR.MCCNThiSTR.Byte
    #define MCCNThi_BIT8 _MCCNT.Overlap_STR.MCCNThiSTR.Bits.BIT8
    #define MCCNThi_BIT9 _MCCNT.Overlap_STR.MCCNThiSTR.Bits.BIT9
    #define MCCNThi_BIT10 _MCCNT.Overlap_STR.MCCNThiSTR.Bits.BIT10
    #define MCCNThi_BIT11 _MCCNT.Overlap_STR.MCCNThiSTR.Bits.BIT11
    #define MCCNThi_BIT12 _MCCNT.Overlap_STR.MCCNThiSTR.Bits.BIT12
    #define MCCNThi_BIT13 _MCCNT.Overlap_STR.MCCNThiSTR.Bits.BIT13
    #define MCCNThi_BIT14 _MCCNT.Overlap_STR.MCCNThiSTR.Bits.BIT14
    #define MCCNThi_BIT15 _MCCNT.Overlap_STR.MCCNThiSTR.Bits.BIT15
    
    #define MCCNThi_BIT_8 _MCCNT.Overlap_STR.MCCNThiSTR.MergedBits.grpBIT_8
    #define MCCNThi_BIT MCCNThi_BIT_8
    
    #define MCCNThi_BIT8_MASK   1
    #define MCCNThi_BIT9_MASK   2
    #define MCCNThi_BIT10_MASK   4
    #define MCCNThi_BIT11_MASK   8
    #define MCCNThi_BIT12_MASK   16
    #define MCCNThi_BIT13_MASK   32
    #define MCCNThi_BIT14_MASK   64
    #define MCCNThi_BIT15_MASK   128
    #define MCCNThi_BIT_8_MASK  255
    #define MCCNThi_BIT_8_BITNUM  0


    /*** MCCNTlo - Modulus Down-Counter Count Register Low; 0x00000077 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Modulus Down-Counter Bit 0 */
        byte BIT1        :1;                                       /* Modulus Down-Counter Bit 1 */
        byte BIT2        :1;                                       /* Modulus Down-Counter Bit 2 */
        byte BIT3        :1;                                       /* Modulus Down-Counter Bit 3 */
        byte BIT4        :1;                                       /* Modulus Down-Counter Bit 4 */
        byte BIT5        :1;                                       /* Modulus Down-Counter Bit 5 */
        byte BIT6        :1;                                       /* Modulus Down-Counter Bit 6 */
        byte BIT7        :1;                                       /* Modulus Down-Counter Bit 7 */
      } Bits;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } MCCNTloSTR;
    #define MCCNTlo _MCCNT.Overlap_STR.MCCNTloSTR.Byte
    #define MCCNTlo_BIT0 _MCCNT.Overlap_STR.MCCNTloSTR.Bits.BIT0
    #define MCCNTlo_BIT1 _MCCNT.Overlap_STR.MCCNTloSTR.Bits.BIT1
    #define MCCNTlo_BIT2 _MCCNT.Overlap_STR.MCCNTloSTR.Bits.BIT2
    #define MCCNTlo_BIT3 _MCCNT.Overlap_STR.MCCNTloSTR.Bits.BIT3
    #define MCCNTlo_BIT4 _MCCNT.Overlap_STR.MCCNTloSTR.Bits.BIT4
    #define MCCNTlo_BIT5 _MCCNT.Overlap_STR.MCCNTloSTR.Bits.BIT5
    #define MCCNTlo_BIT6 _MCCNT.Overlap_STR.MCCNTloSTR.Bits.BIT6
    #define MCCNTlo_BIT7 _MCCNT.Overlap_STR.MCCNTloSTR.Bits.BIT7
    
    #define MCCNTlo_BIT _MCCNT.Overlap_STR.MCCNTloSTR.MergedBits.grpBIT
    
