frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
extern volatile ATD1_PORTAD0STR _ATD1_PORTAD0 @(REG_BASE + 0x0000008E);
#define ATD1_PORTAD0 _ATD1_PORTAD0.Byte
#define ATD1_PORTAD0_PTAD8 _ATD1_PORTAD0.Bits.PTAD8
#define ATD1_PORTAD0_PTAD9 _ATD1_PORTAD0.Bits.PTAD9
#define ATD1_PORTAD0_PTAD10 _ATD1_PORTAD0.Bits.PTAD10
#define ATD1_PORTAD0_PTAD11 _ATD1_PORTAD0.Bits.PTAD11
#define ATD1_PORTAD0_PTAD12 _ATD1_PORTAD0.Bits.PTAD12
#define ATD1_PORTAD0_PTAD13 _ATD1_PORTAD0.Bits.PTAD13
#define ATD1_PORTAD0_PTAD14 _ATD1_PORTAD0.Bits.PTAD14
#define ATD1_PORTAD0_PTAD15 _ATD1_PORTAD0.Bits.PTAD15
/* ATD1_PORTAD_ARR: Access 2 ATD1_PORTADx registers in a array */
#define ATD1_PORTAD_ARR ((Byte *) &ATD1_PORTAD0)
#define ATD1_PORTAD0_PTAD_8 _ATD1_PORTAD0.MergedBits.grpPTAD_8
#define ATD1_PORTAD0_PTAD ATD1_PORTAD0_PTAD_8

#define ATD1_PORTAD0_PTAD8_MASK   1
#define ATD1_PORTAD0_PTAD9_MASK   2
#define ATD1_PORTAD0_PTAD10_MASK   4
#define ATD1_PORTAD0_PTAD11_MASK   8
#define ATD1_PORTAD0_PTAD12_MASK   16
#define ATD1_PORTAD0_PTAD13_MASK   32
#define ATD1_PORTAD0_PTAD14_MASK   64
#define ATD1_PORTAD0_PTAD15_MASK   128
#define ATD1_PORTAD0_PTAD_8_MASK  255
#define ATD1_PORTAD0_PTAD_8_BITNUM  0


/*** ATD1_PORTAD1 - ATD1 Port AD1 Register; 0x0000008F ***/
typedef union {
  byte Byte;
  struct {
    byte PTAD0       :1;                                       /* A/D Channel 0 (AN0) Digital Input */
    byte PTAD1       :1;                                       /* A/D Channel 1 (AN1) Digital Input */
    byte PTAD2       :1;                                       /* A/D Channel 2 (AN2) Digital Input */
    byte PTAD3       :1;                                       /* A/D Channel 3 (AN3) Digital Input */
    byte PTAD4       :1;                                       /* A/D Channel 4 (AN4) Digital Input */
    byte PTAD5       :1;                                       /* A/D Channel 5 (AN5) Digital Input */
    byte PTAD6       :1;                                       /* A/D Channel 6 (AN6) Digital Input */
    byte PTAD7       :1;                                       /* A/D Channel 7 (AN7) Digital Input */
  } Bits;
  struct {
    byte grpPTAD :8;
  } MergedBits;
} ATD1_PORTAD1STR;
extern volatile ATD1_PORTAD1STR _ATD1_PORTAD1 @(REG_BASE + 0x0000008F);
#define ATD1_PORTAD1 _ATD1_PORTAD1.Byte
#define ATD1_PORTAD1_PTAD0 _ATD1_PORTAD1.Bits.PTAD0
#define ATD1_PORTAD1_PTAD1 _ATD1_PORTAD1.Bits.PTAD1
#define ATD1_PORTAD1_PTAD2 _ATD1_PORTAD1.Bits.PTAD2
#define ATD1_PORTAD1_PTAD3 _ATD1_PORTAD1.Bits.PTAD3
#define ATD1_PORTAD1_PTAD4 _ATD1_PORTAD1.Bits.PTAD4
#define ATD1_PORTAD1_PTAD5 _ATD1_PORTAD1.Bits.PTAD5
#define ATD1_PORTAD1_PTAD6 _ATD1_PORTAD1.Bits.PTAD6
#define ATD1_PORTAD1_PTAD7 _ATD1_PORTAD1.Bits.PTAD7
#define ATD1_PORTAD1_PTAD _ATD1_PORTAD1.MergedBits.grpPTAD

#define ATD1_PORTAD1_PTAD0_MASK   1
#define ATD1_PORTAD1_PTAD1_MASK   2
#define ATD1_PORTAD1_PTAD2_MASK   4
#define ATD1_PORTAD1_PTAD3_MASK   8
#define ATD1_PORTAD1_PTAD4_MASK   16
#define ATD1_PORTAD1_PTAD5_MASK   32
#define ATD1_PORTAD1_PTAD6_MASK   64
#define ATD1_PORTAD1_PTAD7_MASK   128
#define ATD1_PORTAD1_PTAD_MASK  255
#define ATD1_PORTAD1_PTAD_BITNUM  0


/*** ATD1DR0 - ATD 1 Conversion Result Register 0; 0x00000090 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD1DR0H - ATD 1 Conversion Result Register 0 High; 0x00000090 ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Bit 8 */
        byte BIT9        :1;                                       /* Bit 9 */
        byte BIT10       :1;                                       /* Bit 10 */
        byte BIT11       :1;                                       /* Bit 11 */
        byte BIT12       :1;                                       /* Bit 12 */
        byte BIT13       :1;                                       /* Bit 13 */
        byte BIT14       :1;                                       /* Bit 14 */
        byte BIT15       :1;                                       /* Bit 15 */
      } Bits;
      struct {
        byte grpBIT_8 :8;
      } MergedBits;
    } ATD1DR0HSTR;
    #define ATD1DR0H _ATD1DR0.Overlap_STR.ATD1DR0HSTR.Byte
    #define ATD1DR0H_BIT8 _ATD1DR0.Overlap_STR.ATD1DR0HSTR.Bits.BIT8
    #define ATD1DR0H_BIT9 _ATD1DR0.Overlap_STR.ATD1DR0HSTR.Bits.BIT9
    #define ATD1DR0H_BIT10 _ATD1DR0.Overlap_STR.ATD1DR0HSTR.Bits.BIT10
    #define ATD1DR0H_BIT11 _ATD1DR0.Overlap_STR.ATD1DR0HSTR.Bits.BIT11
    #define ATD1DR0H_BIT12 _ATD1DR0.Overlap_STR.ATD1DR0HSTR.Bits.BIT12
    #define ATD1DR0H_BIT13 _ATD1DR0.Overlap_STR.ATD1DR0HSTR.Bits.BIT13
    #define ATD1DR0H_BIT14 _ATD1DR0.Overlap_STR.ATD1DR0HSTR.Bits.BIT14
    #define ATD1DR0H_BIT15 _ATD1DR0.Overlap_STR.ATD1DR0HSTR.Bits.BIT15
    
    #define ATD1DR0H_BIT_8 _ATD1DR0.Overlap_STR.ATD1DR0HSTR.MergedBits.grpBIT_8
    #define ATD1DR0H_BIT ATD1DR0H_BIT_8
    
    #define ATD1DR0H_BIT8_MASK   1
    #define ATD1DR0H_BIT9_MASK   2
    #define ATD1DR0H_BIT10_MASK   4
    #define ATD1DR0H_BIT11_MASK   8
    #define ATD1DR0H_BIT12_MASK   16
    #define ATD1DR0H_BIT13_MASK   32
    #define ATD1DR0H_BIT14_MASK   64
    #define ATD1DR0H_BIT15_MASK   128
    #define ATD1DR0H_BIT_8_MASK  255
    #define ATD1DR0H_BIT_8_BITNUM  0


    /*** ATD1DR0L - ATD 1 Conversion Result Register 0 Low; 0x00000091 ***/
    union {
      byte Byte;
      struct {
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte BIT6        :1;                                       /* Bit 6 */
        byte BIT7        :1;                                       /* Bit 7 */
      } Bits;
      struct {
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte grpBIT_6 :2;
      } MergedBits;
    } ATD1DR0LSTR;
    #define ATD1DR0L _ATD1DR0.Overlap_STR.ATD1DR0LSTR.Byte
    #define ATD1DR0L_BIT6 _ATD1DR0.Overlap_STR.ATD1DR0LSTR.Bits.BIT6
    #define ATD1DR0L_BIT7 _ATD1DR0.Overlap_STR.ATD1DR0LSTR.Bits.BIT7
    
    #define ATD1DR0L_BIT_6 _ATD1DR0.Overlap_STR.ATD1DR0LSTR.MergedBits.grpBIT_6
    #define ATD1DR0L_BIT ATD1DR0L_BIT_6
    
