frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
    #define ATD1DR13H_BIT_8 _ATD1DR13.Overlap_STR.ATD1DR13HSTR.MergedBits.grpBIT_8
    #define ATD1DR13H_BIT ATD1DR13H_BIT_8
    
    #define ATD1DR13H_BIT8_MASK   1
    #define ATD1DR13H_BIT9_MASK   2
    #define ATD1DR13H_BIT10_MASK   4
    #define ATD1DR13H_BIT11_MASK   8
    #define ATD1DR13H_BIT12_MASK   16
    #define ATD1DR13H_BIT13_MASK   32
    #define ATD1DR13H_BIT14_MASK   64
    #define ATD1DR13H_BIT15_MASK   128
    #define ATD1DR13H_BIT_8_MASK  255
    #define ATD1DR13H_BIT_8_BITNUM  0


    /*** ATD1DR13L - ATD 1 Conversion Result Register 13 Low; 0x000000AB ***/
    union {
      byte Byte;
      struct {
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte BIT6        :1;                                       /* Bit 6 */
        byte BIT7        :1;                                       /* Bit 7 */
      } Bits;
      struct {
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte grpBIT_6 :2;
      } MergedBits;
    } ATD1DR13LSTR;
    #define ATD1DR13L _ATD1DR13.Overlap_STR.ATD1DR13LSTR.Byte
    #define ATD1DR13L_BIT6 _ATD1DR13.Overlap_STR.ATD1DR13LSTR.Bits.BIT6
    #define ATD1DR13L_BIT7 _ATD1DR13.Overlap_STR.ATD1DR13LSTR.Bits.BIT7
    
    #define ATD1DR13L_BIT_6 _ATD1DR13.Overlap_STR.ATD1DR13LSTR.MergedBits.grpBIT_6
    #define ATD1DR13L_BIT ATD1DR13L_BIT_6
    
    #define ATD1DR13L_BIT6_MASK   64
    #define ATD1DR13L_BIT7_MASK   128
    #define ATD1DR13L_BIT_6_MASK  192
    #define ATD1DR13L_BIT_6_BITNUM  6

  } Overlap_STR;

  struct {
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word BIT6        :1;                                       /* Bit 6 */
    word BIT7        :1;                                       /* Bit 7 */
    word BIT8        :1;                                       /* Bit 8 */
    word BIT9        :1;                                       /* Bit 9 */
    word BIT10       :1;                                       /* Bit 10 */
    word BIT11       :1;                                       /* Bit 11 */
    word BIT12       :1;                                       /* Bit 12 */
    word BIT13       :1;                                       /* Bit 13 */
    word BIT14       :1;                                       /* Bit 14 */
    word BIT15       :1;                                       /* Bit 15 */
  } Bits;
  struct {
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word grpBIT_6 :10;
  } MergedBits;
} ATD1DR13STR;
extern volatile ATD1DR13STR _ATD1DR13 @(REG_BASE + 0x000000AA);
#define ATD1DR13 _ATD1DR13.Word
#define ATD1DR13_BIT6 _ATD1DR13.Bits.BIT6
#define ATD1DR13_BIT7 _ATD1DR13.Bits.BIT7
#define ATD1DR13_BIT8 _ATD1DR13.Bits.BIT8
#define ATD1DR13_BIT9 _ATD1DR13.Bits.BIT9
#define ATD1DR13_BIT10 _ATD1DR13.Bits.BIT10
#define ATD1DR13_BIT11 _ATD1DR13.Bits.BIT11
#define ATD1DR13_BIT12 _ATD1DR13.Bits.BIT12
#define ATD1DR13_BIT13 _ATD1DR13.Bits.BIT13
#define ATD1DR13_BIT14 _ATD1DR13.Bits.BIT14
#define ATD1DR13_BIT15 _ATD1DR13.Bits.BIT15
#define ATD1DR13_BIT_6 _ATD1DR13.MergedBits.grpBIT_6
#define ATD1DR13_BIT ATD1DR13_BIT_6

#define ATD1DR13_BIT6_MASK   64
#define ATD1DR13_BIT7_MASK   128
#define ATD1DR13_BIT8_MASK   256
#define ATD1DR13_BIT9_MASK   512
#define ATD1DR13_BIT10_MASK   1024
#define ATD1DR13_BIT11_MASK   2048
#define ATD1DR13_BIT12_MASK   4096
#define ATD1DR13_BIT13_MASK   8192
#define ATD1DR13_BIT14_MASK   16384
#define ATD1DR13_BIT15_MASK   32768
#define ATD1DR13_BIT_6_MASK  65472
#define ATD1DR13_BIT_6_BITNUM  6


/*** ATD1DR14 - ATD 1 Conversion Result Register 14; 0x000000AC ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD1DR14H - ATD 1 Conversion Result Register 14 High; 0x000000AC ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Bit 8 */
        byte BIT9        :1;                                       /* Bit 9 */
        byte BIT10       :1;                                       /* Bit 10 */
        byte BIT11       :1;                                       /* Bit 11 */
        byte BIT12       :1;                                       /* Bit 12 */
        byte BIT13       :1;                                       /* Bit 13 */
        byte BIT14       :1;                                       /* Bit 14 */
        byte BIT15       :1;                                       /* Bit 15 */
      } Bits;
      struct {
        byte grpBIT_8 :8;
      } MergedBits;
    } ATD1DR14HSTR;
    #define ATD1DR14H _ATD1DR14.Overlap_STR.ATD1DR14HSTR.Byte
    #define ATD1DR14H_BIT8 _ATD1DR14.Overlap_STR.ATD1DR14HSTR.Bits.BIT8
    #define ATD1DR14H_BIT9 _ATD1DR14.Overlap_STR.ATD1DR14HSTR.Bits.BIT9
    #define ATD1DR14H_BIT10 _ATD1DR14.Overlap_STR.ATD1DR14HSTR.Bits.BIT10
    #define ATD1DR14H_BIT11 _ATD1DR14.Overlap_STR.ATD1DR14HSTR.Bits.BIT11
    #define ATD1DR14H_BIT12 _ATD1DR14.Overlap_STR.ATD1DR14HSTR.Bits.BIT12
    #define ATD1DR14H_BIT13 _ATD1DR14.Overlap_STR.ATD1DR14HSTR.Bits.BIT13
    #define ATD1DR14H_BIT14 _ATD1DR14.Overlap_STR.ATD1DR14HSTR.Bits.BIT14
    #define ATD1DR14H_BIT15 _ATD1DR14.Overlap_STR.ATD1DR14HSTR.Bits.BIT15
    
    #define ATD1DR14H_BIT_8 _ATD1DR14.Overlap_STR.ATD1DR14HSTR.MergedBits.grpBIT_8
    #define ATD1DR14H_BIT ATD1DR14H_BIT_8
    
    #define ATD1DR14H_BIT8_MASK   1
    #define ATD1DR14H_BIT9_MASK   2
    #define ATD1DR14H_BIT10_MASK   4
    #define ATD1DR14H_BIT11_MASK   8
    #define ATD1DR14H_BIT12_MASK   16
    #define ATD1DR14H_BIT13_MASK   32
    #define ATD1DR14H_BIT14_MASK   64
    #define ATD1DR14H_BIT15_MASK   128
    #define ATD1DR14H_BIT_8_MASK  255
    #define ATD1DR14H_BIT_8_BITNUM  0


    /*** ATD1DR14L - ATD 1 Conversion Result Register 14 Low; 0x000000AD ***/
    union {
      byte Byte;
      struct {
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte BIT6        :1;                                       /* Bit 6 */
        byte BIT7        :1;                                       /* Bit 7 */
      } Bits;
      struct {
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte grpBIT_6 :2;
      } MergedBits;
    } ATD1DR14LSTR;
    #define ATD1DR14L _ATD1DR14.Overlap_STR.ATD1DR14LSTR.Byte
    #define ATD1DR14L_BIT6 _ATD1DR14.Overlap_STR.ATD1DR14LSTR.Bits.BIT6
    #define ATD1DR14L_BIT7 _ATD1DR14.Overlap_STR.ATD1DR14LSTR.Bits.BIT7
    
