frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
  } SameAddr_STR; /*Several registers at the same address */

} SCI3ASR1STR;
extern volatile SCI3ASR1STR _SCI3ASR1 @(REG_BASE + 0x000000C0);



/*** SCI3BD - SCI 3 Baud Rate Register; 0x000000C1 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** SCI3ACR1 - SCI 3 Alternative Control Register 1; 0x000000C1 ***/
    union {
      byte Byte;
      union { /*Several registers at the same address */
        /*** SCI3ACR1 - SCI 3 Alternative Control Register 1; Several registers at the same address ***/
        union {
          struct {
            byte BKDIE       :1;                                       /* Break Detect Interrupt Enable */
            byte BERRIE      :1;                                       /* Bit Error Interrupt Enable */
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte RXEDGIE     :1;                                       /* Receive Input Active Edge Interrupt Enable */
          } Bits;
        } SCI3ACR1STR;
        #define SCI3ACR1 _SCI3BD.Overlap_STR.SCI3ACR1STR.Byte
        #define SCI3ACR1_BKDIE _SCI3BD.Overlap_STR.SCI3ACR1STR.SameAddr_STR.SCI3ACR1STR.Bits.BKDIE
        #define SCI3ACR1_BERRIE _SCI3BD.Overlap_STR.SCI3ACR1STR.SameAddr_STR.SCI3ACR1STR.Bits.BERRIE
        #define SCI3ACR1_RXEDGIE _SCI3BD.Overlap_STR.SCI3ACR1STR.SameAddr_STR.SCI3ACR1STR.Bits.RXEDGIE
        
        
        #define SCI3ACR1_BKDIE_MASK   1
        #define SCI3ACR1_BERRIE_MASK   2
        #define SCI3ACR1_RXEDGIE_MASK   128
    
        /*** SCI3BDL - SCI 3 Baud Rate Register Low; Several registers at the same address ***/
        union {
          struct {
            byte SBR0        :1;                                       /* SCI Baud Rate Bit 0 */
            byte SBR1        :1;                                       /* SCI Baud Rate Bit 1 */
            byte SBR2        :1;                                       /* SCI Baud Rate Bit 2 */
            byte SBR3        :1;                                       /* SCI Baud Rate Bit 3 */
            byte SBR4        :1;                                       /* SCI Baud Rate Bit 4 */
            byte SBR5        :1;                                       /* SCI Baud Rate Bit 5 */
            byte SBR6        :1;                                       /* SCI Baud Rate Bit 6 */
            byte SBR7        :1;                                       /* SCI Baud Rate Bit 7 */
          } Bits;
          struct {
            byte grpSBR :8;
          } MergedBits;
        } SCI3BDLSTR;
        #define SCI3BDL _SCI3BD.Overlap_STR.SCI3ACR1STR.Byte
        #define SCI3BDL_SBR0 _SCI3BD.Overlap_STR.SCI3ACR1STR.SameAddr_STR.SCI3BDLSTR.Bits.SBR0
        #define SCI3BDL_SBR1 _SCI3BD.Overlap_STR.SCI3ACR1STR.SameAddr_STR.SCI3BDLSTR.Bits.SBR1
        #define SCI3BDL_SBR2 _SCI3BD.Overlap_STR.SCI3ACR1STR.SameAddr_STR.SCI3BDLSTR.Bits.SBR2
        #define SCI3BDL_SBR3 _SCI3BD.Overlap_STR.SCI3ACR1STR.SameAddr_STR.SCI3BDLSTR.Bits.SBR3
        #define SCI3BDL_SBR4 _SCI3BD.Overlap_STR.SCI3ACR1STR.SameAddr_STR.SCI3BDLSTR.Bits.SBR4
        #define SCI3BDL_SBR5 _SCI3BD.Overlap_STR.SCI3ACR1STR.SameAddr_STR.SCI3BDLSTR.Bits.SBR5
        #define SCI3BDL_SBR6 _SCI3BD.Overlap_STR.SCI3ACR1STR.SameAddr_STR.SCI3BDLSTR.Bits.SBR6
        #define SCI3BDL_SBR7 _SCI3BD.Overlap_STR.SCI3ACR1STR.SameAddr_STR.SCI3BDLSTR.Bits.SBR7
        
        #define SCI3BDL_SBR _SCI3BD.Overlap_STR.SCI3ACR1STR.SameAddr_STR.SCI3BDLSTR.MergedBits.grpSBR
        
        #define SCI3BDL_SBR0_MASK   1
        #define SCI3BDL_SBR1_MASK   2
        #define SCI3BDL_SBR2_MASK   4
        #define SCI3BDL_SBR3_MASK   8
        #define SCI3BDL_SBR4_MASK   16
        #define SCI3BDL_SBR5_MASK   32
        #define SCI3BDL_SBR6_MASK   64
        #define SCI3BDL_SBR7_MASK   128
        #define SCI3BDL_SBR_MASK  255
        #define SCI3BDL_SBR_BITNUM  0
    
      } SameAddr_STR; /*Several registers at the same address */
    
    } SCI3ACR1STR;
    


    /*** SCI3ACR2 - SCI 3 Alternative Control Register 2; 0x000000C2 ***/
    union {
      byte Byte;
      union { /*Several registers at the same address */
        /*** SCI3ACR2 - SCI 3 Alternative Control Register 2; Several registers at the same address ***/
        union {
          struct {
            byte BKDFE       :1;                                       /* Break Detect Feature Enable */
            byte BERRM0      :1;                                       /* Bit Error Mode Bit 0 */
            byte BERRM1      :1;                                       /* Bit Error Mode Bit 1 */
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
          } Bits;
          struct {
            byte :1;
            byte grpBERRM :2;
            byte :1;
            byte :1;
            byte :1;
            byte :1;
            byte :1;
          } MergedBits;
        } SCI3ACR2STR;
        #define SCI3ACR2 _SCI3BD.Overlap_STR.SCI3ACR2STR.Byte
        #define SCI3ACR2_BKDFE _SCI3BD.Overlap_STR.SCI3ACR2STR.SameAddr_STR.SCI3ACR2STR.Bits.BKDFE
        #define SCI3ACR2_BERRM0 _SCI3BD.Overlap_STR.SCI3ACR2STR.SameAddr_STR.SCI3ACR2STR.Bits.BERRM0
        #define SCI3ACR2_BERRM1 _SCI3BD.Overlap_STR.SCI3ACR2STR.SameAddr_STR.SCI3ACR2STR.Bits.BERRM1
        
        #define SCI3ACR2_BERRM _SCI3BD.Overlap_STR.SCI3ACR2STR.SameAddr_STR.SCI3ACR2STR.MergedBits.grpBERRM
        
        #define SCI3ACR2_BKDFE_MASK   1
        #define SCI3ACR2_BERRM0_MASK   2
        #define SCI3ACR2_BERRM1_MASK   4
        #define SCI3ACR2_BERRM_MASK  6
        #define SCI3ACR2_BERRM_BITNUM  1
    
        /*** SCI3CR1 - SCI 3 Control Register 1; Several registers at the same address ***/
        union {
          struct {
            byte PT          :1;                                       /* Parity Type Bit */
            byte PE          :1;                                       /* Parity Enable Bit */
            byte ILT         :1;                                       /* Idle Line Type Bit */
            byte WAKE        :1;                                       /* Wakeup Condition Bit */
            byte M           :1;                                       /* Data Format Mode Bit */
            byte RSRC        :1;                                       /* Receiver Source Bit */
            byte SCISWAI     :1;                                       /* SCI Stop in Wait Mode Bit */
            byte LOOPS       :1;                                       /* Loop Select Bit */
          } Bits;
        } SCI3CR1STR;
        #define SCI3CR1 _SCI3BD.Overlap_STR.SCI3ACR2STR.Byte
        #define SCI3CR1_PT _SCI3BD.Overlap_STR.SCI3ACR2STR.SameAddr_STR.SCI3CR1STR.Bits.PT
        #define SCI3CR1_PE _SCI3BD.Overlap_STR.SCI3ACR2STR.SameAddr_STR.SCI3CR1STR.Bits.PE
        #define SCI3CR1_ILT _SCI3BD.Overlap_STR.SCI3ACR2STR.SameAddr_STR.SCI3CR1STR.Bits.ILT
        #define SCI3CR1_WAKE _SCI3BD.Overlap_STR.SCI3ACR2STR.SameAddr_STR.SCI3CR1STR.Bits.WAKE
        #define SCI3CR1_M _SCI3BD.Overlap_STR.SCI3ACR2STR.SameAddr_STR.SCI3CR1STR.Bits.M
        #define SCI3CR1_RSRC _SCI3BD.Overlap_STR.SCI3ACR2STR.SameAddr_STR.SCI3CR1STR.Bits.RSRC
        #define SCI3CR1_SCISWAI _SCI3BD.Overlap_STR.SCI3ACR2STR.SameAddr_STR.SCI3CR1STR.Bits.SCISWAI
        #define SCI3CR1_LOOPS _SCI3BD.Overlap_STR.SCI3ACR2STR.SameAddr_STR.SCI3CR1STR.Bits.LOOPS
        
        
        #define SCI3CR1_PT_MASK   1
        #define SCI3CR1_PE_MASK   2
        #define SCI3CR1_ILT_MASK   4
        #define SCI3CR1_WAKE_MASK   8
        #define SCI3CR1_M_MASK   16
        #define SCI3CR1_RSRC_MASK   32
        #define SCI3CR1_SCISWAI_MASK   64
        #define SCI3CR1_LOOPS_MASK   128
    
