frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
extern volatile ECNFGSTR _ECNFG @(REG_BASE + 0x00000113);
#define ECNFG _ECNFG.Byte
#define ECNFG_CCIE _ECNFG.Bits.CCIE
#define ECNFG_CBEIE _ECNFG.Bits.CBEIE

#define ECNFG_CCIE_MASK   64
#define ECNFG_CBEIE_MASK   128


/*** EPROT - EEPROM Protection Register; 0x00000114 ***/
typedef union {
  byte Byte;
  struct {
    byte EPS0        :1;                                       /* EEPROM Protection address size 0 */
    byte EPS1        :1;                                       /* EEPROM Protection address size 1 */
    byte EPS2        :1;                                       /* EEPROM Protection address size 2 */
    byte EPDIS       :1;                                       /* EEPROM Protection disable */
    byte RNV4        :1;                                       /* EEPROM Protection address size 4 */
    byte RNV5        :1;                                       /* EEPROM Protection address size 5 */
    byte RNV6        :1;                                       /* EEPROM Protection address size 6 */
    byte EPOPEN      :1;                                       /* Opens the EEPROM block or a subsection of it for program or erase */
  } Bits;
  struct {
    byte grpEPS  :3;
    byte         :1;
    byte grpRNV_4 :3;
    byte         :1;
  } MergedBits;
} EPROTSTR;
extern volatile EPROTSTR _EPROT @(REG_BASE + 0x00000114);
#define EPROT _EPROT.Byte
#define EPROT_EPS0 _EPROT.Bits.EPS0
#define EPROT_EPS1 _EPROT.Bits.EPS1
#define EPROT_EPS2 _EPROT.Bits.EPS2
#define EPROT_EPDIS _EPROT.Bits.EPDIS
#define EPROT_RNV4 _EPROT.Bits.RNV4
#define EPROT_RNV5 _EPROT.Bits.RNV5
#define EPROT_RNV6 _EPROT.Bits.RNV6
#define EPROT_EPOPEN _EPROT.Bits.EPOPEN
#define EPROT_EPS _EPROT.MergedBits.grpEPS
#define EPROT_RNV_4 _EPROT.MergedBits.grpRNV_4
#define EPROT_RNV EPROT_RNV_4

#define EPROT_EPS0_MASK   1
#define EPROT_EPS1_MASK   2
#define EPROT_EPS2_MASK   4
#define EPROT_EPDIS_MASK   8
#define EPROT_RNV4_MASK   16
#define EPROT_RNV5_MASK   32
#define EPROT_RNV6_MASK   64
#define EPROT_EPOPEN_MASK   128
#define EPROT_EPS_MASK  7
#define EPROT_EPS_BITNUM  0
#define EPROT_RNV_4_MASK  112
#define EPROT_RNV_4_BITNUM  4


/*** ESTAT - EEPROM Status Register; 0x00000115 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte BLANK       :1;                                       /* Blank Verify Flag */
    byte             :1; 
    byte ACCERR      :1;                                       /* Access error */
    byte PVIOL       :1;                                       /* Protection violation */
    byte CCIF        :1;                                       /* Command Complete Interrupt Flag */
    byte CBEIF       :1;                                       /* Command Buffer Empty Interrupt Flag */
  } Bits;
} ESTATSTR;
extern volatile ESTATSTR _ESTAT @(REG_BASE + 0x00000115);
#define ESTAT _ESTAT.Byte
#define ESTAT_BLANK _ESTAT.Bits.BLANK
#define ESTAT_ACCERR _ESTAT.Bits.ACCERR
#define ESTAT_PVIOL _ESTAT.Bits.PVIOL
#define ESTAT_CCIF _ESTAT.Bits.CCIF
#define ESTAT_CBEIF _ESTAT.Bits.CBEIF

#define ESTAT_BLANK_MASK   4
#define ESTAT_ACCERR_MASK   16
#define ESTAT_PVIOL_MASK   32
#define ESTAT_CCIF_MASK   64
#define ESTAT_CBEIF_MASK   128


/*** ECMD - EEPROM Command Buffer and Register; 0x00000116 ***/
typedef union {
  byte Byte;
  struct {
    byte CMDB        :7;                                       /* EEPROM command */
    byte             :1; 
  } Bits;
} ECMDSTR;
extern volatile ECMDSTR _ECMD @(REG_BASE + 0x00000116);
#define ECMD _ECMD.Byte
#define ECMD_CMDB _ECMD.Bits.CMDB

#define ECMD_CMDB_MASK   127
#define ECMD_CMDB_BITNUM 0


/*** EADDRHI - EEPROM Address High Register; 0x00000118 ***/
typedef union {
  byte Byte;
  struct {
    byte EADDRHI     :8;                                       /* EEPROM Address High Bits */
  } Bits;
} EADDRHISTR;
extern volatile EADDRHISTR _EADDRHI @(REG_BASE + 0x00000118);
#define EADDRHI _EADDRHI.Byte
#define EADDRHI_EADDRHI _EADDRHI.Bits.EADDRHI

#define EADDRHI_EADDRHI_MASK   255
#define EADDRHI_EADDRHI_BITNUM 0


/*** EADDRLO - EEPROM Address Low Register; 0x00000119 ***/
typedef union {
  byte Byte;
  struct {
    byte EADDRLO     :8;                                       /* EEPROM Address Low Bits */
  } Bits;
} EADDRLOSTR;
extern volatile EADDRLOSTR _EADDRLO @(REG_BASE + 0x00000119);
#define EADDRLO _EADDRLO.Byte
#define EADDRLO_EADDRLO _EADDRLO.Bits.EADDRLO

#define EADDRLO_EADDRLO_MASK   255
#define EADDRLO_EADDRLO_BITNUM 0


/*** EDATAHI - EEPROM Data High Register; 0x0000011A ***/
typedef union {
  byte Byte;
  struct {
    byte EDATAHI     :8;                                       /* EEPROM Data High Bits */
  } Bits;
} EDATAHISTR;
extern volatile EDATAHISTR _EDATAHI @(REG_BASE + 0x0000011A);
#define EDATAHI _EDATAHI.Byte
#define EDATAHI_EDATAHI _EDATAHI.Bits.EDATAHI

#define EDATAHI_EDATAHI_MASK   255
#define EDATAHI_EDATAHI_BITNUM 0


/*** EDATALO - EEPROM Data Low Register; 0x0000011B ***/
typedef union {
  byte Byte;
  struct {
    byte EDATALO     :8;                                       /* EEPROM Data Low Bits */
  } Bits;
} EDATALOSTR;
extern volatile EDATALOSTR _EDATALO @(REG_BASE + 0x0000011B);
#define EDATALO _EDATALO.Byte
#define EDATALO_EDATALO _EDATALO.Bits.EDATALO

#define EDATALO_EDATALO_MASK   255
#define EDATALO_EDATALO_BITNUM 0


/*** XSCTRL - XSRAM Control Register; 0x0000011C ***/
typedef union {
  byte Byte;
  struct {
    byte XSCAVIF     :1;                                       /* XSRAM CPU Access Violation Interrupt Flag */
    byte XSXAVIF     :1;                                       /* XSRAM XGATE Access Violation Interrupt Flag */
    byte XSAVIE      :1;                                       /* XSRAM Access Violation Interrupt Enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte XSRE        :1;                                       /* XSRAM Region Check Enable Bit */
  } Bits;
} XSCTRLSTR;
extern volatile XSCTRLSTR _XSCTRL @(REG_BASE + 0x0000011C);
#define XSCTRL _XSCTRL.Byte
#define XSCTRL_XSCAVIF _XSCTRL.Bits.XSCAVIF
#define XSCTRL_XSXAVIF _XSCTRL.Bits.XSXAVIF
#define XSCTRL_XSAVIE _XSCTRL.Bits.XSAVIE
#define XSCTRL_XSRE _XSCTRL.Bits.XSRE

