frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
#define XSCTRL_XSCAVIF_MASK   1
#define XSCTRL_XSXAVIF_MASK   2
#define XSCTRL_XSAVIE_MASK   4
#define XSCTRL_XSRE_MASK   128


/*** XSXCUB - XSRAM XGATE Code Region Upper Boundary Register; 0x0000011D ***/
typedef union {
  byte Byte;
  struct {
    byte XSXCU0      :1;                                       /* XSRAM XGATE Code Region Upper Boundary Bit 0 */
    byte XSXCU1      :1;                                       /* XSRAM XGATE Code Region Upper Boundary Bit 1 */
    byte XSXCU2      :1;                                       /* XSRAM XGATE Code Region Upper Boundary Bit 2 */
    byte XSXCU3      :1;                                       /* XSRAM XGATE Code Region Upper Boundary Bit 3 */
    byte XSXCU4      :1;                                       /* XSRAM XGATE Code Region Upper Boundary Bit 4 */
    byte XSXCU5      :1;                                       /* XSRAM XGATE Code Region Upper Boundary Bit 5 */
    byte XSXCU6      :1;                                       /* XSRAM XGATE Code Region Upper Boundary Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpXSXCU :7;
    byte         :1;
  } MergedBits;
} XSXCUBSTR;
extern volatile XSXCUBSTR _XSXCUB @(REG_BASE + 0x0000011D);
#define XSXCUB _XSXCUB.Byte
#define XSXCUB_XSXCU0 _XSXCUB.Bits.XSXCU0
#define XSXCUB_XSXCU1 _XSXCUB.Bits.XSXCU1
#define XSXCUB_XSXCU2 _XSXCUB.Bits.XSXCU2
#define XSXCUB_XSXCU3 _XSXCUB.Bits.XSXCU3
#define XSXCUB_XSXCU4 _XSXCUB.Bits.XSXCU4
#define XSXCUB_XSXCU5 _XSXCUB.Bits.XSXCU5
#define XSXCUB_XSXCU6 _XSXCUB.Bits.XSXCU6
#define XSXCUB_XSXCU _XSXCUB.MergedBits.grpXSXCU

#define XSXCUB_XSXCU0_MASK   1
#define XSXCUB_XSXCU1_MASK   2
#define XSXCUB_XSXCU2_MASK   4
#define XSXCUB_XSXCU3_MASK   8
#define XSXCUB_XSXCU4_MASK   16
#define XSXCUB_XSXCU5_MASK   32
#define XSXCUB_XSXCU6_MASK   64
#define XSXCUB_XSXCU_MASK  127
#define XSXCUB_XSXCU_BITNUM  0


/*** XSSRLB - XSRAM XGATE Code Region Lower Boundary Register; 0x0000011E ***/
typedef union {
  byte Byte;
  struct {
    byte XSSL0       :1;                                       /* XSRAM Shared Region Lower Boundary Bit 0 */
    byte XSSL1       :1;                                       /* XSRAM Shared Region Lower Boundary Bit 1 */
    byte XSSL2       :1;                                       /* XSRAM Shared Region Lower Boundary Bit 2 */
    byte XSSL3       :1;                                       /* XSRAM Shared Region Lower Boundary Bit 3 */
    byte XSSL4       :1;                                       /* XSRAM Shared Region Lower Boundary Bit 4 */
    byte XSSL5       :1;                                       /* XSRAM Shared Region Lower Boundary Bit 5 */
    byte XSSL6       :1;                                       /* XSRAM Shared Region Lower Boundary Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpXSSL :7;
    byte         :1;
  } MergedBits;
} XSSRLBSTR;
extern volatile XSSRLBSTR _XSSRLB @(REG_BASE + 0x0000011E);
#define XSSRLB _XSSRLB.Byte
#define XSSRLB_XSSL0 _XSSRLB.Bits.XSSL0
#define XSSRLB_XSSL1 _XSSRLB.Bits.XSSL1
#define XSSRLB_XSSL2 _XSSRLB.Bits.XSSL2
#define XSSRLB_XSSL3 _XSSRLB.Bits.XSSL3
#define XSSRLB_XSSL4 _XSSRLB.Bits.XSSL4
#define XSSRLB_XSSL5 _XSSRLB.Bits.XSSL5
#define XSSRLB_XSSL6 _XSSRLB.Bits.XSSL6
#define XSSRLB_XSSL _XSSRLB.MergedBits.grpXSSL

#define XSSRLB_XSSL0_MASK   1
#define XSSRLB_XSSL1_MASK   2
#define XSSRLB_XSSL2_MASK   4
#define XSSRLB_XSSL3_MASK   8
#define XSSRLB_XSSL4_MASK   16
#define XSSRLB_XSSL5_MASK   32
#define XSSRLB_XSSL6_MASK   64
#define XSSRLB_XSSL_MASK  127
#define XSSRLB_XSSL_BITNUM  0


/*** XSSRUB - XSRAM Shared Region Upper Boundary Register; 0x0000011F ***/
typedef union {
  byte Byte;
  struct {
    byte XSSU0       :1;                                       /* XSRAM Shared Region Upper Boundary Bits 0 */
    byte XSSU1       :1;                                       /* XSRAM Shared Region Upper Boundary Bits 1 */
    byte XSSU2       :1;                                       /* XSRAM Shared Region Upper Boundary Bits 2 */
    byte XSSU3       :1;                                       /* XSRAM Shared Region Upper Boundary Bits 3 */
    byte XSSU4       :1;                                       /* XSRAM Shared Region Upper Boundary Bits 4 */
    byte XSSU5       :1;                                       /* XSRAM Shared Region Upper Boundary Bits 5 */
    byte XSSU6       :1;                                       /* XSRAM Shared Region Upper Boundary Bits 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpXSSU :7;
    byte         :1;
  } MergedBits;
} XSSRUBSTR;
extern volatile XSSRUBSTR _XSSRUB @(REG_BASE + 0x0000011F);
#define XSSRUB _XSSRUB.Byte
#define XSSRUB_XSSU0 _XSSRUB.Bits.XSSU0
#define XSSRUB_XSSU1 _XSSRUB.Bits.XSSU1
#define XSSRUB_XSSU2 _XSSRUB.Bits.XSSU2
#define XSSRUB_XSSU3 _XSSRUB.Bits.XSSU3
#define XSSRUB_XSSU4 _XSSRUB.Bits.XSSU4
#define XSSRUB_XSSU5 _XSSRUB.Bits.XSSU5
#define XSSRUB_XSSU6 _XSSRUB.Bits.XSSU6
#define XSSRUB_XSSU _XSSRUB.MergedBits.grpXSSU

#define XSSRUB_XSSU0_MASK   1
#define XSSRUB_XSSU1_MASK   2
#define XSSRUB_XSSU2_MASK   4
#define XSSRUB_XSSU3_MASK   8
#define XSSRUB_XSSU4_MASK   16
#define XSSRUB_XSSU5_MASK   32
#define XSSRUB_XSSU6_MASK   64
#define XSSRUB_XSSU_MASK  127
#define XSSRUB_XSSU_BITNUM  0


/*** IVBR - Interrupt Vector Base Register; 0x00000121 ***/
typedef union {
  byte Byte;
  struct {
    byte IVB_ADDR    :8;                                       /* Interrupt vector base address bits */
  } Bits;
} IVBRSTR;
extern volatile IVBRSTR _IVBR @(REG_BASE + 0x00000121);
#define IVBR _IVBR.Byte
#define IVBR_IVB_ADDR _IVBR.Bits.IVB_ADDR

#define IVBR_IVB_ADDR_MASK   255
#define IVBR_IVB_ADDR_BITNUM 0


/*** INT_XGPRIO - XGATE Interrupt Priority Configuration Register; 0x00000126 ***/
typedef union {
  byte Byte;
  struct {
    byte XILVL       :3;                                       /* XGATE Interrupt Priority Level */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} INT_XGPRIOSTR;
extern volatile INT_XGPRIOSTR _INT_XGPRIO @(REG_BASE + 0x00000126);
#define INT_XGPRIO _INT_XGPRIO.Byte
#define INT_XGPRIO_XILVL _INT_XGPRIO.Bits.XILVL

#define INT_XGPRIO_XILVL_MASK   7
#define INT_XGPRIO_XILVL_BITNUM 0


/*** INT_CFADDR - Interrupt Configuration Address Register; 0x00000127 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte INT_CFADDR  :4;                                       /* Interrupt Request Configuration Data Register select bits */
  } Bits;
} INT_CFADDRSTR;
extern volatile INT_CFADDRSTR _INT_CFADDR @(REG_BASE + 0x00000127);
#define INT_CFADDR _INT_CFADDR.Byte
#define INT_CFADDR_INT_CFADDR _INT_CFADDR.Bits.INT_CFADDR

#define INT_CFADDR_INT_CFADDR_MASK   240
#define INT_CFADDR_INT_CFADDR_BITNUM 4


