frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
/*** INT_CFDATA0 - Interrupt Configuration Data Register 0; 0x00000128 ***/
typedef union {
  byte Byte;
  struct {
    byte PRIOLVL     :3;                                       /* Interrupt Request Priority Level Bits */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte RQST        :1;                                       /* XGATE Request Enable */
  } Bits;
} INT_CFDATA0STR;
extern volatile INT_CFDATA0STR _INT_CFDATA0 @(REG_BASE + 0x00000128);
#define INT_CFDATA0 _INT_CFDATA0.Byte
#define INT_CFDATA0_PRIOLVL _INT_CFDATA0.Bits.PRIOLVL
#define INT_CFDATA0_RQST _INT_CFDATA0.Bits.RQST
/* INT_CFDATA_ARR: Access 8 INT_CFDATAx registers in a array */
#define INT_CFDATA_ARR ((Byte *) &INT_CFDATA0)

#define INT_CFDATA0_PRIOLVL_MASK   7
#define INT_CFDATA0_PRIOLVL_BITNUM 0
#define INT_CFDATA0_RQST_MASK   128


/*** INT_CFDATA1 - Interrupt Configuration Data Register 1; 0x00000129 ***/
typedef union {
  byte Byte;
  struct {
    byte PRIOLVL     :3;                                       /* Interrupt Request Priority Level Bits */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte RQST        :1;                                       /* XGATE Request Enable */
  } Bits;
} INT_CFDATA1STR;
extern volatile INT_CFDATA1STR _INT_CFDATA1 @(REG_BASE + 0x00000129);
#define INT_CFDATA1 _INT_CFDATA1.Byte
#define INT_CFDATA1_PRIOLVL _INT_CFDATA1.Bits.PRIOLVL
#define INT_CFDATA1_RQST _INT_CFDATA1.Bits.RQST

#define INT_CFDATA1_PRIOLVL_MASK   7
#define INT_CFDATA1_PRIOLVL_BITNUM 0
#define INT_CFDATA1_RQST_MASK   128


/*** INT_CFDATA2 - Interrupt Configuration Data Register 2; 0x0000012A ***/
typedef union {
  byte Byte;
  struct {
    byte PRIOLVL     :3;                                       /* Interrupt Request Priority Level Bits */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte RQST        :1;                                       /* XGATE Request Enable */
  } Bits;
} INT_CFDATA2STR;
extern volatile INT_CFDATA2STR _INT_CFDATA2 @(REG_BASE + 0x0000012A);
#define INT_CFDATA2 _INT_CFDATA2.Byte
#define INT_CFDATA2_PRIOLVL _INT_CFDATA2.Bits.PRIOLVL
#define INT_CFDATA2_RQST _INT_CFDATA2.Bits.RQST

#define INT_CFDATA2_PRIOLVL_MASK   7
#define INT_CFDATA2_PRIOLVL_BITNUM 0
#define INT_CFDATA2_RQST_MASK   128


/*** INT_CFDATA3 - Interrupt Configuration Data Register 3; 0x0000012B ***/
typedef union {
  byte Byte;
  struct {
    byte PRIOLVL     :3;                                       /* Interrupt Request Priority Level Bits */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte RQST        :1;                                       /* XGATE Request Enable */
  } Bits;
} INT_CFDATA3STR;
extern volatile INT_CFDATA3STR _INT_CFDATA3 @(REG_BASE + 0x0000012B);
#define INT_CFDATA3 _INT_CFDATA3.Byte
#define INT_CFDATA3_PRIOLVL _INT_CFDATA3.Bits.PRIOLVL
#define INT_CFDATA3_RQST _INT_CFDATA3.Bits.RQST

#define INT_CFDATA3_PRIOLVL_MASK   7
#define INT_CFDATA3_PRIOLVL_BITNUM 0
#define INT_CFDATA3_RQST_MASK   128


/*** INT_CFDATA4 - Interrupt Configuration Data Register 4; 0x0000012C ***/
typedef union {
  byte Byte;
  struct {
    byte PRIOLVL     :3;                                       /* Interrupt Request Priority Level Bits */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte RQST        :1;                                       /* XGATE Request Enable */
  } Bits;
} INT_CFDATA4STR;
extern volatile INT_CFDATA4STR _INT_CFDATA4 @(REG_BASE + 0x0000012C);
#define INT_CFDATA4 _INT_CFDATA4.Byte
#define INT_CFDATA4_PRIOLVL _INT_CFDATA4.Bits.PRIOLVL
#define INT_CFDATA4_RQST _INT_CFDATA4.Bits.RQST

#define INT_CFDATA4_PRIOLVL_MASK   7
#define INT_CFDATA4_PRIOLVL_BITNUM 0
#define INT_CFDATA4_RQST_MASK   128


/*** INT_CFDATA5 - Interrupt Configuration Data Register 5; 0x0000012D ***/
typedef union {
  byte Byte;
  struct {
    byte PRIOLVL     :3;                                       /* Interrupt Request Priority Level Bits */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte RQST        :1;                                       /* XGATE Request Enable */
  } Bits;
} INT_CFDATA5STR;
extern volatile INT_CFDATA5STR _INT_CFDATA5 @(REG_BASE + 0x0000012D);
#define INT_CFDATA5 _INT_CFDATA5.Byte
#define INT_CFDATA5_PRIOLVL _INT_CFDATA5.Bits.PRIOLVL
#define INT_CFDATA5_RQST _INT_CFDATA5.Bits.RQST

#define INT_CFDATA5_PRIOLVL_MASK   7
#define INT_CFDATA5_PRIOLVL_BITNUM 0
#define INT_CFDATA5_RQST_MASK   128


/*** INT_CFDATA6 - Interrupt Configuration Data Register 6; 0x0000012E ***/
typedef union {
  byte Byte;
  struct {
    byte PRIOLVL     :3;                                       /* Interrupt Request Priority Level Bits */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte RQST        :1;                                       /* XGATE Request Enable */
  } Bits;
} INT_CFDATA6STR;
extern volatile INT_CFDATA6STR _INT_CFDATA6 @(REG_BASE + 0x0000012E);
#define INT_CFDATA6 _INT_CFDATA6.Byte
#define INT_CFDATA6_PRIOLVL _INT_CFDATA6.Bits.PRIOLVL
#define INT_CFDATA6_RQST _INT_CFDATA6.Bits.RQST

#define INT_CFDATA6_PRIOLVL_MASK   7
#define INT_CFDATA6_PRIOLVL_BITNUM 0
#define INT_CFDATA6_RQST_MASK   128


/*** INT_CFDATA7 - Interrupt Configuration Data Register 7; 0x0000012F ***/
typedef union {
  byte Byte;
  struct {
    byte PRIOLVL     :3;                                       /* Interrupt Request Priority Level Bits */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte RQST        :1;                                       /* XGATE Request Enable */
  } Bits;
} INT_CFDATA7STR;
extern volatile INT_CFDATA7STR _INT_CFDATA7 @(REG_BASE + 0x0000012F);
#define INT_CFDATA7 _INT_CFDATA7.Byte
#define INT_CFDATA7_PRIOLVL _INT_CFDATA7.Bits.PRIOLVL
#define INT_CFDATA7_RQST _INT_CFDATA7.Bits.RQST

