frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
      } SameAddr_STR; /*Several registers at the same address */
    
    } SCI4ACR1STR;
    


    /*** SCI4ACR2 - SCI 4 Alternative Control Register 2; 0x00000132 ***/
    union {
      byte Byte;
      union { /*Several registers at the same address */
        /*** SCI4ACR2 - SCI 4 Alternative Control Register 2; Several registers at the same address ***/
        union {
          struct {
            byte BKDFE       :1;                                       /* Break Detect Feature Enable */
            byte BERRM0      :1;                                       /* Bit Error Mode Bit 0 */
            byte BERRM1      :1;                                       /* Bit Error Mode Bit 1 */
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
          } Bits;
          struct {
            byte :1;
            byte grpBERRM :2;
            byte :1;
            byte :1;
            byte :1;
            byte :1;
            byte :1;
          } MergedBits;
        } SCI4ACR2STR;
        #define SCI4ACR2 _SCI4BD.Overlap_STR.SCI4ACR2STR.Byte
        #define SCI4ACR2_BKDFE _SCI4BD.Overlap_STR.SCI4ACR2STR.SameAddr_STR.SCI4ACR2STR.Bits.BKDFE
        #define SCI4ACR2_BERRM0 _SCI4BD.Overlap_STR.SCI4ACR2STR.SameAddr_STR.SCI4ACR2STR.Bits.BERRM0
        #define SCI4ACR2_BERRM1 _SCI4BD.Overlap_STR.SCI4ACR2STR.SameAddr_STR.SCI4ACR2STR.Bits.BERRM1
        
        #define SCI4ACR2_BERRM _SCI4BD.Overlap_STR.SCI4ACR2STR.SameAddr_STR.SCI4ACR2STR.MergedBits.grpBERRM
        
        #define SCI4ACR2_BKDFE_MASK   1
        #define SCI4ACR2_BERRM0_MASK   2
        #define SCI4ACR2_BERRM1_MASK   4
        #define SCI4ACR2_BERRM_MASK  6
        #define SCI4ACR2_BERRM_BITNUM  1
    
        /*** SCI4CR1 - SCI 4 Control Register 1; Several registers at the same address ***/
        union {
          struct {
            byte PT          :1;                                       /* Parity Type Bit */
            byte PE          :1;                                       /* Parity Enable Bit */
            byte ILT         :1;                                       /* Idle Line Type Bit */
            byte WAKE        :1;                                       /* Wakeup Condition Bit */
            byte M           :1;                                       /* Data Format Mode Bit */
            byte RSRC        :1;                                       /* Receiver Source Bit */
            byte SCISWAI     :1;                                       /* SCI Stop in Wait Mode Bit */
            byte LOOPS       :1;                                       /* Loop Select Bit */
          } Bits;
        } SCI4CR1STR;
        #define SCI4CR1 _SCI4BD.Overlap_STR.SCI4ACR2STR.Byte
        #define SCI4CR1_PT _SCI4BD.Overlap_STR.SCI4ACR2STR.SameAddr_STR.SCI4CR1STR.Bits.PT
        #define SCI4CR1_PE _SCI4BD.Overlap_STR.SCI4ACR2STR.SameAddr_STR.SCI4CR1STR.Bits.PE
        #define SCI4CR1_ILT _SCI4BD.Overlap_STR.SCI4ACR2STR.SameAddr_STR.SCI4CR1STR.Bits.ILT
        #define SCI4CR1_WAKE _SCI4BD.Overlap_STR.SCI4ACR2STR.SameAddr_STR.SCI4CR1STR.Bits.WAKE
        #define SCI4CR1_M _SCI4BD.Overlap_STR.SCI4ACR2STR.SameAddr_STR.SCI4CR1STR.Bits.M
        #define SCI4CR1_RSRC _SCI4BD.Overlap_STR.SCI4ACR2STR.SameAddr_STR.SCI4CR1STR.Bits.RSRC
        #define SCI4CR1_SCISWAI _SCI4BD.Overlap_STR.SCI4ACR2STR.SameAddr_STR.SCI4CR1STR.Bits.SCISWAI
        #define SCI4CR1_LOOPS _SCI4BD.Overlap_STR.SCI4ACR2STR.SameAddr_STR.SCI4CR1STR.Bits.LOOPS
        
        
        #define SCI4CR1_PT_MASK   1
        #define SCI4CR1_PE_MASK   2
        #define SCI4CR1_ILT_MASK   4
        #define SCI4CR1_WAKE_MASK   8
        #define SCI4CR1_M_MASK   16
        #define SCI4CR1_RSRC_MASK   32
        #define SCI4CR1_SCISWAI_MASK   64
        #define SCI4CR1_LOOPS_MASK   128
    
      } SameAddr_STR; /*Several registers at the same address */
    
    } SCI4ACR2STR;
    

  } Overlap_STR;

  struct {
    word SBR0        :1;                                       /* SCI Baud Rate Bit 0 */
    word SBR1        :1;                                       /* SCI Baud Rate Bit 1 */
    word SBR2        :1;                                       /* SCI Baud Rate Bit 2 */
    word SBR3        :1;                                       /* SCI Baud Rate Bit 3 */
    word SBR4        :1;                                       /* SCI Baud Rate Bit 4 */
    word SBR5        :1;                                       /* SCI Baud Rate Bit 5 */
    word SBR6        :1;                                       /* SCI Baud Rate Bit 6 */
    word SBR7        :1;                                       /* SCI Baud Rate Bit 7 */
    word SBR8        :1;                                       /* SCI Baud Rate Bit 8 */
    word SBR9        :1;                                       /* SCI Baud Rate Bit 9 */
    word SBR10       :1;                                       /* SCI Baud Rate Bit 10 */
    word SBR11       :1;                                       /* SCI Baud Rate Bit 11 */
    word SBR12       :1;                                       /* SCI Baud Rate Bit 12 */
    word TNP0        :1;                                       /* Transmitter Narrow Pulse Bit 0 */
    word TNP1        :1;                                       /* Transmitter Narrow Pulse Bit 1 */
    word IREN        :1;                                       /* Infrared Enable Bit */
  } Bits;
  struct {
    word grpSBR  :13;
    word grpTNP  :2;
    word         :1;
  } MergedBits;
} SCI4BDSTR;
extern volatile SCI4BDSTR _SCI4BD @(REG_BASE + 0x00000131);
#define SCI4BD _SCI4BD.Word
#define SCI4BD_SBR0 _SCI4BD.Bits.SBR0
#define SCI4BD_SBR1 _SCI4BD.Bits.SBR1
#define SCI4BD_SBR2 _SCI4BD.Bits.SBR2
#define SCI4BD_SBR3 _SCI4BD.Bits.SBR3
#define SCI4BD_SBR4 _SCI4BD.Bits.SBR4
#define SCI4BD_SBR5 _SCI4BD.Bits.SBR5
#define SCI4BD_SBR6 _SCI4BD.Bits.SBR6
#define SCI4BD_SBR7 _SCI4BD.Bits.SBR7
#define SCI4BD_SBR8 _SCI4BD.Bits.SBR8
#define SCI4BD_SBR9 _SCI4BD.Bits.SBR9
#define SCI4BD_SBR10 _SCI4BD.Bits.SBR10
#define SCI4BD_SBR11 _SCI4BD.Bits.SBR11
#define SCI4BD_SBR12 _SCI4BD.Bits.SBR12
#define SCI4BD_TNP0 _SCI4BD.Bits.TNP0
#define SCI4BD_TNP1 _SCI4BD.Bits.TNP1
#define SCI4BD_IREN _SCI4BD.Bits.IREN
#define SCI4BD_SBR _SCI4BD.MergedBits.grpSBR
#define SCI4BD_TNP _SCI4BD.MergedBits.grpTNP

#define SCI4BD_SBR0_MASK   1
#define SCI4BD_SBR1_MASK   2
#define SCI4BD_SBR2_MASK   4
#define SCI4BD_SBR3_MASK   8
#define SCI4BD_SBR4_MASK   16
#define SCI4BD_SBR5_MASK   32
#define SCI4BD_SBR6_MASK   64
#define SCI4BD_SBR7_MASK   128
#define SCI4BD_SBR8_MASK   256
#define SCI4BD_SBR9_MASK   512
#define SCI4BD_SBR10_MASK   1024
#define SCI4BD_SBR11_MASK   2048
#define SCI4BD_SBR12_MASK   4096
#define SCI4BD_TNP0_MASK   8192
#define SCI4BD_TNP1_MASK   16384
#define SCI4BD_IREN_MASK   32768
#define SCI4BD_SBR_MASK  8191
#define SCI4BD_SBR_BITNUM  0
#define SCI4BD_TNP_MASK  24576
#define SCI4BD_TNP_BITNUM  13


/*** SCI4CR2 - SCI 4 Control Register 2; 0x00000133 ***/
typedef union {
  byte Byte;
  struct {
    byte SBK         :1;                                       /* Send Break Bit */
    byte RWU         :1;                                       /* Receiver Wakeup Bit */
    byte RE          :1;                                       /* Receiver Enable Bit */
    byte TE          :1;                                       /* Transmitter Enable Bit */
    byte ILIE        :1;                                       /* Idle Line Interrupt Enable Bit */
    byte RIE         :1;                                       /* Receiver Full Interrupt Enable Bit */
    byte TCIE        :1;                                       /* Transmission Complete Interrupt Enable Bit */
    byte SCTIE       :1;                                       /* Transmitter Interrupt Enable Bit */
  } Bits;
} SCI4CR2STR;
extern volatile SCI4CR2STR _SCI4CR2 @(REG_BASE + 0x00000133);
#define SCI4CR2 _SCI4CR2.Byte
#define SCI4CR2_SBK _SCI4CR2.Bits.SBK
#define SCI4CR2_RWU _SCI4CR2.Bits.RWU
#define SCI4CR2_RE _SCI4CR2.Bits.RE
#define SCI4CR2_TE _SCI4CR2.Bits.TE
#define SCI4CR2_ILIE _SCI4CR2.Bits.ILIE
#define SCI4CR2_RIE _SCI4CR2.Bits.RIE
#define SCI4CR2_TCIE _SCI4CR2.Bits.TCIE
#define SCI4CR2_SCTIE _SCI4CR2.Bits.SCTIE

#define SCI4CR2_SBK_MASK   1
#define SCI4CR2_RWU_MASK   2
#define SCI4CR2_RE_MASK   4
#define SCI4CR2_TE_MASK   8
#define SCI4CR2_ILIE_MASK   16
#define SCI4CR2_RIE_MASK   32
#define SCI4CR2_TCIE_MASK   64
#define SCI4CR2_SCTIE_MASK   128


