frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
/*** SCI4SR1 - SCI 4 Status Register 1; 0x00000134 ***/
typedef union {
  byte Byte;
  struct {
    byte PF          :1;                                       /* Parity Error Flag */
    byte FE          :1;                                       /* Framing Error Flag */
    byte NF          :1;                                       /* Noise Flag */
    byte OR          :1;                                       /* Overrun Flag */
    byte IDLE        :1;                                       /* Idle Line Flag */
    byte RDRF        :1;                                       /* Receive Data Register Full Flag */
    byte TC          :1;                                       /* Transmit Complete Flag */
    byte TDRE        :1;                                       /* Transmit Data Register Empty Flag */
  } Bits;
} SCI4SR1STR;
extern volatile SCI4SR1STR _SCI4SR1 @(REG_BASE + 0x00000134);
#define SCI4SR1 _SCI4SR1.Byte
#define SCI4SR1_PF _SCI4SR1.Bits.PF
#define SCI4SR1_FE _SCI4SR1.Bits.FE
#define SCI4SR1_NF _SCI4SR1.Bits.NF
#define SCI4SR1_OR _SCI4SR1.Bits.OR
#define SCI4SR1_IDLE _SCI4SR1.Bits.IDLE
#define SCI4SR1_RDRF _SCI4SR1.Bits.RDRF
#define SCI4SR1_TC _SCI4SR1.Bits.TC
#define SCI4SR1_TDRE _SCI4SR1.Bits.TDRE

#define SCI4SR1_PF_MASK   1
#define SCI4SR1_FE_MASK   2
#define SCI4SR1_NF_MASK   4
#define SCI4SR1_OR_MASK   8
#define SCI4SR1_IDLE_MASK   16
#define SCI4SR1_RDRF_MASK   32
#define SCI4SR1_TC_MASK   64
#define SCI4SR1_TDRE_MASK   128


/*** SCI4SR2 - SCI 4 Status Register 2; 0x00000135 ***/
typedef union {
  byte Byte;
  struct {
    byte RAF         :1;                                       /* Receiver Active Flag */
    byte TXDIR       :1;                                       /* Transmitter pin data direction in Single-Wire mode */
    byte BRK13       :1;                                       /* Break Transmit character length */
    byte RXPOL       :1;                                       /* Receive Polarity */
    byte TXPOL       :1;                                       /* Transmit Polarity */
    byte             :1; 
    byte             :1; 
    byte AMAP        :1;                                       /* Alternative Map */
  } Bits;
} SCI4SR2STR;
extern volatile SCI4SR2STR _SCI4SR2 @(REG_BASE + 0x00000135);
#define SCI4SR2 _SCI4SR2.Byte
#define SCI4SR2_RAF _SCI4SR2.Bits.RAF
#define SCI4SR2_TXDIR _SCI4SR2.Bits.TXDIR
#define SCI4SR2_BRK13 _SCI4SR2.Bits.BRK13
#define SCI4SR2_RXPOL _SCI4SR2.Bits.RXPOL
#define SCI4SR2_TXPOL _SCI4SR2.Bits.TXPOL
#define SCI4SR2_AMAP _SCI4SR2.Bits.AMAP

#define SCI4SR2_RAF_MASK   1
#define SCI4SR2_TXDIR_MASK   2
#define SCI4SR2_BRK13_MASK   4
#define SCI4SR2_RXPOL_MASK   8
#define SCI4SR2_TXPOL_MASK   16
#define SCI4SR2_AMAP_MASK   128


/*** SCI4DRH - SCI 4 Data Register High; 0x00000136 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte T8          :1;                                       /* Transmit Bit 8 */
    byte R8          :1;                                       /* Received Bit 8 */
  } Bits;
} SCI4DRHSTR;
extern volatile SCI4DRHSTR _SCI4DRH @(REG_BASE + 0x00000136);
#define SCI4DRH _SCI4DRH.Byte
#define SCI4DRH_T8 _SCI4DRH.Bits.T8
#define SCI4DRH_R8 _SCI4DRH.Bits.R8

#define SCI4DRH_T8_MASK   64
#define SCI4DRH_R8_MASK   128


/*** SCI4DRL - SCI 4 Data Register Low; 0x00000137 ***/
typedef union {
  byte Byte;
  struct {
    byte R0_T0       :1;                                       /* Received bit 0 or Transmit bit 0 */
    byte R1_T1       :1;                                       /* Received bit 1 or Transmit bit 1 */
    byte R2_T2       :1;                                       /* Received bit 2 or Transmit bit 2 */
    byte R3_T3       :1;                                       /* Received bit 3 or Transmit bit 3 */
    byte R4_T4       :1;                                       /* Received bit 4 or Transmit bit 4 */
    byte R5_T5       :1;                                       /* Received bit 5 or Transmit bit 5 */
    byte R6_T6       :1;                                       /* Received bit 6 or Transmit bit 6 */
    byte R7_T7       :1;                                       /* Received bit 7 or Transmit bit 7 */
  } Bits;
} SCI4DRLSTR;
extern volatile SCI4DRLSTR _SCI4DRL @(REG_BASE + 0x00000137);
#define SCI4DRL _SCI4DRL.Byte
#define SCI4DRL_R0_T0 _SCI4DRL.Bits.R0_T0
#define SCI4DRL_R1_T1 _SCI4DRL.Bits.R1_T1
#define SCI4DRL_R2_T2 _SCI4DRL.Bits.R2_T2
#define SCI4DRL_R3_T3 _SCI4DRL.Bits.R3_T3
#define SCI4DRL_R4_T4 _SCI4DRL.Bits.R4_T4
#define SCI4DRL_R5_T5 _SCI4DRL.Bits.R5_T5
#define SCI4DRL_R6_T6 _SCI4DRL.Bits.R6_T6
#define SCI4DRL_R7_T7 _SCI4DRL.Bits.R7_T7

#define SCI4DRL_R0_T0_MASK   1
#define SCI4DRL_R1_T1_MASK   2
#define SCI4DRL_R2_T2_MASK   4
#define SCI4DRL_R3_T3_MASK   8
#define SCI4DRL_R4_T4_MASK   16
#define SCI4DRL_R5_T5_MASK   32
#define SCI4DRL_R6_T6_MASK   64
#define SCI4DRL_R7_T7_MASK   128


/*** SCI5ASR1 - SCI 5 Alternative Status Register 1; 0x00000138 ***/
typedef union {
  byte Byte;
  union { /*Several registers at the same address */
    /*** SCI5ASR1 - SCI 5 Alternative Status Register 1; Several registers at the same address ***/
    union {
      struct {
        byte BKDIF       :1;                                       /* Break Detect Interrupt Flag */
        byte BERRIF      :1;                                       /* Bit Error Interrupt Flag */
        byte BERRV       :1;                                       /* Bit Error Value */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte RXEDGIF     :1;                                       /* Receive Input Active Edge Interrupt Flag */
      } Bits;
    } SCI5ASR1STR;
    #define SCI5ASR1 _SCI5ASR1.Byte
    #define SCI5ASR1_BKDIF _SCI5ASR1.SameAddr_STR.SCI5ASR1STR.Bits.BKDIF
    #define SCI5ASR1_BERRIF _SCI5ASR1.SameAddr_STR.SCI5ASR1STR.Bits.BERRIF
    #define SCI5ASR1_BERRV _SCI5ASR1.SameAddr_STR.SCI5ASR1STR.Bits.BERRV
    #define SCI5ASR1_RXEDGIF _SCI5ASR1.SameAddr_STR.SCI5ASR1STR.Bits.RXEDGIF
    
    
    #define SCI5ASR1_BKDIF_MASK   1
    #define SCI5ASR1_BERRIF_MASK   2
    #define SCI5ASR1_BERRV_MASK   4
    #define SCI5ASR1_RXEDGIF_MASK   128

    /*** SCI5BDH - SCI 5 Baud Rate Register High; Several registers at the same address ***/
    union {
      struct {
        byte SBR8        :1;                                       /* SCI Baud Rate Bit 8 */
        byte SBR9        :1;                                       /* SCI Baud Rate Bit 9 */
        byte SBR10       :1;                                       /* SCI Baud Rate Bit 10 */
        byte SBR11       :1;                                       /* SCI Baud Rate Bit 11 */
        byte SBR12       :1;                                       /* SCI Baud Rate Bit 12 */
        byte TNP0        :1;                                       /* Transmitter Narrow Pulse Bit 0 */
        byte TNP1        :1;                                       /* Transmitter Narrow Pulse Bit 1 */
        byte IREN        :1;                                       /* Infrared Enable Bit */
      } Bits;
      struct {
        byte grpSBR_8 :5;
        byte grpTNP :2;
        byte     :1;
      } MergedBits;
    } SCI5BDHSTR;
    #define SCI5BDH _SCI5ASR1.Byte
    #define SCI5BDH_SBR8 _SCI5ASR1.SameAddr_STR.SCI5BDHSTR.Bits.SBR8
    #define SCI5BDH_SBR9 _SCI5ASR1.SameAddr_STR.SCI5BDHSTR.Bits.SBR9
    #define SCI5BDH_SBR10 _SCI5ASR1.SameAddr_STR.SCI5BDHSTR.Bits.SBR10
    #define SCI5BDH_SBR11 _SCI5ASR1.SameAddr_STR.SCI5BDHSTR.Bits.SBR11
    #define SCI5BDH_SBR12 _SCI5ASR1.SameAddr_STR.SCI5BDHSTR.Bits.SBR12
    #define SCI5BDH_TNP0 _SCI5ASR1.SameAddr_STR.SCI5BDHSTR.Bits.TNP0
    #define SCI5BDH_TNP1 _SCI5ASR1.SameAddr_STR.SCI5BDHSTR.Bits.TNP1
    #define SCI5BDH_IREN _SCI5ASR1.SameAddr_STR.SCI5BDHSTR.Bits.IREN
    
    #define SCI5BDH_SBR_8 _SCI5ASR1.SameAddr_STR.SCI5BDHSTR.MergedBits.grpSBR_8
    #define SCI5BDH_TNP _SCI5ASR1.SameAddr_STR.SCI5BDHSTR.MergedBits.grpTNP
    #define SCI5BDH_SBR SCI5BDH_SBR_8
    
    #define SCI5BDH_SBR8_MASK   1
    #define SCI5BDH_SBR9_MASK   2
    #define SCI5BDH_SBR10_MASK   4
    #define SCI5BDH_SBR11_MASK   8
    #define SCI5BDH_SBR12_MASK   16
    #define SCI5BDH_TNP0_MASK   32
    #define SCI5BDH_TNP1_MASK   64
    #define SCI5BDH_IREN_MASK   128
    #define SCI5BDH_SBR_8_MASK  31
    #define SCI5BDH_SBR_8_BITNUM  0
    #define SCI5BDH_TNP_MASK  96
    #define SCI5BDH_TNP_BITNUM  5

