frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
      } SameAddr_STR; /*Several registers at the same address */
    
    } SCI5ACR2STR;
    

  } Overlap_STR;

  struct {
    word SBR0        :1;                                       /* SCI Baud Rate Bit 0 */
    word SBR1        :1;                                       /* SCI Baud Rate Bit 1 */
    word SBR2        :1;                                       /* SCI Baud Rate Bit 2 */
    word SBR3        :1;                                       /* SCI Baud Rate Bit 3 */
    word SBR4        :1;                                       /* SCI Baud Rate Bit 4 */
    word SBR5        :1;                                       /* SCI Baud Rate Bit 5 */
    word SBR6        :1;                                       /* SCI Baud Rate Bit 6 */
    word SBR7        :1;                                       /* SCI Baud Rate Bit 7 */
    word SBR8        :1;                                       /* SCI Baud Rate Bit 8 */
    word SBR9        :1;                                       /* SCI Baud Rate Bit 9 */
    word SBR10       :1;                                       /* SCI Baud Rate Bit 10 */
    word SBR11       :1;                                       /* SCI Baud Rate Bit 11 */
    word SBR12       :1;                                       /* SCI Baud Rate Bit 12 */
    word TNP0        :1;                                       /* Transmitter Narrow Pulse Bit 0 */
    word TNP1        :1;                                       /* Transmitter Narrow Pulse Bit 1 */
    word IREN        :1;                                       /* Infrared Enable Bit */
  } Bits;
  struct {
    word grpSBR  :13;
    word grpTNP  :2;
    word         :1;
  } MergedBits;
} SCI5BDSTR;
extern volatile SCI5BDSTR _SCI5BD @(REG_BASE + 0x00000139);
#define SCI5BD _SCI5BD.Word
#define SCI5BD_SBR0 _SCI5BD.Bits.SBR0
#define SCI5BD_SBR1 _SCI5BD.Bits.SBR1
#define SCI5BD_SBR2 _SCI5BD.Bits.SBR2
#define SCI5BD_SBR3 _SCI5BD.Bits.SBR3
#define SCI5BD_SBR4 _SCI5BD.Bits.SBR4
#define SCI5BD_SBR5 _SCI5BD.Bits.SBR5
#define SCI5BD_SBR6 _SCI5BD.Bits.SBR6
#define SCI5BD_SBR7 _SCI5BD.Bits.SBR7
#define SCI5BD_SBR8 _SCI5BD.Bits.SBR8
#define SCI5BD_SBR9 _SCI5BD.Bits.SBR9
#define SCI5BD_SBR10 _SCI5BD.Bits.SBR10
#define SCI5BD_SBR11 _SCI5BD.Bits.SBR11
#define SCI5BD_SBR12 _SCI5BD.Bits.SBR12
#define SCI5BD_TNP0 _SCI5BD.Bits.TNP0
#define SCI5BD_TNP1 _SCI5BD.Bits.TNP1
#define SCI5BD_IREN _SCI5BD.Bits.IREN
#define SCI5BD_SBR _SCI5BD.MergedBits.grpSBR
#define SCI5BD_TNP _SCI5BD.MergedBits.grpTNP

#define SCI5BD_SBR0_MASK   1
#define SCI5BD_SBR1_MASK   2
#define SCI5BD_SBR2_MASK   4
#define SCI5BD_SBR3_MASK   8
#define SCI5BD_SBR4_MASK   16
#define SCI5BD_SBR5_MASK   32
#define SCI5BD_SBR6_MASK   64
#define SCI5BD_SBR7_MASK   128
#define SCI5BD_SBR8_MASK   256
#define SCI5BD_SBR9_MASK   512
#define SCI5BD_SBR10_MASK   1024
#define SCI5BD_SBR11_MASK   2048
#define SCI5BD_SBR12_MASK   4096
#define SCI5BD_TNP0_MASK   8192
#define SCI5BD_TNP1_MASK   16384
#define SCI5BD_IREN_MASK   32768
#define SCI5BD_SBR_MASK  8191
#define SCI5BD_SBR_BITNUM  0
#define SCI5BD_TNP_MASK  24576
#define SCI5BD_TNP_BITNUM  13


/*** SCI5CR2 - SCI 5 Control Register 2; 0x0000013B ***/
typedef union {
  byte Byte;
  struct {
    byte SBK         :1;                                       /* Send Break Bit */
    byte RWU         :1;                                       /* Receiver Wakeup Bit */
    byte RE          :1;                                       /* Receiver Enable Bit */
    byte TE          :1;                                       /* Transmitter Enable Bit */
    byte ILIE        :1;                                       /* Idle Line Interrupt Enable Bit */
    byte RIE         :1;                                       /* Receiver Full Interrupt Enable Bit */
    byte TCIE        :1;                                       /* Transmission Complete Interrupt Enable Bit */
    byte SCTIE       :1;                                       /* Transmitter Interrupt Enable Bit */
  } Bits;
} SCI5CR2STR;
extern volatile SCI5CR2STR _SCI5CR2 @(REG_BASE + 0x0000013B);
#define SCI5CR2 _SCI5CR2.Byte
#define SCI5CR2_SBK _SCI5CR2.Bits.SBK
#define SCI5CR2_RWU _SCI5CR2.Bits.RWU
#define SCI5CR2_RE _SCI5CR2.Bits.RE
#define SCI5CR2_TE _SCI5CR2.Bits.TE
#define SCI5CR2_ILIE _SCI5CR2.Bits.ILIE
#define SCI5CR2_RIE _SCI5CR2.Bits.RIE
#define SCI5CR2_TCIE _SCI5CR2.Bits.TCIE
#define SCI5CR2_SCTIE _SCI5CR2.Bits.SCTIE

#define SCI5CR2_SBK_MASK   1
#define SCI5CR2_RWU_MASK   2
#define SCI5CR2_RE_MASK   4
#define SCI5CR2_TE_MASK   8
#define SCI5CR2_ILIE_MASK   16
#define SCI5CR2_RIE_MASK   32
#define SCI5CR2_TCIE_MASK   64
#define SCI5CR2_SCTIE_MASK   128


/*** SCI5SR1 - SCI 5 Status Register 1; 0x0000013C ***/
typedef union {
  byte Byte;
  struct {
    byte PF          :1;                                       /* Parity Error Flag */
    byte FE          :1;                                       /* Framing Error Flag */
    byte NF          :1;                                       /* Noise Flag */
    byte OR          :1;                                       /* Overrun Flag */
    byte IDLE        :1;                                       /* Idle Line Flag */
    byte RDRF        :1;                                       /* Receive Data Register Full Flag */
    byte TC          :1;                                       /* Transmit Complete Flag */
    byte TDRE        :1;                                       /* Transmit Data Register Empty Flag */
  } Bits;
} SCI5SR1STR;
extern volatile SCI5SR1STR _SCI5SR1 @(REG_BASE + 0x0000013C);
#define SCI5SR1 _SCI5SR1.Byte
#define SCI5SR1_PF _SCI5SR1.Bits.PF
#define SCI5SR1_FE _SCI5SR1.Bits.FE
#define SCI5SR1_NF _SCI5SR1.Bits.NF
#define SCI5SR1_OR _SCI5SR1.Bits.OR
#define SCI5SR1_IDLE _SCI5SR1.Bits.IDLE
#define SCI5SR1_RDRF _SCI5SR1.Bits.RDRF
#define SCI5SR1_TC _SCI5SR1.Bits.TC
#define SCI5SR1_TDRE _SCI5SR1.Bits.TDRE

#define SCI5SR1_PF_MASK   1
#define SCI5SR1_FE_MASK   2
#define SCI5SR1_NF_MASK   4
#define SCI5SR1_OR_MASK   8
#define SCI5SR1_IDLE_MASK   16
#define SCI5SR1_RDRF_MASK   32
#define SCI5SR1_TC_MASK   64
#define SCI5SR1_TDRE_MASK   128


/*** SCI5SR2 - SCI 5 Status Register 2; 0x0000013D ***/
typedef union {
  byte Byte;
  struct {
    byte RAF         :1;                                       /* Receiver Active Flag */
    byte TXDIR       :1;                                       /* Transmitter pin data direction in Single-Wire mode */
    byte BRK13       :1;                                       /* Break Transmit character length */
    byte RXPOL       :1;                                       /* Receive Polarity */
    byte TXPOL       :1;                                       /* Transmit Polarity */
    byte             :1; 
    byte             :1; 
    byte AMAP        :1;                                       /* Alternative Map */
  } Bits;
} SCI5SR2STR;
extern volatile SCI5SR2STR _SCI5SR2 @(REG_BASE + 0x0000013D);
#define SCI5SR2 _SCI5SR2.Byte
#define SCI5SR2_RAF _SCI5SR2.Bits.RAF
#define SCI5SR2_TXDIR _SCI5SR2.Bits.TXDIR
#define SCI5SR2_BRK13 _SCI5SR2.Bits.BRK13
#define SCI5SR2_RXPOL _SCI5SR2.Bits.RXPOL
#define SCI5SR2_TXPOL _SCI5SR2.Bits.TXPOL
#define SCI5SR2_AMAP _SCI5SR2.Bits.AMAP

#define SCI5SR2_RAF_MASK   1
#define SCI5SR2_TXDIR_MASK   2
#define SCI5SR2_BRK13_MASK   4
#define SCI5SR2_RXPOL_MASK   8
#define SCI5SR2_TXPOL_MASK   16
#define SCI5SR2_AMAP_MASK   128


