frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
extern volatile CAN0IDAR1STR _CAN0IDAR1 @(REG_BASE + 0x00000151);
#define CAN0IDAR1 _CAN0IDAR1.Byte
#define CAN0IDAR1_AC0 _CAN0IDAR1.Bits.AC0
#define CAN0IDAR1_AC1 _CAN0IDAR1.Bits.AC1
#define CAN0IDAR1_AC2 _CAN0IDAR1.Bits.AC2
#define CAN0IDAR1_AC3 _CAN0IDAR1.Bits.AC3
#define CAN0IDAR1_AC4 _CAN0IDAR1.Bits.AC4
#define CAN0IDAR1_AC5 _CAN0IDAR1.Bits.AC5
#define CAN0IDAR1_AC6 _CAN0IDAR1.Bits.AC6
#define CAN0IDAR1_AC7 _CAN0IDAR1.Bits.AC7
#define CAN0IDAR1_AC _CAN0IDAR1.MergedBits.grpAC

#define CAN0IDAR1_AC0_MASK   1
#define CAN0IDAR1_AC1_MASK   2
#define CAN0IDAR1_AC2_MASK   4
#define CAN0IDAR1_AC3_MASK   8
#define CAN0IDAR1_AC4_MASK   16
#define CAN0IDAR1_AC5_MASK   32
#define CAN0IDAR1_AC6_MASK   64
#define CAN0IDAR1_AC7_MASK   128
#define CAN0IDAR1_AC_MASK  255
#define CAN0IDAR1_AC_BITNUM  0


/*** CAN0IDAR2 - MSCAN 0 Identifier Acceptance Register 2; 0x00000152 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
  struct {
    byte grpAC   :8;
  } MergedBits;
} CAN0IDAR2STR;
extern volatile CAN0IDAR2STR _CAN0IDAR2 @(REG_BASE + 0x00000152);
#define CAN0IDAR2 _CAN0IDAR2.Byte
#define CAN0IDAR2_AC0 _CAN0IDAR2.Bits.AC0
#define CAN0IDAR2_AC1 _CAN0IDAR2.Bits.AC1
#define CAN0IDAR2_AC2 _CAN0IDAR2.Bits.AC2
#define CAN0IDAR2_AC3 _CAN0IDAR2.Bits.AC3
#define CAN0IDAR2_AC4 _CAN0IDAR2.Bits.AC4
#define CAN0IDAR2_AC5 _CAN0IDAR2.Bits.AC5
#define CAN0IDAR2_AC6 _CAN0IDAR2.Bits.AC6
#define CAN0IDAR2_AC7 _CAN0IDAR2.Bits.AC7
#define CAN0IDAR2_AC _CAN0IDAR2.MergedBits.grpAC

#define CAN0IDAR2_AC0_MASK   1
#define CAN0IDAR2_AC1_MASK   2
#define CAN0IDAR2_AC2_MASK   4
#define CAN0IDAR2_AC3_MASK   8
#define CAN0IDAR2_AC4_MASK   16
#define CAN0IDAR2_AC5_MASK   32
#define CAN0IDAR2_AC6_MASK   64
#define CAN0IDAR2_AC7_MASK   128
#define CAN0IDAR2_AC_MASK  255
#define CAN0IDAR2_AC_BITNUM  0


/*** CAN0IDAR3 - MSCAN 0 Identifier Acceptance Register 3; 0x00000153 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
  struct {
    byte grpAC   :8;
  } MergedBits;
} CAN0IDAR3STR;
extern volatile CAN0IDAR3STR _CAN0IDAR3 @(REG_BASE + 0x00000153);
#define CAN0IDAR3 _CAN0IDAR3.Byte
#define CAN0IDAR3_AC0 _CAN0IDAR3.Bits.AC0
#define CAN0IDAR3_AC1 _CAN0IDAR3.Bits.AC1
#define CAN0IDAR3_AC2 _CAN0IDAR3.Bits.AC2
#define CAN0IDAR3_AC3 _CAN0IDAR3.Bits.AC3
#define CAN0IDAR3_AC4 _CAN0IDAR3.Bits.AC4
#define CAN0IDAR3_AC5 _CAN0IDAR3.Bits.AC5
#define CAN0IDAR3_AC6 _CAN0IDAR3.Bits.AC6
#define CAN0IDAR3_AC7 _CAN0IDAR3.Bits.AC7
#define CAN0IDAR3_AC _CAN0IDAR3.MergedBits.grpAC

#define CAN0IDAR3_AC0_MASK   1
#define CAN0IDAR3_AC1_MASK   2
#define CAN0IDAR3_AC2_MASK   4
#define CAN0IDAR3_AC3_MASK   8
#define CAN0IDAR3_AC4_MASK   16
#define CAN0IDAR3_AC5_MASK   32
#define CAN0IDAR3_AC6_MASK   64
#define CAN0IDAR3_AC7_MASK   128
#define CAN0IDAR3_AC_MASK  255
#define CAN0IDAR3_AC_BITNUM  0


/*** CAN0IDMR0 - MSCAN 0 Identifier Mask Register 0; 0x00000154 ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
  struct {
    byte grpAM   :8;
  } MergedBits;
} CAN0IDMR0STR;
extern volatile CAN0IDMR0STR _CAN0IDMR0 @(REG_BASE + 0x00000154);
#define CAN0IDMR0 _CAN0IDMR0.Byte
#define CAN0IDMR0_AM0 _CAN0IDMR0.Bits.AM0
#define CAN0IDMR0_AM1 _CAN0IDMR0.Bits.AM1
#define CAN0IDMR0_AM2 _CAN0IDMR0.Bits.AM2
#define CAN0IDMR0_AM3 _CAN0IDMR0.Bits.AM3
#define CAN0IDMR0_AM4 _CAN0IDMR0.Bits.AM4
#define CAN0IDMR0_AM5 _CAN0IDMR0.Bits.AM5
#define CAN0IDMR0_AM6 _CAN0IDMR0.Bits.AM6
#define CAN0IDMR0_AM7 _CAN0IDMR0.Bits.AM7
/* CAN0IDMR_ARR: Access 4 CAN0IDMRx registers in a array */
#define CAN0IDMR_ARR ((Byte *) &CAN0IDMR0)
#define CAN0IDMR0_AM _CAN0IDMR0.MergedBits.grpAM

#define CAN0IDMR0_AM0_MASK   1
#define CAN0IDMR0_AM1_MASK   2
#define CAN0IDMR0_AM2_MASK   4
#define CAN0IDMR0_AM3_MASK   8
#define CAN0IDMR0_AM4_MASK   16
#define CAN0IDMR0_AM5_MASK   32
#define CAN0IDMR0_AM6_MASK   64
#define CAN0IDMR0_AM7_MASK   128
#define CAN0IDMR0_AM_MASK  255
#define CAN0IDMR0_AM_BITNUM  0


