frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
#define CAN0RXIDR0_ID21_MASK   1
#define CAN0RXIDR0_ID22_MASK   2
#define CAN0RXIDR0_ID23_MASK   4
#define CAN0RXIDR0_ID24_MASK   8
#define CAN0RXIDR0_ID25_MASK   16
#define CAN0RXIDR0_ID26_MASK   32
#define CAN0RXIDR0_ID27_MASK   64
#define CAN0RXIDR0_ID28_MASK   128
#define CAN0RXIDR0_ID_21_MASK  255
#define CAN0RXIDR0_ID_21_BITNUM  0


/*** CAN0RXIDR1 - MSCAN 0 Receive Identifier Register 1; 0x00000161 ***/
typedef union {
  byte Byte;
  struct {
    byte ID15        :1;                                       /* Extended format identifier Bit 15 */
    byte ID16        :1;                                       /* Extended format identifier Bit 16 */
    byte ID17        :1;                                       /* Extended format identifier Bit 17 */
    byte IDE         :1;                                       /* ID Extended */
    byte SRR         :1;                                       /* Substitute Remote Request */
    byte ID18        :1;                                       /* Extended format identifier Bit 18 */
    byte ID19        :1;                                       /* Extended format identifier Bit 19 */
    byte ID20        :1;                                       /* Extended format identifier Bit 20 */
  } Bits;
  struct {
    byte grpID_15 :3;
    byte         :1;
    byte         :1;
    byte grpID_18 :3;
  } MergedBits;
} CAN0RXIDR1STR;
extern volatile CAN0RXIDR1STR _CAN0RXIDR1 @(REG_BASE + 0x00000161);
#define CAN0RXIDR1 _CAN0RXIDR1.Byte
#define CAN0RXIDR1_ID15 _CAN0RXIDR1.Bits.ID15
#define CAN0RXIDR1_ID16 _CAN0RXIDR1.Bits.ID16
#define CAN0RXIDR1_ID17 _CAN0RXIDR1.Bits.ID17
#define CAN0RXIDR1_IDE _CAN0RXIDR1.Bits.IDE
#define CAN0RXIDR1_SRR _CAN0RXIDR1.Bits.SRR
#define CAN0RXIDR1_ID18 _CAN0RXIDR1.Bits.ID18
#define CAN0RXIDR1_ID19 _CAN0RXIDR1.Bits.ID19
#define CAN0RXIDR1_ID20 _CAN0RXIDR1.Bits.ID20
#define CAN0RXIDR1_ID_15 _CAN0RXIDR1.MergedBits.grpID_15
#define CAN0RXIDR1_ID_18 _CAN0RXIDR1.MergedBits.grpID_18
#define CAN0RXIDR1_ID CAN0RXIDR1_ID_15

#define CAN0RXIDR1_ID15_MASK   1
#define CAN0RXIDR1_ID16_MASK   2
#define CAN0RXIDR1_ID17_MASK   4
#define CAN0RXIDR1_IDE_MASK   8
#define CAN0RXIDR1_SRR_MASK   16
#define CAN0RXIDR1_ID18_MASK   32
#define CAN0RXIDR1_ID19_MASK   64
#define CAN0RXIDR1_ID20_MASK   128
#define CAN0RXIDR1_ID_15_MASK  7
#define CAN0RXIDR1_ID_15_BITNUM  0
#define CAN0RXIDR1_ID_18_MASK  224
#define CAN0RXIDR1_ID_18_BITNUM  5


/*** CAN0RXIDR2 - MSCAN 0 Receive Identifier Register 2; 0x00000162 ***/
typedef union {
  byte Byte;
  struct {
    byte ID7         :1;                                       /* Extended format identifier Bit 7 */
    byte ID8         :1;                                       /* Extended format identifier Bit 8 */
    byte ID9         :1;                                       /* Extended format identifier Bit 9 */
    byte ID10        :1;                                       /* Extended format identifier Bit 10 */
    byte ID11        :1;                                       /* Extended format identifier Bit 11 */
    byte ID12        :1;                                       /* Extended format identifier Bit 12 */
    byte ID13        :1;                                       /* Extended format identifier Bit 13 */
    byte ID14        :1;                                       /* Extended format identifier Bit 14 */
  } Bits;
  struct {
    byte grpID_7 :8;
  } MergedBits;
} CAN0RXIDR2STR;
extern volatile CAN0RXIDR2STR _CAN0RXIDR2 @(REG_BASE + 0x00000162);
#define CAN0RXIDR2 _CAN0RXIDR2.Byte
#define CAN0RXIDR2_ID7 _CAN0RXIDR2.Bits.ID7
#define CAN0RXIDR2_ID8 _CAN0RXIDR2.Bits.ID8
#define CAN0RXIDR2_ID9 _CAN0RXIDR2.Bits.ID9
#define CAN0RXIDR2_ID10 _CAN0RXIDR2.Bits.ID10
#define CAN0RXIDR2_ID11 _CAN0RXIDR2.Bits.ID11
#define CAN0RXIDR2_ID12 _CAN0RXIDR2.Bits.ID12
#define CAN0RXIDR2_ID13 _CAN0RXIDR2.Bits.ID13
#define CAN0RXIDR2_ID14 _CAN0RXIDR2.Bits.ID14
#define CAN0RXIDR2_ID_7 _CAN0RXIDR2.MergedBits.grpID_7
#define CAN0RXIDR2_ID CAN0RXIDR2_ID_7

#define CAN0RXIDR2_ID7_MASK   1
#define CAN0RXIDR2_ID8_MASK   2
#define CAN0RXIDR2_ID9_MASK   4
#define CAN0RXIDR2_ID10_MASK   8
#define CAN0RXIDR2_ID11_MASK   16
#define CAN0RXIDR2_ID12_MASK   32
#define CAN0RXIDR2_ID13_MASK   64
#define CAN0RXIDR2_ID14_MASK   128
#define CAN0RXIDR2_ID_7_MASK  255
#define CAN0RXIDR2_ID_7_BITNUM  0


/*** CAN0RXIDR3 - MSCAN 0 Receive Identifier Register 3; 0x00000163 ***/
typedef union {
  byte Byte;
  struct {
    byte RTR         :1;                                       /* Remote Transmission Request */
    byte ID0         :1;                                       /* Extended format identifier Bit 0 */
    byte ID1         :1;                                       /* Extended format identifier Bit 1 */
    byte ID2         :1;                                       /* Extended format identifier Bit 2 */
    byte ID3         :1;                                       /* Extended format identifier Bit 3 */
    byte ID4         :1;                                       /* Extended format identifier Bit 4 */
    byte ID5         :1;                                       /* Extended format identifier Bit 5 */
    byte ID6         :1;                                       /* Extended format identifier Bit 6 */
  } Bits;
  struct {
    byte         :1;
    byte grpID   :7;
  } MergedBits;
} CAN0RXIDR3STR;
extern volatile CAN0RXIDR3STR _CAN0RXIDR3 @(REG_BASE + 0x00000163);
#define CAN0RXIDR3 _CAN0RXIDR3.Byte
#define CAN0RXIDR3_RTR _CAN0RXIDR3.Bits.RTR
#define CAN0RXIDR3_ID0 _CAN0RXIDR3.Bits.ID0
#define CAN0RXIDR3_ID1 _CAN0RXIDR3.Bits.ID1
#define CAN0RXIDR3_ID2 _CAN0RXIDR3.Bits.ID2
#define CAN0RXIDR3_ID3 _CAN0RXIDR3.Bits.ID3
#define CAN0RXIDR3_ID4 _CAN0RXIDR3.Bits.ID4
#define CAN0RXIDR3_ID5 _CAN0RXIDR3.Bits.ID5
#define CAN0RXIDR3_ID6 _CAN0RXIDR3.Bits.ID6
#define CAN0RXIDR3_ID _CAN0RXIDR3.MergedBits.grpID

#define CAN0RXIDR3_RTR_MASK   1
#define CAN0RXIDR3_ID0_MASK   2
#define CAN0RXIDR3_ID1_MASK   4
#define CAN0RXIDR3_ID2_MASK   8
#define CAN0RXIDR3_ID3_MASK   16
#define CAN0RXIDR3_ID4_MASK   32
#define CAN0RXIDR3_ID5_MASK   64
#define CAN0RXIDR3_ID6_MASK   128
#define CAN0RXIDR3_ID_MASK  254
#define CAN0RXIDR3_ID_BITNUM  1


/*** CAN0RXDSR0 - MSCAN 0 Receive Data Segment Register 0; 0x00000164 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN0RXDSR0STR;
extern volatile CAN0RXDSR0STR _CAN0RXDSR0 @(REG_BASE + 0x00000164);
#define CAN0RXDSR0 _CAN0RXDSR0.Byte
#define CAN0RXDSR0_DB0 _CAN0RXDSR0.Bits.DB0
#define CAN0RXDSR0_DB1 _CAN0RXDSR0.Bits.DB1
#define CAN0RXDSR0_DB2 _CAN0RXDSR0.Bits.DB2
#define CAN0RXDSR0_DB3 _CAN0RXDSR0.Bits.DB3
#define CAN0RXDSR0_DB4 _CAN0RXDSR0.Bits.DB4
#define CAN0RXDSR0_DB5 _CAN0RXDSR0.Bits.DB5
#define CAN0RXDSR0_DB6 _CAN0RXDSR0.Bits.DB6
#define CAN0RXDSR0_DB7 _CAN0RXDSR0.Bits.DB7
/* CAN0RXDSR_ARR: Access 8 CAN0RXDSRx registers in a array */
#define CAN0RXDSR_ARR ((Byte *) &CAN0RXDSR0)
#define CAN0RXDSR0_DB _CAN0RXDSR0.MergedBits.grpDB

#define CAN0RXDSR0_DB0_MASK   1
#define CAN0RXDSR0_DB1_MASK   2
#define CAN0RXDSR0_DB2_MASK   4
#define CAN0RXDSR0_DB3_MASK   8
#define CAN0RXDSR0_DB4_MASK   16
#define CAN0RXDSR0_DB5_MASK   32
#define CAN0RXDSR0_DB6_MASK   64
#define CAN0RXDSR0_DB7_MASK   128
#define CAN0RXDSR0_DB_MASK  255
#define CAN0RXDSR0_DB_BITNUM  0


