frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
/*** CAN0RXDSR1 - MSCAN 0 Receive Data Segment Register 1; 0x00000165 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN0RXDSR1STR;
extern volatile CAN0RXDSR1STR _CAN0RXDSR1 @(REG_BASE + 0x00000165);
#define CAN0RXDSR1 _CAN0RXDSR1.Byte
#define CAN0RXDSR1_DB0 _CAN0RXDSR1.Bits.DB0
#define CAN0RXDSR1_DB1 _CAN0RXDSR1.Bits.DB1
#define CAN0RXDSR1_DB2 _CAN0RXDSR1.Bits.DB2
#define CAN0RXDSR1_DB3 _CAN0RXDSR1.Bits.DB3
#define CAN0RXDSR1_DB4 _CAN0RXDSR1.Bits.DB4
#define CAN0RXDSR1_DB5 _CAN0RXDSR1.Bits.DB5
#define CAN0RXDSR1_DB6 _CAN0RXDSR1.Bits.DB6
#define CAN0RXDSR1_DB7 _CAN0RXDSR1.Bits.DB7
#define CAN0RXDSR1_DB _CAN0RXDSR1.MergedBits.grpDB

#define CAN0RXDSR1_DB0_MASK   1
#define CAN0RXDSR1_DB1_MASK   2
#define CAN0RXDSR1_DB2_MASK   4
#define CAN0RXDSR1_DB3_MASK   8
#define CAN0RXDSR1_DB4_MASK   16
#define CAN0RXDSR1_DB5_MASK   32
#define CAN0RXDSR1_DB6_MASK   64
#define CAN0RXDSR1_DB7_MASK   128
#define CAN0RXDSR1_DB_MASK  255
#define CAN0RXDSR1_DB_BITNUM  0


/*** CAN0RXDSR2 - MSCAN 0 Receive Data Segment Register 2; 0x00000166 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN0RXDSR2STR;
extern volatile CAN0RXDSR2STR _CAN0RXDSR2 @(REG_BASE + 0x00000166);
#define CAN0RXDSR2 _CAN0RXDSR2.Byte
#define CAN0RXDSR2_DB0 _CAN0RXDSR2.Bits.DB0
#define CAN0RXDSR2_DB1 _CAN0RXDSR2.Bits.DB1
#define CAN0RXDSR2_DB2 _CAN0RXDSR2.Bits.DB2
#define CAN0RXDSR2_DB3 _CAN0RXDSR2.Bits.DB3
#define CAN0RXDSR2_DB4 _CAN0RXDSR2.Bits.DB4
#define CAN0RXDSR2_DB5 _CAN0RXDSR2.Bits.DB5
#define CAN0RXDSR2_DB6 _CAN0RXDSR2.Bits.DB6
#define CAN0RXDSR2_DB7 _CAN0RXDSR2.Bits.DB7
#define CAN0RXDSR2_DB _CAN0RXDSR2.MergedBits.grpDB

#define CAN0RXDSR2_DB0_MASK   1
#define CAN0RXDSR2_DB1_MASK   2
#define CAN0RXDSR2_DB2_MASK   4
#define CAN0RXDSR2_DB3_MASK   8
#define CAN0RXDSR2_DB4_MASK   16
#define CAN0RXDSR2_DB5_MASK   32
#define CAN0RXDSR2_DB6_MASK   64
#define CAN0RXDSR2_DB7_MASK   128
#define CAN0RXDSR2_DB_MASK  255
#define CAN0RXDSR2_DB_BITNUM  0


/*** CAN0RXDSR3 - MSCAN 0 Receive Data Segment Register 3; 0x00000167 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN0RXDSR3STR;
extern volatile CAN0RXDSR3STR _CAN0RXDSR3 @(REG_BASE + 0x00000167);
#define CAN0RXDSR3 _CAN0RXDSR3.Byte
#define CAN0RXDSR3_DB0 _CAN0RXDSR3.Bits.DB0
#define CAN0RXDSR3_DB1 _CAN0RXDSR3.Bits.DB1
#define CAN0RXDSR3_DB2 _CAN0RXDSR3.Bits.DB2
#define CAN0RXDSR3_DB3 _CAN0RXDSR3.Bits.DB3
#define CAN0RXDSR3_DB4 _CAN0RXDSR3.Bits.DB4
#define CAN0RXDSR3_DB5 _CAN0RXDSR3.Bits.DB5
#define CAN0RXDSR3_DB6 _CAN0RXDSR3.Bits.DB6
#define CAN0RXDSR3_DB7 _CAN0RXDSR3.Bits.DB7
#define CAN0RXDSR3_DB _CAN0RXDSR3.MergedBits.grpDB

#define CAN0RXDSR3_DB0_MASK   1
#define CAN0RXDSR3_DB1_MASK   2
#define CAN0RXDSR3_DB2_MASK   4
#define CAN0RXDSR3_DB3_MASK   8
#define CAN0RXDSR3_DB4_MASK   16
#define CAN0RXDSR3_DB5_MASK   32
#define CAN0RXDSR3_DB6_MASK   64
#define CAN0RXDSR3_DB7_MASK   128
#define CAN0RXDSR3_DB_MASK  255
#define CAN0RXDSR3_DB_BITNUM  0


/*** CAN0RXDSR4 - MSCAN 0 Receive Data Segment Register 4; 0x00000168 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN0RXDSR4STR;
extern volatile CAN0RXDSR4STR _CAN0RXDSR4 @(REG_BASE + 0x00000168);
#define CAN0RXDSR4 _CAN0RXDSR4.Byte
#define CAN0RXDSR4_DB0 _CAN0RXDSR4.Bits.DB0
#define CAN0RXDSR4_DB1 _CAN0RXDSR4.Bits.DB1
#define CAN0RXDSR4_DB2 _CAN0RXDSR4.Bits.DB2
#define CAN0RXDSR4_DB3 _CAN0RXDSR4.Bits.DB3
#define CAN0RXDSR4_DB4 _CAN0RXDSR4.Bits.DB4
#define CAN0RXDSR4_DB5 _CAN0RXDSR4.Bits.DB5
#define CAN0RXDSR4_DB6 _CAN0RXDSR4.Bits.DB6
#define CAN0RXDSR4_DB7 _CAN0RXDSR4.Bits.DB7
#define CAN0RXDSR4_DB _CAN0RXDSR4.MergedBits.grpDB

#define CAN0RXDSR4_DB0_MASK   1
#define CAN0RXDSR4_DB1_MASK   2
#define CAN0RXDSR4_DB2_MASK   4
#define CAN0RXDSR4_DB3_MASK   8
#define CAN0RXDSR4_DB4_MASK   16
#define CAN0RXDSR4_DB5_MASK   32
#define CAN0RXDSR4_DB6_MASK   64
#define CAN0RXDSR4_DB7_MASK   128
#define CAN0RXDSR4_DB_MASK  255
#define CAN0RXDSR4_DB_BITNUM  0


/*** CAN0RXDSR5 - MSCAN 0 Receive Data Segment Register 5; 0x00000169 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN0RXDSR5STR;
