frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
/*** CAN0TXDSR1 - MSCAN 0 Transmit Data Segment Register 1; 0x00000175 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN0TXDSR1STR;
extern volatile CAN0TXDSR1STR _CAN0TXDSR1 @(REG_BASE + 0x00000175);
#define CAN0TXDSR1 _CAN0TXDSR1.Byte
#define CAN0TXDSR1_DB0 _CAN0TXDSR1.Bits.DB0
#define CAN0TXDSR1_DB1 _CAN0TXDSR1.Bits.DB1
#define CAN0TXDSR1_DB2 _CAN0TXDSR1.Bits.DB2
#define CAN0TXDSR1_DB3 _CAN0TXDSR1.Bits.DB3
#define CAN0TXDSR1_DB4 _CAN0TXDSR1.Bits.DB4
#define CAN0TXDSR1_DB5 _CAN0TXDSR1.Bits.DB5
#define CAN0TXDSR1_DB6 _CAN0TXDSR1.Bits.DB6
#define CAN0TXDSR1_DB7 _CAN0TXDSR1.Bits.DB7
#define CAN0TXDSR1_DB _CAN0TXDSR1.MergedBits.grpDB

#define CAN0TXDSR1_DB0_MASK   1
#define CAN0TXDSR1_DB1_MASK   2
#define CAN0TXDSR1_DB2_MASK   4
#define CAN0TXDSR1_DB3_MASK   8
#define CAN0TXDSR1_DB4_MASK   16
#define CAN0TXDSR1_DB5_MASK   32
#define CAN0TXDSR1_DB6_MASK   64
#define CAN0TXDSR1_DB7_MASK   128
#define CAN0TXDSR1_DB_MASK  255
#define CAN0TXDSR1_DB_BITNUM  0


/*** CAN0TXDSR2 - MSCAN 0 Transmit Data Segment Register 2; 0x00000176 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN0TXDSR2STR;
extern volatile CAN0TXDSR2STR _CAN0TXDSR2 @(REG_BASE + 0x00000176);
#define CAN0TXDSR2 _CAN0TXDSR2.Byte
#define CAN0TXDSR2_DB0 _CAN0TXDSR2.Bits.DB0
#define CAN0TXDSR2_DB1 _CAN0TXDSR2.Bits.DB1
#define CAN0TXDSR2_DB2 _CAN0TXDSR2.Bits.DB2
#define CAN0TXDSR2_DB3 _CAN0TXDSR2.Bits.DB3
#define CAN0TXDSR2_DB4 _CAN0TXDSR2.Bits.DB4
#define CAN0TXDSR2_DB5 _CAN0TXDSR2.Bits.DB5
#define CAN0TXDSR2_DB6 _CAN0TXDSR2.Bits.DB6
#define CAN0TXDSR2_DB7 _CAN0TXDSR2.Bits.DB7
#define CAN0TXDSR2_DB _CAN0TXDSR2.MergedBits.grpDB

#define CAN0TXDSR2_DB0_MASK   1
#define CAN0TXDSR2_DB1_MASK   2
#define CAN0TXDSR2_DB2_MASK   4
#define CAN0TXDSR2_DB3_MASK   8
#define CAN0TXDSR2_DB4_MASK   16
#define CAN0TXDSR2_DB5_MASK   32
#define CAN0TXDSR2_DB6_MASK   64
#define CAN0TXDSR2_DB7_MASK   128
#define CAN0TXDSR2_DB_MASK  255
#define CAN0TXDSR2_DB_BITNUM  0


/*** CAN0TXDSR3 - MSCAN 0 Transmit Data Segment Register 3; 0x00000177 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN0TXDSR3STR;
extern volatile CAN0TXDSR3STR _CAN0TXDSR3 @(REG_BASE + 0x00000177);
#define CAN0TXDSR3 _CAN0TXDSR3.Byte
#define CAN0TXDSR3_DB0 _CAN0TXDSR3.Bits.DB0
#define CAN0TXDSR3_DB1 _CAN0TXDSR3.Bits.DB1
#define CAN0TXDSR3_DB2 _CAN0TXDSR3.Bits.DB2
#define CAN0TXDSR3_DB3 _CAN0TXDSR3.Bits.DB3
#define CAN0TXDSR3_DB4 _CAN0TXDSR3.Bits.DB4
#define CAN0TXDSR3_DB5 _CAN0TXDSR3.Bits.DB5
#define CAN0TXDSR3_DB6 _CAN0TXDSR3.Bits.DB6
#define CAN0TXDSR3_DB7 _CAN0TXDSR3.Bits.DB7
#define CAN0TXDSR3_DB _CAN0TXDSR3.MergedBits.grpDB

#define CAN0TXDSR3_DB0_MASK   1
#define CAN0TXDSR3_DB1_MASK   2
#define CAN0TXDSR3_DB2_MASK   4
#define CAN0TXDSR3_DB3_MASK   8
#define CAN0TXDSR3_DB4_MASK   16
#define CAN0TXDSR3_DB5_MASK   32
#define CAN0TXDSR3_DB6_MASK   64
#define CAN0TXDSR3_DB7_MASK   128
#define CAN0TXDSR3_DB_MASK  255
#define CAN0TXDSR3_DB_BITNUM  0


/*** CAN0TXDSR4 - MSCAN 0 Transmit Data Segment Register 4; 0x00000178 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN0TXDSR4STR;
extern volatile CAN0TXDSR4STR _CAN0TXDSR4 @(REG_BASE + 0x00000178);
#define CAN0TXDSR4 _CAN0TXDSR4.Byte
#define CAN0TXDSR4_DB0 _CAN0TXDSR4.Bits.DB0
#define CAN0TXDSR4_DB1 _CAN0TXDSR4.Bits.DB1
#define CAN0TXDSR4_DB2 _CAN0TXDSR4.Bits.DB2
#define CAN0TXDSR4_DB3 _CAN0TXDSR4.Bits.DB3
#define CAN0TXDSR4_DB4 _CAN0TXDSR4.Bits.DB4
#define CAN0TXDSR4_DB5 _CAN0TXDSR4.Bits.DB5
#define CAN0TXDSR4_DB6 _CAN0TXDSR4.Bits.DB6
#define CAN0TXDSR4_DB7 _CAN0TXDSR4.Bits.DB7
#define CAN0TXDSR4_DB _CAN0TXDSR4.MergedBits.grpDB

#define CAN0TXDSR4_DB0_MASK   1
#define CAN0TXDSR4_DB1_MASK   2
#define CAN0TXDSR4_DB2_MASK   4
#define CAN0TXDSR4_DB3_MASK   8
#define CAN0TXDSR4_DB4_MASK   16
#define CAN0TXDSR4_DB5_MASK   32
#define CAN0TXDSR4_DB6_MASK   64
#define CAN0TXDSR4_DB7_MASK   128
#define CAN0TXDSR4_DB_MASK  255
#define CAN0TXDSR4_DB_BITNUM  0


