frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
/*** CAN0TXDSR5 - MSCAN 0 Transmit Data Segment Register 5; 0x00000179 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN0TXDSR5STR;
extern volatile CAN0TXDSR5STR _CAN0TXDSR5 @(REG_BASE + 0x00000179);
#define CAN0TXDSR5 _CAN0TXDSR5.Byte
#define CAN0TXDSR5_DB0 _CAN0TXDSR5.Bits.DB0
#define CAN0TXDSR5_DB1 _CAN0TXDSR5.Bits.DB1
#define CAN0TXDSR5_DB2 _CAN0TXDSR5.Bits.DB2
#define CAN0TXDSR5_DB3 _CAN0TXDSR5.Bits.DB3
#define CAN0TXDSR5_DB4 _CAN0TXDSR5.Bits.DB4
#define CAN0TXDSR5_DB5 _CAN0TXDSR5.Bits.DB5
#define CAN0TXDSR5_DB6 _CAN0TXDSR5.Bits.DB6
#define CAN0TXDSR5_DB7 _CAN0TXDSR5.Bits.DB7
#define CAN0TXDSR5_DB _CAN0TXDSR5.MergedBits.grpDB

#define CAN0TXDSR5_DB0_MASK   1
#define CAN0TXDSR5_DB1_MASK   2
#define CAN0TXDSR5_DB2_MASK   4
#define CAN0TXDSR5_DB3_MASK   8
#define CAN0TXDSR5_DB4_MASK   16
#define CAN0TXDSR5_DB5_MASK   32
#define CAN0TXDSR5_DB6_MASK   64
#define CAN0TXDSR5_DB7_MASK   128
#define CAN0TXDSR5_DB_MASK  255
#define CAN0TXDSR5_DB_BITNUM  0


/*** CAN0TXDSR6 - MSCAN 0 Transmit Data Segment Register 6; 0x0000017A ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN0TXDSR6STR;
extern volatile CAN0TXDSR6STR _CAN0TXDSR6 @(REG_BASE + 0x0000017A);
#define CAN0TXDSR6 _CAN0TXDSR6.Byte
#define CAN0TXDSR6_DB0 _CAN0TXDSR6.Bits.DB0
#define CAN0TXDSR6_DB1 _CAN0TXDSR6.Bits.DB1
#define CAN0TXDSR6_DB2 _CAN0TXDSR6.Bits.DB2
#define CAN0TXDSR6_DB3 _CAN0TXDSR6.Bits.DB3
#define CAN0TXDSR6_DB4 _CAN0TXDSR6.Bits.DB4
#define CAN0TXDSR6_DB5 _CAN0TXDSR6.Bits.DB5
#define CAN0TXDSR6_DB6 _CAN0TXDSR6.Bits.DB6
#define CAN0TXDSR6_DB7 _CAN0TXDSR6.Bits.DB7
#define CAN0TXDSR6_DB _CAN0TXDSR6.MergedBits.grpDB

#define CAN0TXDSR6_DB0_MASK   1
#define CAN0TXDSR6_DB1_MASK   2
#define CAN0TXDSR6_DB2_MASK   4
#define CAN0TXDSR6_DB3_MASK   8
#define CAN0TXDSR6_DB4_MASK   16
#define CAN0TXDSR6_DB5_MASK   32
#define CAN0TXDSR6_DB6_MASK   64
#define CAN0TXDSR6_DB7_MASK   128
#define CAN0TXDSR6_DB_MASK  255
#define CAN0TXDSR6_DB_BITNUM  0


/*** CAN0TXDSR7 - MSCAN 0 Transmit Data Segment Register 7; 0x0000017B ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN0TXDSR7STR;
extern volatile CAN0TXDSR7STR _CAN0TXDSR7 @(REG_BASE + 0x0000017B);
#define CAN0TXDSR7 _CAN0TXDSR7.Byte
#define CAN0TXDSR7_DB0 _CAN0TXDSR7.Bits.DB0
#define CAN0TXDSR7_DB1 _CAN0TXDSR7.Bits.DB1
#define CAN0TXDSR7_DB2 _CAN0TXDSR7.Bits.DB2
#define CAN0TXDSR7_DB3 _CAN0TXDSR7.Bits.DB3
#define CAN0TXDSR7_DB4 _CAN0TXDSR7.Bits.DB4
#define CAN0TXDSR7_DB5 _CAN0TXDSR7.Bits.DB5
#define CAN0TXDSR7_DB6 _CAN0TXDSR7.Bits.DB6
#define CAN0TXDSR7_DB7 _CAN0TXDSR7.Bits.DB7
#define CAN0TXDSR7_DB _CAN0TXDSR7.MergedBits.grpDB

#define CAN0TXDSR7_DB0_MASK   1
#define CAN0TXDSR7_DB1_MASK   2
#define CAN0TXDSR7_DB2_MASK   4
#define CAN0TXDSR7_DB3_MASK   8
#define CAN0TXDSR7_DB4_MASK   16
#define CAN0TXDSR7_DB5_MASK   32
#define CAN0TXDSR7_DB6_MASK   64
#define CAN0TXDSR7_DB7_MASK   128
#define CAN0TXDSR7_DB_MASK  255
#define CAN0TXDSR7_DB_BITNUM  0


/*** CAN0TXDLR - MSCAN 0 Transmit Data Length Register; 0x0000017C ***/
typedef union {
  byte Byte;
  struct {
    byte DLC0        :1;                                       /* Data Length Code Bit 0 */
    byte DLC1        :1;                                       /* Data Length Code Bit 1 */
    byte DLC2        :1;                                       /* Data Length Code Bit 2 */
    byte DLC3        :1;                                       /* Data Length Code Bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpDLC  :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN0TXDLRSTR;
extern volatile CAN0TXDLRSTR _CAN0TXDLR @(REG_BASE + 0x0000017C);
#define CAN0TXDLR _CAN0TXDLR.Byte
#define CAN0TXDLR_DLC0 _CAN0TXDLR.Bits.DLC0
#define CAN0TXDLR_DLC1 _CAN0TXDLR.Bits.DLC1
#define CAN0TXDLR_DLC2 _CAN0TXDLR.Bits.DLC2
#define CAN0TXDLR_DLC3 _CAN0TXDLR.Bits.DLC3
#define CAN0TXDLR_DLC _CAN0TXDLR.MergedBits.grpDLC

#define CAN0TXDLR_DLC0_MASK   1
#define CAN0TXDLR_DLC1_MASK   2
#define CAN0TXDLR_DLC2_MASK   4
#define CAN0TXDLR_DLC3_MASK   8
#define CAN0TXDLR_DLC_MASK  15
#define CAN0TXDLR_DLC_BITNUM  0


