frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
  struct {
    word TSR0        :1;                                       /* Time Stamp Bit 0 */
    word TSR1        :1;                                       /* Time Stamp Bit 1 */
    word TSR2        :1;                                       /* Time Stamp Bit 2 */
    word TSR3        :1;                                       /* Time Stamp Bit 3 */
    word TSR4        :1;                                       /* Time Stamp Bit 4 */
    word TSR5        :1;                                       /* Time Stamp Bit 5 */
    word TSR6        :1;                                       /* Time Stamp Bit 6 */
    word TSR7        :1;                                       /* Time Stamp Bit 7 */
    word TSR8        :1;                                       /* Time Stamp Bit 8 */
    word TSR9        :1;                                       /* Time Stamp Bit 9 */
    word TSR10       :1;                                       /* Time Stamp Bit 10 */
    word TSR11       :1;                                       /* Time Stamp Bit 11 */
    word TSR12       :1;                                       /* Time Stamp Bit 12 */
    word TSR13       :1;                                       /* Time Stamp Bit 13 */
    word TSR14       :1;                                       /* Time Stamp Bit 14 */
    word TSR15       :1;                                       /* Time Stamp Bit 15 */
  } Bits;
  struct {
    word grpTSR  :16;
  } MergedBits;
} CAN0TXTSRSTR;
extern volatile CAN0TXTSRSTR _CAN0TXTSR @(REG_BASE + 0x0000017E);
#define CAN0TXTSR _CAN0TXTSR.Word
#define CAN0TXTSR_TSR0 _CAN0TXTSR.Bits.TSR0
#define CAN0TXTSR_TSR1 _CAN0TXTSR.Bits.TSR1
#define CAN0TXTSR_TSR2 _CAN0TXTSR.Bits.TSR2
#define CAN0TXTSR_TSR3 _CAN0TXTSR.Bits.TSR3
#define CAN0TXTSR_TSR4 _CAN0TXTSR.Bits.TSR4
#define CAN0TXTSR_TSR5 _CAN0TXTSR.Bits.TSR5
#define CAN0TXTSR_TSR6 _CAN0TXTSR.Bits.TSR6
#define CAN0TXTSR_TSR7 _CAN0TXTSR.Bits.TSR7
#define CAN0TXTSR_TSR8 _CAN0TXTSR.Bits.TSR8
#define CAN0TXTSR_TSR9 _CAN0TXTSR.Bits.TSR9
#define CAN0TXTSR_TSR10 _CAN0TXTSR.Bits.TSR10
#define CAN0TXTSR_TSR11 _CAN0TXTSR.Bits.TSR11
#define CAN0TXTSR_TSR12 _CAN0TXTSR.Bits.TSR12
#define CAN0TXTSR_TSR13 _CAN0TXTSR.Bits.TSR13
#define CAN0TXTSR_TSR14 _CAN0TXTSR.Bits.TSR14
#define CAN0TXTSR_TSR15 _CAN0TXTSR.Bits.TSR15
#define CAN0TXTSR_TSR _CAN0TXTSR.MergedBits.grpTSR

#define CAN0TXTSR_TSR0_MASK   1
#define CAN0TXTSR_TSR1_MASK   2
#define CAN0TXTSR_TSR2_MASK   4
#define CAN0TXTSR_TSR3_MASK   8
#define CAN0TXTSR_TSR4_MASK   16
#define CAN0TXTSR_TSR5_MASK   32
#define CAN0TXTSR_TSR6_MASK   64
#define CAN0TXTSR_TSR7_MASK   128
#define CAN0TXTSR_TSR8_MASK   256
#define CAN0TXTSR_TSR9_MASK   512
#define CAN0TXTSR_TSR10_MASK   1024
#define CAN0TXTSR_TSR11_MASK   2048
#define CAN0TXTSR_TSR12_MASK   4096
#define CAN0TXTSR_TSR13_MASK   8192
#define CAN0TXTSR_TSR14_MASK   16384
#define CAN0TXTSR_TSR15_MASK   32768
#define CAN0TXTSR_TSR_MASK  65535
#define CAN0TXTSR_TSR_BITNUM  0


/*** CAN1CTL0 - MSCAN 1 Control 0 Register; 0x00000180 ***/
typedef union {
  byte Byte;
  struct {
    byte INITRQ      :1;                                       /* Initialization Mode Request */
    byte SLPRQ       :1;                                       /* Sleep Mode Request */
    byte WUPE        :1;                                       /* Wake-Up Enable */
    byte TIME        :1;                                       /* Timer Enable */
    byte SYNCH       :1;                                       /* Synchronized Status */
    byte CSWAI       :1;                                       /* CAN Stops in Wait Mode */
    byte RXACT       :1;                                       /* Receiver Active Status */
    byte RXFRM       :1;                                       /* Received Frame Flag */
  } Bits;
} CAN1CTL0STR;
extern volatile CAN1CTL0STR _CAN1CTL0 @(REG_BASE + 0x00000180);
#define CAN1CTL0 _CAN1CTL0.Byte
#define CAN1CTL0_INITRQ _CAN1CTL0.Bits.INITRQ
#define CAN1CTL0_SLPRQ _CAN1CTL0.Bits.SLPRQ
#define CAN1CTL0_WUPE _CAN1CTL0.Bits.WUPE
#define CAN1CTL0_TIME _CAN1CTL0.Bits.TIME
#define CAN1CTL0_SYNCH _CAN1CTL0.Bits.SYNCH
#define CAN1CTL0_CSWAI _CAN1CTL0.Bits.CSWAI
#define CAN1CTL0_RXACT _CAN1CTL0.Bits.RXACT
#define CAN1CTL0_RXFRM _CAN1CTL0.Bits.RXFRM
/* CAN1CTL_ARR: Access 2 CAN1CTLx registers in a array */
#define CAN1CTL_ARR ((Byte *) &CAN1CTL0)

#define CAN1CTL0_INITRQ_MASK   1
#define CAN1CTL0_SLPRQ_MASK   2
#define CAN1CTL0_WUPE_MASK   4
#define CAN1CTL0_TIME_MASK   8
#define CAN1CTL0_SYNCH_MASK   16
#define CAN1CTL0_CSWAI_MASK   32
#define CAN1CTL0_RXACT_MASK   64
#define CAN1CTL0_RXFRM_MASK   128


/*** CAN1CTL1 - MSCAN 1 Control 1 Register; 0x00000181 ***/
typedef union {
  byte Byte;
  struct {
    byte INITAK      :1;                                       /* Initialization Mode Acknowledge */
    byte SLPAK       :1;                                       /* Sleep Mode Acknowledge */
    byte WUPM        :1;                                       /* Wake-Up Mode */
    byte BORM        :1;                                       /* Bus-Off Recovery Mode */
    byte LISTEN      :1;                                       /* Listen Only Mode */
    byte LOOPB       :1;                                       /* Loop Back Self Test Mode */
    byte CLKSRC      :1;                                       /* MSCAN 1 Clock Source */
    byte CANE        :1;                                       /* MSCAN 1 Enable */
  } Bits;
} CAN1CTL1STR;
extern volatile CAN1CTL1STR _CAN1CTL1 @(REG_BASE + 0x00000181);
#define CAN1CTL1 _CAN1CTL1.Byte
#define CAN1CTL1_INITAK _CAN1CTL1.Bits.INITAK
#define CAN1CTL1_SLPAK _CAN1CTL1.Bits.SLPAK
#define CAN1CTL1_WUPM _CAN1CTL1.Bits.WUPM
#define CAN1CTL1_BORM _CAN1CTL1.Bits.BORM
#define CAN1CTL1_LISTEN _CAN1CTL1.Bits.LISTEN
#define CAN1CTL1_LOOPB _CAN1CTL1.Bits.LOOPB
#define CAN1CTL1_CLKSRC _CAN1CTL1.Bits.CLKSRC
#define CAN1CTL1_CANE _CAN1CTL1.Bits.CANE

#define CAN1CTL1_INITAK_MASK   1
#define CAN1CTL1_SLPAK_MASK   2
#define CAN1CTL1_WUPM_MASK   4
#define CAN1CTL1_BORM_MASK   8
#define CAN1CTL1_LISTEN_MASK   16
#define CAN1CTL1_LOOPB_MASK   32
#define CAN1CTL1_CLKSRC_MASK   64
#define CAN1CTL1_CANE_MASK   128


/*** CAN1BTR0 - MSCAN 1 Bus Timing Register 0; 0x00000182 ***/
typedef union {
  byte Byte;
  struct {
    byte BRP0        :1;                                       /* Baud Rate Prescaler 0 */
    byte BRP1        :1;                                       /* Baud Rate Prescaler 1 */
    byte BRP2        :1;                                       /* Baud Rate Prescaler 2 */
    byte BRP3        :1;                                       /* Baud Rate Prescaler 3 */
    byte BRP4        :1;                                       /* Baud Rate Prescaler 4 */
    byte BRP5        :1;                                       /* Baud Rate Prescaler 5 */
    byte SJW0        :1;                                       /* Synchronization Jump Width 0 */
    byte SJW1        :1;                                       /* Synchronization Jump Width 1 */
  } Bits;
  struct {
    byte grpBRP  :6;
    byte grpSJW  :2;
  } MergedBits;
} CAN1BTR0STR;
extern volatile CAN1BTR0STR _CAN1BTR0 @(REG_BASE + 0x00000182);
#define CAN1BTR0 _CAN1BTR0.Byte
#define CAN1BTR0_BRP0 _CAN1BTR0.Bits.BRP0
#define CAN1BTR0_BRP1 _CAN1BTR0.Bits.BRP1
#define CAN1BTR0_BRP2 _CAN1BTR0.Bits.BRP2
#define CAN1BTR0_BRP3 _CAN1BTR0.Bits.BRP3
#define CAN1BTR0_BRP4 _CAN1BTR0.Bits.BRP4
#define CAN1BTR0_BRP5 _CAN1BTR0.Bits.BRP5
#define CAN1BTR0_SJW0 _CAN1BTR0.Bits.SJW0
#define CAN1BTR0_SJW1 _CAN1BTR0.Bits.SJW1
/* CAN1BTR_ARR: Access 2 CAN1BTRx registers in a array */
#define CAN1BTR_ARR ((Byte *) &CAN1BTR0)
#define CAN1BTR0_BRP _CAN1BTR0.MergedBits.grpBRP
#define CAN1BTR0_SJW _CAN1BTR0.MergedBits.grpSJW

#define CAN1BTR0_BRP0_MASK   1
#define CAN1BTR0_BRP1_MASK   2
#define CAN1BTR0_BRP2_MASK   4
#define CAN1BTR0_BRP3_MASK   8
#define CAN1BTR0_BRP4_MASK   16
#define CAN1BTR0_BRP5_MASK   32
#define CAN1BTR0_SJW0_MASK   64
#define CAN1BTR0_SJW1_MASK   128
#define CAN1BTR0_BRP_MASK  63
#define CAN1BTR0_BRP_BITNUM  0
#define CAN1BTR0_SJW_MASK  192
#define CAN1BTR0_SJW_BITNUM  6


/*** CAN1BTR1 - MSCAN 1 Bus Timing Register 1; 0x00000183 ***/
typedef union {
  byte Byte;
  struct {
    byte TSEG10      :1;                                       /* Time Segment 10 */
    byte TSEG11      :1;                                       /* Time Segment 11 */
    byte TSEG12      :1;                                       /* Time Segment 12 */
    byte TSEG13      :1;                                       /* Time Segment 13 */
    byte TSEG20      :1;                                       /* Time Segment 20 */
    byte TSEG21      :1;                                       /* Time Segment 21 */
    byte TSEG22      :1;                                       /* Time Segment 22 */
    byte SAMP        :1;                                       /* Sampling */
  } Bits;
  struct {
    byte grpTSEG_10 :4;
    byte grpTSEG_20 :3;
    byte         :1;
  } MergedBits;
} CAN1BTR1STR;
