frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
#define CAN1TIER_TXEIE0_MASK   1
#define CAN1TIER_TXEIE1_MASK   2
#define CAN1TIER_TXEIE2_MASK   4
#define CAN1TIER_TXEIE_MASK  7
#define CAN1TIER_TXEIE_BITNUM  0


/*** CAN1TARQ - MSCAN 1 Transmitter Message Abort Request; 0x00000188 ***/
typedef union {
  byte Byte;
  struct {
    byte ABTRQ0      :1;                                       /* Abort Request 0 */
    byte ABTRQ1      :1;                                       /* Abort Request 1 */
    byte ABTRQ2      :1;                                       /* Abort Request 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpABTRQ :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN1TARQSTR;
extern volatile CAN1TARQSTR _CAN1TARQ @(REG_BASE + 0x00000188);
#define CAN1TARQ _CAN1TARQ.Byte
#define CAN1TARQ_ABTRQ0 _CAN1TARQ.Bits.ABTRQ0
#define CAN1TARQ_ABTRQ1 _CAN1TARQ.Bits.ABTRQ1
#define CAN1TARQ_ABTRQ2 _CAN1TARQ.Bits.ABTRQ2
#define CAN1TARQ_ABTRQ _CAN1TARQ.MergedBits.grpABTRQ

#define CAN1TARQ_ABTRQ0_MASK   1
#define CAN1TARQ_ABTRQ1_MASK   2
#define CAN1TARQ_ABTRQ2_MASK   4
#define CAN1TARQ_ABTRQ_MASK  7
#define CAN1TARQ_ABTRQ_BITNUM  0


/*** CAN1TAAK - MSCAN 1 Transmitter Message Abort Control; 0x00000189 ***/
typedef union {
  byte Byte;
  struct {
    byte ABTAK0      :1;                                       /* Abort Acknowledge 0 */
    byte ABTAK1      :1;                                       /* Abort Acknowledge 1 */
    byte ABTAK2      :1;                                       /* Abort Acknowledge 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpABTAK :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN1TAAKSTR;
extern volatile CAN1TAAKSTR _CAN1TAAK @(REG_BASE + 0x00000189);
#define CAN1TAAK _CAN1TAAK.Byte
#define CAN1TAAK_ABTAK0 _CAN1TAAK.Bits.ABTAK0
#define CAN1TAAK_ABTAK1 _CAN1TAAK.Bits.ABTAK1
#define CAN1TAAK_ABTAK2 _CAN1TAAK.Bits.ABTAK2
#define CAN1TAAK_ABTAK _CAN1TAAK.MergedBits.grpABTAK

#define CAN1TAAK_ABTAK0_MASK   1
#define CAN1TAAK_ABTAK1_MASK   2
#define CAN1TAAK_ABTAK2_MASK   4
#define CAN1TAAK_ABTAK_MASK  7
#define CAN1TAAK_ABTAK_BITNUM  0


/*** CAN1TBSEL - MSCAN 1 Transmit Buffer Selection; 0x0000018A ***/
typedef union {
  byte Byte;
  struct {
    byte TX0         :1;                                       /* Transmit Buffer Select 0 */
    byte TX1         :1;                                       /* Transmit Buffer Select 1 */
    byte TX2         :1;                                       /* Transmit Buffer Select 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpTX   :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN1TBSELSTR;
extern volatile CAN1TBSELSTR _CAN1TBSEL @(REG_BASE + 0x0000018A);
#define CAN1TBSEL _CAN1TBSEL.Byte
#define CAN1TBSEL_TX0 _CAN1TBSEL.Bits.TX0
#define CAN1TBSEL_TX1 _CAN1TBSEL.Bits.TX1
#define CAN1TBSEL_TX2 _CAN1TBSEL.Bits.TX2
#define CAN1TBSEL_TX _CAN1TBSEL.MergedBits.grpTX

#define CAN1TBSEL_TX0_MASK   1
#define CAN1TBSEL_TX1_MASK   2
#define CAN1TBSEL_TX2_MASK   4
#define CAN1TBSEL_TX_MASK  7
#define CAN1TBSEL_TX_BITNUM  0


/*** CAN1IDAC - MSCAN 1 Identifier Acceptance Control Register; 0x0000018B ***/
typedef union {
  byte Byte;
  struct {
    byte IDHIT0      :1;                                       /* Identifier Acceptance Hit Indicator 0 */
    byte IDHIT1      :1;                                       /* Identifier Acceptance Hit Indicator 1 */
    byte IDHIT2      :1;                                       /* Identifier Acceptance Hit Indicator 2 */
    byte             :1; 
    byte IDAM0       :1;                                       /* Identifier Acceptance Mode 0 */
    byte IDAM1       :1;                                       /* Identifier Acceptance Mode 1 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpIDHIT :3;
    byte         :1;
    byte grpIDAM :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN1IDACSTR;
extern volatile CAN1IDACSTR _CAN1IDAC @(REG_BASE + 0x0000018B);
#define CAN1IDAC _CAN1IDAC.Byte
#define CAN1IDAC_IDHIT0 _CAN1IDAC.Bits.IDHIT0
#define CAN1IDAC_IDHIT1 _CAN1IDAC.Bits.IDHIT1
#define CAN1IDAC_IDHIT2 _CAN1IDAC.Bits.IDHIT2
#define CAN1IDAC_IDAM0 _CAN1IDAC.Bits.IDAM0
#define CAN1IDAC_IDAM1 _CAN1IDAC.Bits.IDAM1
#define CAN1IDAC_IDHIT _CAN1IDAC.MergedBits.grpIDHIT
#define CAN1IDAC_IDAM _CAN1IDAC.MergedBits.grpIDAM

#define CAN1IDAC_IDHIT0_MASK   1
#define CAN1IDAC_IDHIT1_MASK   2
#define CAN1IDAC_IDHIT2_MASK   4
#define CAN1IDAC_IDAM0_MASK   16
#define CAN1IDAC_IDAM1_MASK   32
#define CAN1IDAC_IDHIT_MASK  7
#define CAN1IDAC_IDHIT_BITNUM  0
#define CAN1IDAC_IDAM_MASK  48
#define CAN1IDAC_IDAM_BITNUM  4


/*** CAN1MISC - MSCAN 1 Miscellaneous Register; 0x0000018D ***/
typedef union {
  byte Byte;
  struct {
    byte BOHOLD      :1;                                       /* Bus-Off state Hold until user request */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} CAN1MISCSTR;
extern volatile CAN1MISCSTR _CAN1MISC @(REG_BASE + 0x0000018D);
#define CAN1MISC _CAN1MISC.Byte
#define CAN1MISC_BOHOLD _CAN1MISC.Bits.BOHOLD

#define CAN1MISC_BOHOLD_MASK   1


/*** CAN1RXERR - MSCAN 1 Receive Error Counter Register; 0x0000018E ***/
typedef union {
  byte Byte;
  struct {
    byte RXERR0      :1;                                       /* Bit 0 */
    byte RXERR1      :1;                                       /* Bit 1 */
    byte RXERR2      :1;                                       /* Bit 2 */
    byte RXERR3      :1;                                       /* Bit 3 */
    byte RXERR4      :1;                                       /* Bit 4 */
    byte RXERR5      :1;                                       /* Bit 5 */
    byte RXERR6      :1;                                       /* Bit 6 */
    byte RXERR7      :1;                                       /* Bit 7 */
  } Bits;
  struct {
    byte grpRXERR :8;
  } MergedBits;
} CAN1RXERRSTR;
extern volatile CAN1RXERRSTR _CAN1RXERR @(REG_BASE + 0x0000018E);
#define CAN1RXERR _CAN1RXERR.Byte
#define CAN1RXERR_RXERR0 _CAN1RXERR.Bits.RXERR0
#define CAN1RXERR_RXERR1 _CAN1RXERR.Bits.RXERR1
#define CAN1RXERR_RXERR2 _CAN1RXERR.Bits.RXERR2
#define CAN1RXERR_RXERR3 _CAN1RXERR.Bits.RXERR3
#define CAN1RXERR_RXERR4 _CAN1RXERR.Bits.RXERR4
#define CAN1RXERR_RXERR5 _CAN1RXERR.Bits.RXERR5
#define CAN1RXERR_RXERR6 _CAN1RXERR.Bits.RXERR6
#define CAN1RXERR_RXERR7 _CAN1RXERR.Bits.RXERR7
#define CAN1RXERR_RXERR _CAN1RXERR.MergedBits.grpRXERR

#define CAN1RXERR_RXERR0_MASK   1
#define CAN1RXERR_RXERR1_MASK   2
#define CAN1RXERR_RXERR2_MASK   4
#define CAN1RXERR_RXERR3_MASK   8
#define CAN1RXERR_RXERR4_MASK   16
#define CAN1RXERR_RXERR5_MASK   32
#define CAN1RXERR_RXERR6_MASK   64
#define CAN1RXERR_RXERR7_MASK   128
#define CAN1RXERR_RXERR_MASK  255
#define CAN1RXERR_RXERR_BITNUM  0


/*** CAN1TXERR - MSCAN 1 Transmit Error Counter Register; 0x0000018F ***/
typedef union {
  byte Byte;
  struct {
    byte TXERR0      :1;                                       /* Bit 0 */
    byte TXERR1      :1;                                       /* Bit 1 */
    byte TXERR2      :1;                                       /* Bit 2 */
    byte TXERR3      :1;                                       /* Bit 3 */
    byte TXERR4      :1;                                       /* Bit 4 */
    byte TXERR5      :1;                                       /* Bit 5 */
    byte TXERR6      :1;                                       /* Bit 6 */
    byte TXERR7      :1;                                       /* Bit 7 */
  } Bits;
  struct {
    byte grpTXERR :8;
  } MergedBits;
} CAN1TXERRSTR;
