frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
extern volatile CAN1TXERRSTR _CAN1TXERR @(REG_BASE + 0x0000018F);
#define CAN1TXERR _CAN1TXERR.Byte
#define CAN1TXERR_TXERR0 _CAN1TXERR.Bits.TXERR0
#define CAN1TXERR_TXERR1 _CAN1TXERR.Bits.TXERR1
#define CAN1TXERR_TXERR2 _CAN1TXERR.Bits.TXERR2
#define CAN1TXERR_TXERR3 _CAN1TXERR.Bits.TXERR3
#define CAN1TXERR_TXERR4 _CAN1TXERR.Bits.TXERR4
#define CAN1TXERR_TXERR5 _CAN1TXERR.Bits.TXERR5
#define CAN1TXERR_TXERR6 _CAN1TXERR.Bits.TXERR6
#define CAN1TXERR_TXERR7 _CAN1TXERR.Bits.TXERR7
#define CAN1TXERR_TXERR _CAN1TXERR.MergedBits.grpTXERR

#define CAN1TXERR_TXERR0_MASK   1
#define CAN1TXERR_TXERR1_MASK   2
#define CAN1TXERR_TXERR2_MASK   4
#define CAN1TXERR_TXERR3_MASK   8
#define CAN1TXERR_TXERR4_MASK   16
#define CAN1TXERR_TXERR5_MASK   32
#define CAN1TXERR_TXERR6_MASK   64
#define CAN1TXERR_TXERR7_MASK   128
#define CAN1TXERR_TXERR_MASK  255
#define CAN1TXERR_TXERR_BITNUM  0


/*** CAN1IDAR0 - MSCAN 1 Identifier Acceptance Register 0; 0x00000190 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
  struct {
    byte grpAC   :8;
  } MergedBits;
} CAN1IDAR0STR;
extern volatile CAN1IDAR0STR _CAN1IDAR0 @(REG_BASE + 0x00000190);
#define CAN1IDAR0 _CAN1IDAR0.Byte
#define CAN1IDAR0_AC0 _CAN1IDAR0.Bits.AC0
#define CAN1IDAR0_AC1 _CAN1IDAR0.Bits.AC1
#define CAN1IDAR0_AC2 _CAN1IDAR0.Bits.AC2
#define CAN1IDAR0_AC3 _CAN1IDAR0.Bits.AC3
#define CAN1IDAR0_AC4 _CAN1IDAR0.Bits.AC4
#define CAN1IDAR0_AC5 _CAN1IDAR0.Bits.AC5
#define CAN1IDAR0_AC6 _CAN1IDAR0.Bits.AC6
#define CAN1IDAR0_AC7 _CAN1IDAR0.Bits.AC7
/* CAN1IDAR_ARR: Access 4 CAN1IDARx registers in a array */
#define CAN1IDAR_ARR ((Byte *) &CAN1IDAR0)
#define CAN1IDAR0_AC _CAN1IDAR0.MergedBits.grpAC

#define CAN1IDAR0_AC0_MASK   1
#define CAN1IDAR0_AC1_MASK   2
#define CAN1IDAR0_AC2_MASK   4
#define CAN1IDAR0_AC3_MASK   8
#define CAN1IDAR0_AC4_MASK   16
#define CAN1IDAR0_AC5_MASK   32
#define CAN1IDAR0_AC6_MASK   64
#define CAN1IDAR0_AC7_MASK   128
#define CAN1IDAR0_AC_MASK  255
#define CAN1IDAR0_AC_BITNUM  0


/*** CAN1IDAR1 - MSCAN 1 Identifier Acceptance Register 1; 0x00000191 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
  struct {
    byte grpAC   :8;
  } MergedBits;
} CAN1IDAR1STR;
extern volatile CAN1IDAR1STR _CAN1IDAR1 @(REG_BASE + 0x00000191);
#define CAN1IDAR1 _CAN1IDAR1.Byte
#define CAN1IDAR1_AC0 _CAN1IDAR1.Bits.AC0
#define CAN1IDAR1_AC1 _CAN1IDAR1.Bits.AC1
#define CAN1IDAR1_AC2 _CAN1IDAR1.Bits.AC2
#define CAN1IDAR1_AC3 _CAN1IDAR1.Bits.AC3
#define CAN1IDAR1_AC4 _CAN1IDAR1.Bits.AC4
#define CAN1IDAR1_AC5 _CAN1IDAR1.Bits.AC5
#define CAN1IDAR1_AC6 _CAN1IDAR1.Bits.AC6
#define CAN1IDAR1_AC7 _CAN1IDAR1.Bits.AC7
#define CAN1IDAR1_AC _CAN1IDAR1.MergedBits.grpAC

#define CAN1IDAR1_AC0_MASK   1
#define CAN1IDAR1_AC1_MASK   2
#define CAN1IDAR1_AC2_MASK   4
#define CAN1IDAR1_AC3_MASK   8
#define CAN1IDAR1_AC4_MASK   16
#define CAN1IDAR1_AC5_MASK   32
#define CAN1IDAR1_AC6_MASK   64
#define CAN1IDAR1_AC7_MASK   128
#define CAN1IDAR1_AC_MASK  255
#define CAN1IDAR1_AC_BITNUM  0


/*** CAN1IDAR2 - MSCAN 1 Identifier Acceptance Register 2; 0x00000192 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
  struct {
    byte grpAC   :8;
  } MergedBits;
} CAN1IDAR2STR;
extern volatile CAN1IDAR2STR _CAN1IDAR2 @(REG_BASE + 0x00000192);
#define CAN1IDAR2 _CAN1IDAR2.Byte
#define CAN1IDAR2_AC0 _CAN1IDAR2.Bits.AC0
#define CAN1IDAR2_AC1 _CAN1IDAR2.Bits.AC1
#define CAN1IDAR2_AC2 _CAN1IDAR2.Bits.AC2
#define CAN1IDAR2_AC3 _CAN1IDAR2.Bits.AC3
#define CAN1IDAR2_AC4 _CAN1IDAR2.Bits.AC4
#define CAN1IDAR2_AC5 _CAN1IDAR2.Bits.AC5
#define CAN1IDAR2_AC6 _CAN1IDAR2.Bits.AC6
#define CAN1IDAR2_AC7 _CAN1IDAR2.Bits.AC7
#define CAN1IDAR2_AC _CAN1IDAR2.MergedBits.grpAC

#define CAN1IDAR2_AC0_MASK   1
#define CAN1IDAR2_AC1_MASK   2
#define CAN1IDAR2_AC2_MASK   4
#define CAN1IDAR2_AC3_MASK   8
#define CAN1IDAR2_AC4_MASK   16
#define CAN1IDAR2_AC5_MASK   32
#define CAN1IDAR2_AC6_MASK   64
#define CAN1IDAR2_AC7_MASK   128
#define CAN1IDAR2_AC_MASK  255
#define CAN1IDAR2_AC_BITNUM  0


