frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
/*** CAN1IDAR3 - MSCAN 1 Identifier Acceptance Register 3; 0x00000193 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
  struct {
    byte grpAC   :8;
  } MergedBits;
} CAN1IDAR3STR;
extern volatile CAN1IDAR3STR _CAN1IDAR3 @(REG_BASE + 0x00000193);
#define CAN1IDAR3 _CAN1IDAR3.Byte
#define CAN1IDAR3_AC0 _CAN1IDAR3.Bits.AC0
#define CAN1IDAR3_AC1 _CAN1IDAR3.Bits.AC1
#define CAN1IDAR3_AC2 _CAN1IDAR3.Bits.AC2
#define CAN1IDAR3_AC3 _CAN1IDAR3.Bits.AC3
#define CAN1IDAR3_AC4 _CAN1IDAR3.Bits.AC4
#define CAN1IDAR3_AC5 _CAN1IDAR3.Bits.AC5
#define CAN1IDAR3_AC6 _CAN1IDAR3.Bits.AC6
#define CAN1IDAR3_AC7 _CAN1IDAR3.Bits.AC7
#define CAN1IDAR3_AC _CAN1IDAR3.MergedBits.grpAC

#define CAN1IDAR3_AC0_MASK   1
#define CAN1IDAR3_AC1_MASK   2
#define CAN1IDAR3_AC2_MASK   4
#define CAN1IDAR3_AC3_MASK   8
#define CAN1IDAR3_AC4_MASK   16
#define CAN1IDAR3_AC5_MASK   32
#define CAN1IDAR3_AC6_MASK   64
#define CAN1IDAR3_AC7_MASK   128
#define CAN1IDAR3_AC_MASK  255
#define CAN1IDAR3_AC_BITNUM  0


/*** CAN1IDMR0 - MSCAN 1 Identifier Mask Register 0; 0x00000194 ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
  struct {
    byte grpAM   :8;
  } MergedBits;
} CAN1IDMR0STR;
extern volatile CAN1IDMR0STR _CAN1IDMR0 @(REG_BASE + 0x00000194);
#define CAN1IDMR0 _CAN1IDMR0.Byte
#define CAN1IDMR0_AM0 _CAN1IDMR0.Bits.AM0
#define CAN1IDMR0_AM1 _CAN1IDMR0.Bits.AM1
#define CAN1IDMR0_AM2 _CAN1IDMR0.Bits.AM2
#define CAN1IDMR0_AM3 _CAN1IDMR0.Bits.AM3
#define CAN1IDMR0_AM4 _CAN1IDMR0.Bits.AM4
#define CAN1IDMR0_AM5 _CAN1IDMR0.Bits.AM5
#define CAN1IDMR0_AM6 _CAN1IDMR0.Bits.AM6
#define CAN1IDMR0_AM7 _CAN1IDMR0.Bits.AM7
/* CAN1IDMR_ARR: Access 4 CAN1IDMRx registers in a array */
#define CAN1IDMR_ARR ((Byte *) &CAN1IDMR0)
#define CAN1IDMR0_AM _CAN1IDMR0.MergedBits.grpAM

#define CAN1IDMR0_AM0_MASK   1
#define CAN1IDMR0_AM1_MASK   2
#define CAN1IDMR0_AM2_MASK   4
#define CAN1IDMR0_AM3_MASK   8
#define CAN1IDMR0_AM4_MASK   16
#define CAN1IDMR0_AM5_MASK   32
#define CAN1IDMR0_AM6_MASK   64
#define CAN1IDMR0_AM7_MASK   128
#define CAN1IDMR0_AM_MASK  255
#define CAN1IDMR0_AM_BITNUM  0


/*** CAN1IDMR1 - MSCAN 1 Identifier Mask Register 1; 0x00000195 ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
  struct {
    byte grpAM   :8;
  } MergedBits;
} CAN1IDMR1STR;
extern volatile CAN1IDMR1STR _CAN1IDMR1 @(REG_BASE + 0x00000195);
#define CAN1IDMR1 _CAN1IDMR1.Byte
#define CAN1IDMR1_AM0 _CAN1IDMR1.Bits.AM0
#define CAN1IDMR1_AM1 _CAN1IDMR1.Bits.AM1
#define CAN1IDMR1_AM2 _CAN1IDMR1.Bits.AM2
#define CAN1IDMR1_AM3 _CAN1IDMR1.Bits.AM3
#define CAN1IDMR1_AM4 _CAN1IDMR1.Bits.AM4
#define CAN1IDMR1_AM5 _CAN1IDMR1.Bits.AM5
#define CAN1IDMR1_AM6 _CAN1IDMR1.Bits.AM6
#define CAN1IDMR1_AM7 _CAN1IDMR1.Bits.AM7
#define CAN1IDMR1_AM _CAN1IDMR1.MergedBits.grpAM

#define CAN1IDMR1_AM0_MASK   1
#define CAN1IDMR1_AM1_MASK   2
#define CAN1IDMR1_AM2_MASK   4
#define CAN1IDMR1_AM3_MASK   8
#define CAN1IDMR1_AM4_MASK   16
#define CAN1IDMR1_AM5_MASK   32
#define CAN1IDMR1_AM6_MASK   64
#define CAN1IDMR1_AM7_MASK   128
#define CAN1IDMR1_AM_MASK  255
#define CAN1IDMR1_AM_BITNUM  0


/*** CAN1IDMR2 - MSCAN 1 Identifier Mask Register 2; 0x00000196 ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
  struct {
    byte grpAM   :8;
  } MergedBits;
} CAN1IDMR2STR;
