frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
extern volatile CAN1IDMR2STR _CAN1IDMR2 @(REG_BASE + 0x00000196);
#define CAN1IDMR2 _CAN1IDMR2.Byte
#define CAN1IDMR2_AM0 _CAN1IDMR2.Bits.AM0
#define CAN1IDMR2_AM1 _CAN1IDMR2.Bits.AM1
#define CAN1IDMR2_AM2 _CAN1IDMR2.Bits.AM2
#define CAN1IDMR2_AM3 _CAN1IDMR2.Bits.AM3
#define CAN1IDMR2_AM4 _CAN1IDMR2.Bits.AM4
#define CAN1IDMR2_AM5 _CAN1IDMR2.Bits.AM5
#define CAN1IDMR2_AM6 _CAN1IDMR2.Bits.AM6
#define CAN1IDMR2_AM7 _CAN1IDMR2.Bits.AM7
#define CAN1IDMR2_AM _CAN1IDMR2.MergedBits.grpAM

#define CAN1IDMR2_AM0_MASK   1
#define CAN1IDMR2_AM1_MASK   2
#define CAN1IDMR2_AM2_MASK   4
#define CAN1IDMR2_AM3_MASK   8
#define CAN1IDMR2_AM4_MASK   16
#define CAN1IDMR2_AM5_MASK   32
#define CAN1IDMR2_AM6_MASK   64
#define CAN1IDMR2_AM7_MASK   128
#define CAN1IDMR2_AM_MASK  255
#define CAN1IDMR2_AM_BITNUM  0


/*** CAN1IDMR3 - MSCAN 1 Identifier Mask Register 3; 0x00000197 ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
  struct {
    byte grpAM   :8;
  } MergedBits;
} CAN1IDMR3STR;
extern volatile CAN1IDMR3STR _CAN1IDMR3 @(REG_BASE + 0x00000197);
#define CAN1IDMR3 _CAN1IDMR3.Byte
#define CAN1IDMR3_AM0 _CAN1IDMR3.Bits.AM0
#define CAN1IDMR3_AM1 _CAN1IDMR3.Bits.AM1
#define CAN1IDMR3_AM2 _CAN1IDMR3.Bits.AM2
#define CAN1IDMR3_AM3 _CAN1IDMR3.Bits.AM3
#define CAN1IDMR3_AM4 _CAN1IDMR3.Bits.AM4
#define CAN1IDMR3_AM5 _CAN1IDMR3.Bits.AM5
#define CAN1IDMR3_AM6 _CAN1IDMR3.Bits.AM6
#define CAN1IDMR3_AM7 _CAN1IDMR3.Bits.AM7
#define CAN1IDMR3_AM _CAN1IDMR3.MergedBits.grpAM

#define CAN1IDMR3_AM0_MASK   1
#define CAN1IDMR3_AM1_MASK   2
#define CAN1IDMR3_AM2_MASK   4
#define CAN1IDMR3_AM3_MASK   8
#define CAN1IDMR3_AM4_MASK   16
#define CAN1IDMR3_AM5_MASK   32
#define CAN1IDMR3_AM6_MASK   64
#define CAN1IDMR3_AM7_MASK   128
#define CAN1IDMR3_AM_MASK  255
#define CAN1IDMR3_AM_BITNUM  0


/*** CAN1IDAR4 - MSCAN 1 Identifier Acceptance Register 4; 0x00000198 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
  struct {
    byte grpAC   :8;
  } MergedBits;
} CAN1IDAR4STR;
extern volatile CAN1IDAR4STR _CAN1IDAR4 @(REG_BASE + 0x00000198);
#define CAN1IDAR4 _CAN1IDAR4.Byte
#define CAN1IDAR4_AC0 _CAN1IDAR4.Bits.AC0
#define CAN1IDAR4_AC1 _CAN1IDAR4.Bits.AC1
#define CAN1IDAR4_AC2 _CAN1IDAR4.Bits.AC2
#define CAN1IDAR4_AC3 _CAN1IDAR4.Bits.AC3
#define CAN1IDAR4_AC4 _CAN1IDAR4.Bits.AC4
#define CAN1IDAR4_AC5 _CAN1IDAR4.Bits.AC5
#define CAN1IDAR4_AC6 _CAN1IDAR4.Bits.AC6
#define CAN1IDAR4_AC7 _CAN1IDAR4.Bits.AC7
#define CAN1IDAR4_AC _CAN1IDAR4.MergedBits.grpAC

#define CAN1IDAR4_AC0_MASK   1
#define CAN1IDAR4_AC1_MASK   2
#define CAN1IDAR4_AC2_MASK   4
#define CAN1IDAR4_AC3_MASK   8
#define CAN1IDAR4_AC4_MASK   16
#define CAN1IDAR4_AC5_MASK   32
#define CAN1IDAR4_AC6_MASK   64
#define CAN1IDAR4_AC7_MASK   128
#define CAN1IDAR4_AC_MASK  255
#define CAN1IDAR4_AC_BITNUM  0


/*** CAN1IDAR5 - MSCAN 1 Identifier Acceptance Register 5; 0x00000199 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
  struct {
    byte grpAC   :8;
  } MergedBits;
} CAN1IDAR5STR;
extern volatile CAN1IDAR5STR _CAN1IDAR5 @(REG_BASE + 0x00000199);
#define CAN1IDAR5 _CAN1IDAR5.Byte
#define CAN1IDAR5_AC0 _CAN1IDAR5.Bits.AC0
#define CAN1IDAR5_AC1 _CAN1IDAR5.Bits.AC1
#define CAN1IDAR5_AC2 _CAN1IDAR5.Bits.AC2
#define CAN1IDAR5_AC3 _CAN1IDAR5.Bits.AC3
#define CAN1IDAR5_AC4 _CAN1IDAR5.Bits.AC4
#define CAN1IDAR5_AC5 _CAN1IDAR5.Bits.AC5
#define CAN1IDAR5_AC6 _CAN1IDAR5.Bits.AC6
#define CAN1IDAR5_AC7 _CAN1IDAR5.Bits.AC7
#define CAN1IDAR5_AC _CAN1IDAR5.MergedBits.grpAC

#define CAN1IDAR5_AC0_MASK   1
#define CAN1IDAR5_AC1_MASK   2
#define CAN1IDAR5_AC2_MASK   4
#define CAN1IDAR5_AC3_MASK   8
#define CAN1IDAR5_AC4_MASK   16
#define CAN1IDAR5_AC5_MASK   32
#define CAN1IDAR5_AC6_MASK   64
#define CAN1IDAR5_AC7_MASK   128
#define CAN1IDAR5_AC_MASK  255
#define CAN1IDAR5_AC_BITNUM  0


/*** CAN1IDAR6 - MSCAN 1 Identifier Acceptance Register 6; 0x0000019A ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
  struct {
    byte grpAC   :8;
  } MergedBits;
} CAN1IDAR6STR;
extern volatile CAN1IDAR6STR _CAN1IDAR6 @(REG_BASE + 0x0000019A);
#define CAN1IDAR6 _CAN1IDAR6.Byte
#define CAN1IDAR6_AC0 _CAN1IDAR6.Bits.AC0
#define CAN1IDAR6_AC1 _CAN1IDAR6.Bits.AC1
#define CAN1IDAR6_AC2 _CAN1IDAR6.Bits.AC2
#define CAN1IDAR6_AC3 _CAN1IDAR6.Bits.AC3
#define CAN1IDAR6_AC4 _CAN1IDAR6.Bits.AC4
#define CAN1IDAR6_AC5 _CAN1IDAR6.Bits.AC5
#define CAN1IDAR6_AC6 _CAN1IDAR6.Bits.AC6
#define CAN1IDAR6_AC7 _CAN1IDAR6.Bits.AC7
#define CAN1IDAR6_AC _CAN1IDAR6.MergedBits.grpAC

