frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
#define CAN1IDMR7_AM0_MASK   1
#define CAN1IDMR7_AM1_MASK   2
#define CAN1IDMR7_AM2_MASK   4
#define CAN1IDMR7_AM3_MASK   8
#define CAN1IDMR7_AM4_MASK   16
#define CAN1IDMR7_AM5_MASK   32
#define CAN1IDMR7_AM6_MASK   64
#define CAN1IDMR7_AM7_MASK   128
#define CAN1IDMR7_AM_MASK  255
#define CAN1IDMR7_AM_BITNUM  0


/*** CAN1RXIDR0 - MSCAN 1 Receive Identifier Register 0; 0x000001A0 ***/
typedef union {
  byte Byte;
  struct {
    byte ID21        :1;                                       /* Extended format identifier Bit 21 */
    byte ID22        :1;                                       /* Extended format identifier Bit 22 */
    byte ID23        :1;                                       /* Extended format identifier Bit 23 */
    byte ID24        :1;                                       /* Extended format identifier Bit 24 */
    byte ID25        :1;                                       /* Extended format identifier Bit 25 */
    byte ID26        :1;                                       /* Extended format identifier Bit 26 */
    byte ID27        :1;                                       /* Extended format identifier Bit 27 */
    byte ID28        :1;                                       /* Extended format identifier Bit 28 */
  } Bits;
  struct {
    byte grpID_21 :8;
  } MergedBits;
} CAN1RXIDR0STR;
extern volatile CAN1RXIDR0STR _CAN1RXIDR0 @(REG_BASE + 0x000001A0);
#define CAN1RXIDR0 _CAN1RXIDR0.Byte
#define CAN1RXIDR0_ID21 _CAN1RXIDR0.Bits.ID21
#define CAN1RXIDR0_ID22 _CAN1RXIDR0.Bits.ID22
#define CAN1RXIDR0_ID23 _CAN1RXIDR0.Bits.ID23
#define CAN1RXIDR0_ID24 _CAN1RXIDR0.Bits.ID24
#define CAN1RXIDR0_ID25 _CAN1RXIDR0.Bits.ID25
#define CAN1RXIDR0_ID26 _CAN1RXIDR0.Bits.ID26
#define CAN1RXIDR0_ID27 _CAN1RXIDR0.Bits.ID27
#define CAN1RXIDR0_ID28 _CAN1RXIDR0.Bits.ID28
/* CAN1RXIDR_ARR: Access 4 CAN1RXIDRx registers in a array */
#define CAN1RXIDR_ARR ((Byte *) &CAN1RXIDR0)
#define CAN1RXIDR0_ID_21 _CAN1RXIDR0.MergedBits.grpID_21
#define CAN1RXIDR0_ID CAN1RXIDR0_ID_21

#define CAN1RXIDR0_ID21_MASK   1
#define CAN1RXIDR0_ID22_MASK   2
#define CAN1RXIDR0_ID23_MASK   4
#define CAN1RXIDR0_ID24_MASK   8
#define CAN1RXIDR0_ID25_MASK   16
#define CAN1RXIDR0_ID26_MASK   32
#define CAN1RXIDR0_ID27_MASK   64
#define CAN1RXIDR0_ID28_MASK   128
#define CAN1RXIDR0_ID_21_MASK  255
#define CAN1RXIDR0_ID_21_BITNUM  0


/*** CAN1RXIDR1 - MSCAN 1 Receive Identifier Register 1; 0x000001A1 ***/
typedef union {
  byte Byte;
  struct {
    byte ID15        :1;                                       /* Extended format identifier Bit 15 */
    byte ID16        :1;                                       /* Extended format identifier Bit 16 */
    byte ID17        :1;                                       /* Extended format identifier Bit 17 */
    byte IDE         :1;                                       /* ID Extended */
    byte SRR         :1;                                       /* Substitute Remote Request */
    byte ID18        :1;                                       /* Extended format identifier Bit 18 */
    byte ID19        :1;                                       /* Extended format identifier Bit 19 */
    byte ID20        :1;                                       /* Extended format identifier Bit 20 */
  } Bits;
  struct {
    byte grpID_15 :3;
    byte         :1;
    byte         :1;
    byte grpID_18 :3;
  } MergedBits;
} CAN1RXIDR1STR;
extern volatile CAN1RXIDR1STR _CAN1RXIDR1 @(REG_BASE + 0x000001A1);
#define CAN1RXIDR1 _CAN1RXIDR1.Byte
#define CAN1RXIDR1_ID15 _CAN1RXIDR1.Bits.ID15
#define CAN1RXIDR1_ID16 _CAN1RXIDR1.Bits.ID16
#define CAN1RXIDR1_ID17 _CAN1RXIDR1.Bits.ID17
#define CAN1RXIDR1_IDE _CAN1RXIDR1.Bits.IDE
#define CAN1RXIDR1_SRR _CAN1RXIDR1.Bits.SRR
#define CAN1RXIDR1_ID18 _CAN1RXIDR1.Bits.ID18
#define CAN1RXIDR1_ID19 _CAN1RXIDR1.Bits.ID19
#define CAN1RXIDR1_ID20 _CAN1RXIDR1.Bits.ID20
#define CAN1RXIDR1_ID_15 _CAN1RXIDR1.MergedBits.grpID_15
#define CAN1RXIDR1_ID_18 _CAN1RXIDR1.MergedBits.grpID_18
#define CAN1RXIDR1_ID CAN1RXIDR1_ID_15

#define CAN1RXIDR1_ID15_MASK   1
#define CAN1RXIDR1_ID16_MASK   2
#define CAN1RXIDR1_ID17_MASK   4
#define CAN1RXIDR1_IDE_MASK   8
#define CAN1RXIDR1_SRR_MASK   16
#define CAN1RXIDR1_ID18_MASK   32
#define CAN1RXIDR1_ID19_MASK   64
#define CAN1RXIDR1_ID20_MASK   128
#define CAN1RXIDR1_ID_15_MASK  7
#define CAN1RXIDR1_ID_15_BITNUM  0
#define CAN1RXIDR1_ID_18_MASK  224
#define CAN1RXIDR1_ID_18_BITNUM  5


/*** CAN1RXIDR2 - MSCAN 1 Receive Identifier Register 2; 0x000001A2 ***/
typedef union {
  byte Byte;
  struct {
    byte ID7         :1;                                       /* Extended format identifier Bit 7 */
    byte ID8         :1;                                       /* Extended format identifier Bit 8 */
    byte ID9         :1;                                       /* Extended format identifier Bit 9 */
    byte ID10        :1;                                       /* Extended format identifier Bit 10 */
    byte ID11        :1;                                       /* Extended format identifier Bit 11 */
    byte ID12        :1;                                       /* Extended format identifier Bit 12 */
    byte ID13        :1;                                       /* Extended format identifier Bit 13 */
    byte ID14        :1;                                       /* Extended format identifier Bit 14 */
  } Bits;
  struct {
    byte grpID_7 :8;
  } MergedBits;
} CAN1RXIDR2STR;
extern volatile CAN1RXIDR2STR _CAN1RXIDR2 @(REG_BASE + 0x000001A2);
#define CAN1RXIDR2 _CAN1RXIDR2.Byte
#define CAN1RXIDR2_ID7 _CAN1RXIDR2.Bits.ID7
#define CAN1RXIDR2_ID8 _CAN1RXIDR2.Bits.ID8
#define CAN1RXIDR2_ID9 _CAN1RXIDR2.Bits.ID9
#define CAN1RXIDR2_ID10 _CAN1RXIDR2.Bits.ID10
#define CAN1RXIDR2_ID11 _CAN1RXIDR2.Bits.ID11
#define CAN1RXIDR2_ID12 _CAN1RXIDR2.Bits.ID12
#define CAN1RXIDR2_ID13 _CAN1RXIDR2.Bits.ID13
#define CAN1RXIDR2_ID14 _CAN1RXIDR2.Bits.ID14
#define CAN1RXIDR2_ID_7 _CAN1RXIDR2.MergedBits.grpID_7
#define CAN1RXIDR2_ID CAN1RXIDR2_ID_7

#define CAN1RXIDR2_ID7_MASK   1
#define CAN1RXIDR2_ID8_MASK   2
#define CAN1RXIDR2_ID9_MASK   4
#define CAN1RXIDR2_ID10_MASK   8
#define CAN1RXIDR2_ID11_MASK   16
#define CAN1RXIDR2_ID12_MASK   32
#define CAN1RXIDR2_ID13_MASK   64
#define CAN1RXIDR2_ID14_MASK   128
#define CAN1RXIDR2_ID_7_MASK  255
#define CAN1RXIDR2_ID_7_BITNUM  0


/*** CAN1RXIDR3 - MSCAN 1 Receive Identifier Register 3; 0x000001A3 ***/
typedef union {
  byte Byte;
  struct {
    byte RTR         :1;                                       /* Remote Transmission Request */
    byte ID0         :1;                                       /* Extended format identifier Bit 0 */
    byte ID1         :1;                                       /* Extended format identifier Bit 1 */
    byte ID2         :1;                                       /* Extended format identifier Bit 2 */
    byte ID3         :1;                                       /* Extended format identifier Bit 3 */
    byte ID4         :1;                                       /* Extended format identifier Bit 4 */
    byte ID5         :1;                                       /* Extended format identifier Bit 5 */
    byte ID6         :1;                                       /* Extended format identifier Bit 6 */
  } Bits;
  struct {
    byte         :1;
    byte grpID   :7;
  } MergedBits;
} CAN1RXIDR3STR;
extern volatile CAN1RXIDR3STR _CAN1RXIDR3 @(REG_BASE + 0x000001A3);
#define CAN1RXIDR3 _CAN1RXIDR3.Byte
#define CAN1RXIDR3_RTR _CAN1RXIDR3.Bits.RTR
#define CAN1RXIDR3_ID0 _CAN1RXIDR3.Bits.ID0
#define CAN1RXIDR3_ID1 _CAN1RXIDR3.Bits.ID1
#define CAN1RXIDR3_ID2 _CAN1RXIDR3.Bits.ID2
#define CAN1RXIDR3_ID3 _CAN1RXIDR3.Bits.ID3
#define CAN1RXIDR3_ID4 _CAN1RXIDR3.Bits.ID4
#define CAN1RXIDR3_ID5 _CAN1RXIDR3.Bits.ID5
#define CAN1RXIDR3_ID6 _CAN1RXIDR3.Bits.ID6
#define CAN1RXIDR3_ID _CAN1RXIDR3.MergedBits.grpID

