frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
#define CAN1RXDSR3_DB0_MASK   1
#define CAN1RXDSR3_DB1_MASK   2
#define CAN1RXDSR3_DB2_MASK   4
#define CAN1RXDSR3_DB3_MASK   8
#define CAN1RXDSR3_DB4_MASK   16
#define CAN1RXDSR3_DB5_MASK   32
#define CAN1RXDSR3_DB6_MASK   64
#define CAN1RXDSR3_DB7_MASK   128
#define CAN1RXDSR3_DB_MASK  255
#define CAN1RXDSR3_DB_BITNUM  0


/*** CAN1RXDSR4 - MSCAN 1 Receive Data Segment Register 4; 0x000001A8 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN1RXDSR4STR;
extern volatile CAN1RXDSR4STR _CAN1RXDSR4 @(REG_BASE + 0x000001A8);
#define CAN1RXDSR4 _CAN1RXDSR4.Byte
#define CAN1RXDSR4_DB0 _CAN1RXDSR4.Bits.DB0
#define CAN1RXDSR4_DB1 _CAN1RXDSR4.Bits.DB1
#define CAN1RXDSR4_DB2 _CAN1RXDSR4.Bits.DB2
#define CAN1RXDSR4_DB3 _CAN1RXDSR4.Bits.DB3
#define CAN1RXDSR4_DB4 _CAN1RXDSR4.Bits.DB4
#define CAN1RXDSR4_DB5 _CAN1RXDSR4.Bits.DB5
#define CAN1RXDSR4_DB6 _CAN1RXDSR4.Bits.DB6
#define CAN1RXDSR4_DB7 _CAN1RXDSR4.Bits.DB7
#define CAN1RXDSR4_DB _CAN1RXDSR4.MergedBits.grpDB

#define CAN1RXDSR4_DB0_MASK   1
#define CAN1RXDSR4_DB1_MASK   2
#define CAN1RXDSR4_DB2_MASK   4
#define CAN1RXDSR4_DB3_MASK   8
#define CAN1RXDSR4_DB4_MASK   16
#define CAN1RXDSR4_DB5_MASK   32
#define CAN1RXDSR4_DB6_MASK   64
#define CAN1RXDSR4_DB7_MASK   128
#define CAN1RXDSR4_DB_MASK  255
#define CAN1RXDSR4_DB_BITNUM  0


/*** CAN1RXDSR5 - MSCAN 1 Receive Data Segment Register 5; 0x000001A9 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN1RXDSR5STR;
extern volatile CAN1RXDSR5STR _CAN1RXDSR5 @(REG_BASE + 0x000001A9);
#define CAN1RXDSR5 _CAN1RXDSR5.Byte
#define CAN1RXDSR5_DB0 _CAN1RXDSR5.Bits.DB0
#define CAN1RXDSR5_DB1 _CAN1RXDSR5.Bits.DB1
#define CAN1RXDSR5_DB2 _CAN1RXDSR5.Bits.DB2
#define CAN1RXDSR5_DB3 _CAN1RXDSR5.Bits.DB3
#define CAN1RXDSR5_DB4 _CAN1RXDSR5.Bits.DB4
#define CAN1RXDSR5_DB5 _CAN1RXDSR5.Bits.DB5
#define CAN1RXDSR5_DB6 _CAN1RXDSR5.Bits.DB6
#define CAN1RXDSR5_DB7 _CAN1RXDSR5.Bits.DB7
#define CAN1RXDSR5_DB _CAN1RXDSR5.MergedBits.grpDB

#define CAN1RXDSR5_DB0_MASK   1
#define CAN1RXDSR5_DB1_MASK   2
#define CAN1RXDSR5_DB2_MASK   4
#define CAN1RXDSR5_DB3_MASK   8
#define CAN1RXDSR5_DB4_MASK   16
#define CAN1RXDSR5_DB5_MASK   32
#define CAN1RXDSR5_DB6_MASK   64
#define CAN1RXDSR5_DB7_MASK   128
#define CAN1RXDSR5_DB_MASK  255
#define CAN1RXDSR5_DB_BITNUM  0


/*** CAN1RXDSR6 - MSCAN 1 Receive Data Segment Register 6; 0x000001AA ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN1RXDSR6STR;
extern volatile CAN1RXDSR6STR _CAN1RXDSR6 @(REG_BASE + 0x000001AA);
#define CAN1RXDSR6 _CAN1RXDSR6.Byte
#define CAN1RXDSR6_DB0 _CAN1RXDSR6.Bits.DB0
#define CAN1RXDSR6_DB1 _CAN1RXDSR6.Bits.DB1
#define CAN1RXDSR6_DB2 _CAN1RXDSR6.Bits.DB2
#define CAN1RXDSR6_DB3 _CAN1RXDSR6.Bits.DB3
#define CAN1RXDSR6_DB4 _CAN1RXDSR6.Bits.DB4
#define CAN1RXDSR6_DB5 _CAN1RXDSR6.Bits.DB5
#define CAN1RXDSR6_DB6 _CAN1RXDSR6.Bits.DB6
#define CAN1RXDSR6_DB7 _CAN1RXDSR6.Bits.DB7
#define CAN1RXDSR6_DB _CAN1RXDSR6.MergedBits.grpDB

#define CAN1RXDSR6_DB0_MASK   1
#define CAN1RXDSR6_DB1_MASK   2
#define CAN1RXDSR6_DB2_MASK   4
#define CAN1RXDSR6_DB3_MASK   8
#define CAN1RXDSR6_DB4_MASK   16
#define CAN1RXDSR6_DB5_MASK   32
#define CAN1RXDSR6_DB6_MASK   64
#define CAN1RXDSR6_DB7_MASK   128
#define CAN1RXDSR6_DB_MASK  255
#define CAN1RXDSR6_DB_BITNUM  0


/*** CAN1RXDSR7 - MSCAN 1 Receive Data Segment Register 7; 0x000001AB ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN1RXDSR7STR;
