frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
extern volatile CAN1RXDSR7STR _CAN1RXDSR7 @(REG_BASE + 0x000001AB);
#define CAN1RXDSR7 _CAN1RXDSR7.Byte
#define CAN1RXDSR7_DB0 _CAN1RXDSR7.Bits.DB0
#define CAN1RXDSR7_DB1 _CAN1RXDSR7.Bits.DB1
#define CAN1RXDSR7_DB2 _CAN1RXDSR7.Bits.DB2
#define CAN1RXDSR7_DB3 _CAN1RXDSR7.Bits.DB3
#define CAN1RXDSR7_DB4 _CAN1RXDSR7.Bits.DB4
#define CAN1RXDSR7_DB5 _CAN1RXDSR7.Bits.DB5
#define CAN1RXDSR7_DB6 _CAN1RXDSR7.Bits.DB6
#define CAN1RXDSR7_DB7 _CAN1RXDSR7.Bits.DB7
#define CAN1RXDSR7_DB _CAN1RXDSR7.MergedBits.grpDB

#define CAN1RXDSR7_DB0_MASK   1
#define CAN1RXDSR7_DB1_MASK   2
#define CAN1RXDSR7_DB2_MASK   4
#define CAN1RXDSR7_DB3_MASK   8
#define CAN1RXDSR7_DB4_MASK   16
#define CAN1RXDSR7_DB5_MASK   32
#define CAN1RXDSR7_DB6_MASK   64
#define CAN1RXDSR7_DB7_MASK   128
#define CAN1RXDSR7_DB_MASK  255
#define CAN1RXDSR7_DB_BITNUM  0


/*** CAN1RXDLR - MSCAN 1 Receive Data Length Register; 0x000001AC ***/
typedef union {
  byte Byte;
  struct {
    byte DLC0        :1;                                       /* Data Length Code Bit 0 */
    byte DLC1        :1;                                       /* Data Length Code Bit 1 */
    byte DLC2        :1;                                       /* Data Length Code Bit 2 */
    byte DLC3        :1;                                       /* Data Length Code Bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpDLC  :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN1RXDLRSTR;
extern volatile CAN1RXDLRSTR _CAN1RXDLR @(REG_BASE + 0x000001AC);
#define CAN1RXDLR _CAN1RXDLR.Byte
#define CAN1RXDLR_DLC0 _CAN1RXDLR.Bits.DLC0
#define CAN1RXDLR_DLC1 _CAN1RXDLR.Bits.DLC1
#define CAN1RXDLR_DLC2 _CAN1RXDLR.Bits.DLC2
#define CAN1RXDLR_DLC3 _CAN1RXDLR.Bits.DLC3
#define CAN1RXDLR_DLC _CAN1RXDLR.MergedBits.grpDLC

#define CAN1RXDLR_DLC0_MASK   1
#define CAN1RXDLR_DLC1_MASK   2
#define CAN1RXDLR_DLC2_MASK   4
#define CAN1RXDLR_DLC3_MASK   8
#define CAN1RXDLR_DLC_MASK  15
#define CAN1RXDLR_DLC_BITNUM  0


/*** CAN1RXTSR - MSCAN 1 Receive Time Stamp Register; 0x000001AE ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** CAN1RXTSRH - MSCAN 1 Receive Time Stamp Register High; 0x000001AE ***/
    union {
      byte Byte;
      struct {
        byte TSR8        :1;                                       /* Time Stamp Bit 8 */
        byte TSR9        :1;                                       /* Time Stamp Bit 9 */
        byte TSR10       :1;                                       /* Time Stamp Bit 10 */
        byte TSR11       :1;                                       /* Time Stamp Bit 11 */
        byte TSR12       :1;                                       /* Time Stamp Bit 12 */
        byte TSR13       :1;                                       /* Time Stamp Bit 13 */
        byte TSR14       :1;                                       /* Time Stamp Bit 14 */
        byte TSR15       :1;                                       /* Time Stamp Bit 15 */
      } Bits;
      struct {
        byte grpTSR_8 :8;
      } MergedBits;
    } CAN1RXTSRHSTR;
    #define CAN1RXTSRH _CAN1RXTSR.Overlap_STR.CAN1RXTSRHSTR.Byte
    #define CAN1RXTSRH_TSR8 _CAN1RXTSR.Overlap_STR.CAN1RXTSRHSTR.Bits.TSR8
    #define CAN1RXTSRH_TSR9 _CAN1RXTSR.Overlap_STR.CAN1RXTSRHSTR.Bits.TSR9
    #define CAN1RXTSRH_TSR10 _CAN1RXTSR.Overlap_STR.CAN1RXTSRHSTR.Bits.TSR10
    #define CAN1RXTSRH_TSR11 _CAN1RXTSR.Overlap_STR.CAN1RXTSRHSTR.Bits.TSR11
    #define CAN1RXTSRH_TSR12 _CAN1RXTSR.Overlap_STR.CAN1RXTSRHSTR.Bits.TSR12
    #define CAN1RXTSRH_TSR13 _CAN1RXTSR.Overlap_STR.CAN1RXTSRHSTR.Bits.TSR13
    #define CAN1RXTSRH_TSR14 _CAN1RXTSR.Overlap_STR.CAN1RXTSRHSTR.Bits.TSR14
    #define CAN1RXTSRH_TSR15 _CAN1RXTSR.Overlap_STR.CAN1RXTSRHSTR.Bits.TSR15
    
    #define CAN1RXTSRH_TSR_8 _CAN1RXTSR.Overlap_STR.CAN1RXTSRHSTR.MergedBits.grpTSR_8
    #define CAN1RXTSRH_TSR CAN1RXTSRH_TSR_8
    
    #define CAN1RXTSRH_TSR8_MASK   1
    #define CAN1RXTSRH_TSR9_MASK   2
    #define CAN1RXTSRH_TSR10_MASK   4
    #define CAN1RXTSRH_TSR11_MASK   8
    #define CAN1RXTSRH_TSR12_MASK   16
    #define CAN1RXTSRH_TSR13_MASK   32
    #define CAN1RXTSRH_TSR14_MASK   64
    #define CAN1RXTSRH_TSR15_MASK   128
    #define CAN1RXTSRH_TSR_8_MASK  255
    #define CAN1RXTSRH_TSR_8_BITNUM  0


    /*** CAN1RXTSRL - MSCAN 1 Receive Time Stamp Register Low; 0x000001AF ***/
    union {
      byte Byte;
      struct {
        byte TSR0        :1;                                       /* Time Stamp Bit 0 */
        byte TSR1        :1;                                       /* Time Stamp Bit 1 */
        byte TSR2        :1;                                       /* Time Stamp Bit 2 */
        byte TSR3        :1;                                       /* Time Stamp Bit 3 */
        byte TSR4        :1;                                       /* Time Stamp Bit 4 */
        byte TSR5        :1;                                       /* Time Stamp Bit 5 */
        byte TSR6        :1;                                       /* Time Stamp Bit 6 */
        byte TSR7        :1;                                       /* Time Stamp Bit 7 */
      } Bits;
      struct {
        byte grpTSR :8;
      } MergedBits;
    } CAN1RXTSRLSTR;
    #define CAN1RXTSRL _CAN1RXTSR.Overlap_STR.CAN1RXTSRLSTR.Byte
    #define CAN1RXTSRL_TSR0 _CAN1RXTSR.Overlap_STR.CAN1RXTSRLSTR.Bits.TSR0
    #define CAN1RXTSRL_TSR1 _CAN1RXTSR.Overlap_STR.CAN1RXTSRLSTR.Bits.TSR1
    #define CAN1RXTSRL_TSR2 _CAN1RXTSR.Overlap_STR.CAN1RXTSRLSTR.Bits.TSR2
    #define CAN1RXTSRL_TSR3 _CAN1RXTSR.Overlap_STR.CAN1RXTSRLSTR.Bits.TSR3
    #define CAN1RXTSRL_TSR4 _CAN1RXTSR.Overlap_STR.CAN1RXTSRLSTR.Bits.TSR4
    #define CAN1RXTSRL_TSR5 _CAN1RXTSR.Overlap_STR.CAN1RXTSRLSTR.Bits.TSR5
    #define CAN1RXTSRL_TSR6 _CAN1RXTSR.Overlap_STR.CAN1RXTSRLSTR.Bits.TSR6
    #define CAN1RXTSRL_TSR7 _CAN1RXTSR.Overlap_STR.CAN1RXTSRLSTR.Bits.TSR7
    
    #define CAN1RXTSRL_TSR _CAN1RXTSR.Overlap_STR.CAN1RXTSRLSTR.MergedBits.grpTSR
    
    #define CAN1RXTSRL_TSR0_MASK   1
    #define CAN1RXTSRL_TSR1_MASK   2
    #define CAN1RXTSRL_TSR2_MASK   4
    #define CAN1RXTSRL_TSR3_MASK   8
    #define CAN1RXTSRL_TSR4_MASK   16
    #define CAN1RXTSRL_TSR5_MASK   32
    #define CAN1RXTSRL_TSR6_MASK   64
    #define CAN1RXTSRL_TSR7_MASK   128
    #define CAN1RXTSRL_TSR_MASK  255
    #define CAN1RXTSRL_TSR_BITNUM  0

  } Overlap_STR;

