frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
  struct {
    word TSR0        :1;                                       /* Time Stamp Bit 0 */
    word TSR1        :1;                                       /* Time Stamp Bit 1 */
    word TSR2        :1;                                       /* Time Stamp Bit 2 */
    word TSR3        :1;                                       /* Time Stamp Bit 3 */
    word TSR4        :1;                                       /* Time Stamp Bit 4 */
    word TSR5        :1;                                       /* Time Stamp Bit 5 */
    word TSR6        :1;                                       /* Time Stamp Bit 6 */
    word TSR7        :1;                                       /* Time Stamp Bit 7 */
    word TSR8        :1;                                       /* Time Stamp Bit 8 */
    word TSR9        :1;                                       /* Time Stamp Bit 9 */
    word TSR10       :1;                                       /* Time Stamp Bit 10 */
    word TSR11       :1;                                       /* Time Stamp Bit 11 */
    word TSR12       :1;                                       /* Time Stamp Bit 12 */
    word TSR13       :1;                                       /* Time Stamp Bit 13 */
    word TSR14       :1;                                       /* Time Stamp Bit 14 */
    word TSR15       :1;                                       /* Time Stamp Bit 15 */
  } Bits;
  struct {
    word grpTSR  :16;
  } MergedBits;
} CAN1RXTSRSTR;
extern volatile CAN1RXTSRSTR _CAN1RXTSR @(REG_BASE + 0x000001AE);
#define CAN1RXTSR _CAN1RXTSR.Word
#define CAN1RXTSR_TSR0 _CAN1RXTSR.Bits.TSR0
#define CAN1RXTSR_TSR1 _CAN1RXTSR.Bits.TSR1
#define CAN1RXTSR_TSR2 _CAN1RXTSR.Bits.TSR2
#define CAN1RXTSR_TSR3 _CAN1RXTSR.Bits.TSR3
#define CAN1RXTSR_TSR4 _CAN1RXTSR.Bits.TSR4
#define CAN1RXTSR_TSR5 _CAN1RXTSR.Bits.TSR5
#define CAN1RXTSR_TSR6 _CAN1RXTSR.Bits.TSR6
#define CAN1RXTSR_TSR7 _CAN1RXTSR.Bits.TSR7
#define CAN1RXTSR_TSR8 _CAN1RXTSR.Bits.TSR8
#define CAN1RXTSR_TSR9 _CAN1RXTSR.Bits.TSR9
#define CAN1RXTSR_TSR10 _CAN1RXTSR.Bits.TSR10
#define CAN1RXTSR_TSR11 _CAN1RXTSR.Bits.TSR11
#define CAN1RXTSR_TSR12 _CAN1RXTSR.Bits.TSR12
#define CAN1RXTSR_TSR13 _CAN1RXTSR.Bits.TSR13
#define CAN1RXTSR_TSR14 _CAN1RXTSR.Bits.TSR14
#define CAN1RXTSR_TSR15 _CAN1RXTSR.Bits.TSR15
#define CAN1RXTSR_TSR _CAN1RXTSR.MergedBits.grpTSR

#define CAN1RXTSR_TSR0_MASK   1
#define CAN1RXTSR_TSR1_MASK   2
#define CAN1RXTSR_TSR2_MASK   4
#define CAN1RXTSR_TSR3_MASK   8
#define CAN1RXTSR_TSR4_MASK   16
#define CAN1RXTSR_TSR5_MASK   32
#define CAN1RXTSR_TSR6_MASK   64
#define CAN1RXTSR_TSR7_MASK   128
#define CAN1RXTSR_TSR8_MASK   256
#define CAN1RXTSR_TSR9_MASK   512
#define CAN1RXTSR_TSR10_MASK   1024
#define CAN1RXTSR_TSR11_MASK   2048
#define CAN1RXTSR_TSR12_MASK   4096
#define CAN1RXTSR_TSR13_MASK   8192
#define CAN1RXTSR_TSR14_MASK   16384
#define CAN1RXTSR_TSR15_MASK   32768
#define CAN1RXTSR_TSR_MASK  65535
#define CAN1RXTSR_TSR_BITNUM  0


/*** CAN1TXIDR0 - MSCAN 1 Transmit Identifier Register 0; 0x000001B0 ***/
typedef union {
  byte Byte;
  struct {
    byte ID21        :1;                                       /* Extended format identifier Bit 21 */
    byte ID22        :1;                                       /* Extended format identifier Bit 22 */
    byte ID23        :1;                                       /* Extended format identifier Bit 23 */
    byte ID24        :1;                                       /* Extended format identifier Bit 24 */
    byte ID25        :1;                                       /* Extended format identifier Bit 25 */
    byte ID26        :1;                                       /* Extended format identifier Bit 26 */
    byte ID27        :1;                                       /* Extended format identifier Bit 27 */
    byte ID28        :1;                                       /* Extended format identifier Bit 28 */
  } Bits;
  struct {
    byte grpID_21 :8;
  } MergedBits;
} CAN1TXIDR0STR;
extern volatile CAN1TXIDR0STR _CAN1TXIDR0 @(REG_BASE + 0x000001B0);
#define CAN1TXIDR0 _CAN1TXIDR0.Byte
#define CAN1TXIDR0_ID21 _CAN1TXIDR0.Bits.ID21
#define CAN1TXIDR0_ID22 _CAN1TXIDR0.Bits.ID22
#define CAN1TXIDR0_ID23 _CAN1TXIDR0.Bits.ID23
#define CAN1TXIDR0_ID24 _CAN1TXIDR0.Bits.ID24
#define CAN1TXIDR0_ID25 _CAN1TXIDR0.Bits.ID25
#define CAN1TXIDR0_ID26 _CAN1TXIDR0.Bits.ID26
#define CAN1TXIDR0_ID27 _CAN1TXIDR0.Bits.ID27
#define CAN1TXIDR0_ID28 _CAN1TXIDR0.Bits.ID28
/* CAN1TXIDR_ARR: Access 4 CAN1TXIDRx registers in a array */
#define CAN1TXIDR_ARR ((Byte *) &CAN1TXIDR0)
#define CAN1TXIDR0_ID_21 _CAN1TXIDR0.MergedBits.grpID_21
#define CAN1TXIDR0_ID CAN1TXIDR0_ID_21

#define CAN1TXIDR0_ID21_MASK   1
#define CAN1TXIDR0_ID22_MASK   2
#define CAN1TXIDR0_ID23_MASK   4
#define CAN1TXIDR0_ID24_MASK   8
#define CAN1TXIDR0_ID25_MASK   16
#define CAN1TXIDR0_ID26_MASK   32
#define CAN1TXIDR0_ID27_MASK   64
#define CAN1TXIDR0_ID28_MASK   128
#define CAN1TXIDR0_ID_21_MASK  255
#define CAN1TXIDR0_ID_21_BITNUM  0


/*** CAN1TXIDR1 - MSCAN 1 Transmit Identifier Register 1; 0x000001B1 ***/
typedef union {
  byte Byte;
  struct {
    byte ID15        :1;                                       /* Extended format identifier Bit 15 */
    byte ID16        :1;                                       /* Extended format identifier Bit 16 */
    byte ID17        :1;                                       /* Extended format identifier Bit 17 */
    byte IDE         :1;                                       /* ID Extended */
    byte SRR         :1;                                       /* Substitute Remote Request */
    byte ID18        :1;                                       /* Extended format identifier Bit 18 */
    byte ID19        :1;                                       /* Extended format identifier Bit 19 */
    byte ID20        :1;                                       /* Extended format identifier Bit 20 */
  } Bits;
  struct {
    byte grpID_15 :3;
    byte         :1;
    byte         :1;
    byte grpID_18 :3;
  } MergedBits;
} CAN1TXIDR1STR;
extern volatile CAN1TXIDR1STR _CAN1TXIDR1 @(REG_BASE + 0x000001B1);
#define CAN1TXIDR1 _CAN1TXIDR1.Byte
#define CAN1TXIDR1_ID15 _CAN1TXIDR1.Bits.ID15
#define CAN1TXIDR1_ID16 _CAN1TXIDR1.Bits.ID16
#define CAN1TXIDR1_ID17 _CAN1TXIDR1.Bits.ID17
#define CAN1TXIDR1_IDE _CAN1TXIDR1.Bits.IDE
#define CAN1TXIDR1_SRR _CAN1TXIDR1.Bits.SRR
#define CAN1TXIDR1_ID18 _CAN1TXIDR1.Bits.ID18
#define CAN1TXIDR1_ID19 _CAN1TXIDR1.Bits.ID19
#define CAN1TXIDR1_ID20 _CAN1TXIDR1.Bits.ID20
#define CAN1TXIDR1_ID_15 _CAN1TXIDR1.MergedBits.grpID_15
#define CAN1TXIDR1_ID_18 _CAN1TXIDR1.MergedBits.grpID_18
#define CAN1TXIDR1_ID CAN1TXIDR1_ID_15

