frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
  struct {
    word TSR0        :1;                                       /* Time Stamp Bit 0 */
    word TSR1        :1;                                       /* Time Stamp Bit 1 */
    word TSR2        :1;                                       /* Time Stamp Bit 2 */
    word TSR3        :1;                                       /* Time Stamp Bit 3 */
    word TSR4        :1;                                       /* Time Stamp Bit 4 */
    word TSR5        :1;                                       /* Time Stamp Bit 5 */
    word TSR6        :1;                                       /* Time Stamp Bit 6 */
    word TSR7        :1;                                       /* Time Stamp Bit 7 */
    word TSR8        :1;                                       /* Time Stamp Bit 8 */
    word TSR9        :1;                                       /* Time Stamp Bit 9 */
    word TSR10       :1;                                       /* Time Stamp Bit 10 */
    word TSR11       :1;                                       /* Time Stamp Bit 11 */
    word TSR12       :1;                                       /* Time Stamp Bit 12 */
    word TSR13       :1;                                       /* Time Stamp Bit 13 */
    word TSR14       :1;                                       /* Time Stamp Bit 14 */
    word TSR15       :1;                                       /* Time Stamp Bit 15 */
  } Bits;
  struct {
    word grpTSR  :16;
  } MergedBits;
} CAN1TXTSRSTR;
extern volatile CAN1TXTSRSTR _CAN1TXTSR @(REG_BASE + 0x000001BE);
#define CAN1TXTSR _CAN1TXTSR.Word
#define CAN1TXTSR_TSR0 _CAN1TXTSR.Bits.TSR0
#define CAN1TXTSR_TSR1 _CAN1TXTSR.Bits.TSR1
#define CAN1TXTSR_TSR2 _CAN1TXTSR.Bits.TSR2
#define CAN1TXTSR_TSR3 _CAN1TXTSR.Bits.TSR3
#define CAN1TXTSR_TSR4 _CAN1TXTSR.Bits.TSR4
#define CAN1TXTSR_TSR5 _CAN1TXTSR.Bits.TSR5
#define CAN1TXTSR_TSR6 _CAN1TXTSR.Bits.TSR6
#define CAN1TXTSR_TSR7 _CAN1TXTSR.Bits.TSR7
#define CAN1TXTSR_TSR8 _CAN1TXTSR.Bits.TSR8
#define CAN1TXTSR_TSR9 _CAN1TXTSR.Bits.TSR9
#define CAN1TXTSR_TSR10 _CAN1TXTSR.Bits.TSR10
#define CAN1TXTSR_TSR11 _CAN1TXTSR.Bits.TSR11
#define CAN1TXTSR_TSR12 _CAN1TXTSR.Bits.TSR12
#define CAN1TXTSR_TSR13 _CAN1TXTSR.Bits.TSR13
#define CAN1TXTSR_TSR14 _CAN1TXTSR.Bits.TSR14
#define CAN1TXTSR_TSR15 _CAN1TXTSR.Bits.TSR15
#define CAN1TXTSR_TSR _CAN1TXTSR.MergedBits.grpTSR

#define CAN1TXTSR_TSR0_MASK   1
#define CAN1TXTSR_TSR1_MASK   2
#define CAN1TXTSR_TSR2_MASK   4
#define CAN1TXTSR_TSR3_MASK   8
#define CAN1TXTSR_TSR4_MASK   16
#define CAN1TXTSR_TSR5_MASK   32
#define CAN1TXTSR_TSR6_MASK   64
#define CAN1TXTSR_TSR7_MASK   128
#define CAN1TXTSR_TSR8_MASK   256
#define CAN1TXTSR_TSR9_MASK   512
#define CAN1TXTSR_TSR10_MASK   1024
#define CAN1TXTSR_TSR11_MASK   2048
#define CAN1TXTSR_TSR12_MASK   4096
#define CAN1TXTSR_TSR13_MASK   8192
#define CAN1TXTSR_TSR14_MASK   16384
#define CAN1TXTSR_TSR15_MASK   32768
#define CAN1TXTSR_TSR_MASK  65535
#define CAN1TXTSR_TSR_BITNUM  0


/*** CAN2CTL0 - MSCAN 2 Control 0 Register; 0x000001C0 ***/
typedef union {
  byte Byte;
  struct {
    byte INITRQ      :1;                                       /* Initialization Mode Request */
    byte SLPRQ       :1;                                       /* Sleep Mode Request */
    byte WUPE        :1;                                       /* Wake-Up Enable */
    byte TIME        :1;                                       /* Timer Enable */
    byte SYNCH       :1;                                       /* Synchronized Status */
    byte CSWAI       :1;                                       /* CAN Stops in Wait Mode */
    byte RXACT       :1;                                       /* Receiver Active Status */
    byte RXFRM       :1;                                       /* Received Frame Flag */
  } Bits;
} CAN2CTL0STR;
extern volatile CAN2CTL0STR _CAN2CTL0 @(REG_BASE + 0x000001C0);
#define CAN2CTL0 _CAN2CTL0.Byte
#define CAN2CTL0_INITRQ _CAN2CTL0.Bits.INITRQ
#define CAN2CTL0_SLPRQ _CAN2CTL0.Bits.SLPRQ
#define CAN2CTL0_WUPE _CAN2CTL0.Bits.WUPE
#define CAN2CTL0_TIME _CAN2CTL0.Bits.TIME
#define CAN2CTL0_SYNCH _CAN2CTL0.Bits.SYNCH
#define CAN2CTL0_CSWAI _CAN2CTL0.Bits.CSWAI
#define CAN2CTL0_RXACT _CAN2CTL0.Bits.RXACT
#define CAN2CTL0_RXFRM _CAN2CTL0.Bits.RXFRM
/* CAN2CTL_ARR: Access 2 CAN2CTLx registers in a array */
#define CAN2CTL_ARR ((Byte *) &CAN2CTL0)

#define CAN2CTL0_INITRQ_MASK   1
#define CAN2CTL0_SLPRQ_MASK   2
#define CAN2CTL0_WUPE_MASK   4
#define CAN2CTL0_TIME_MASK   8
#define CAN2CTL0_SYNCH_MASK   16
#define CAN2CTL0_CSWAI_MASK   32
#define CAN2CTL0_RXACT_MASK   64
#define CAN2CTL0_RXFRM_MASK   128


/*** CAN2CTL1 - MSCAN 2 Control 1 Register; 0x000001C1 ***/
typedef union {
  byte Byte;
  struct {
    byte INITAK      :1;                                       /* Initialization Mode Acknowledge */
    byte SLPAK       :1;                                       /* Sleep Mode Acknowledge */
    byte WUPM        :1;                                       /* Wake-Up Mode */
    byte BORM        :1;                                       /* Bus-Off Recovery Mode */
    byte LISTEN      :1;                                       /* Listen Only Mode */
    byte LOOPB       :1;                                       /* Loop Back Self Test Mode */
    byte CLKSRC      :1;                                       /* MSCAN 2 Clock Source */
    byte CANE        :1;                                       /* MSCAN 2 Enable */
  } Bits;
} CAN2CTL1STR;
extern volatile CAN2CTL1STR _CAN2CTL1 @(REG_BASE + 0x000001C1);
#define CAN2CTL1 _CAN2CTL1.Byte
#define CAN2CTL1_INITAK _CAN2CTL1.Bits.INITAK
#define CAN2CTL1_SLPAK _CAN2CTL1.Bits.SLPAK
#define CAN2CTL1_WUPM _CAN2CTL1.Bits.WUPM
#define CAN2CTL1_BORM _CAN2CTL1.Bits.BORM
#define CAN2CTL1_LISTEN _CAN2CTL1.Bits.LISTEN
#define CAN2CTL1_LOOPB _CAN2CTL1.Bits.LOOPB
#define CAN2CTL1_CLKSRC _CAN2CTL1.Bits.CLKSRC
#define CAN2CTL1_CANE _CAN2CTL1.Bits.CANE

#define CAN2CTL1_INITAK_MASK   1
#define CAN2CTL1_SLPAK_MASK   2
#define CAN2CTL1_WUPM_MASK   4
#define CAN2CTL1_BORM_MASK   8
#define CAN2CTL1_LISTEN_MASK   16
#define CAN2CTL1_LOOPB_MASK   32
#define CAN2CTL1_CLKSRC_MASK   64
#define CAN2CTL1_CANE_MASK   128


