frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
extern volatile CAN2RIERSTR _CAN2RIER @(REG_BASE + 0x000001C5);
#define CAN2RIER _CAN2RIER.Byte
#define CAN2RIER_RXFIE _CAN2RIER.Bits.RXFIE
#define CAN2RIER_OVRIE _CAN2RIER.Bits.OVRIE
#define CAN2RIER_TSTATE0 _CAN2RIER.Bits.TSTATE0
#define CAN2RIER_TSTATE1 _CAN2RIER.Bits.TSTATE1
#define CAN2RIER_RSTATE0 _CAN2RIER.Bits.RSTATE0
#define CAN2RIER_RSTATE1 _CAN2RIER.Bits.RSTATE1
#define CAN2RIER_CSCIE _CAN2RIER.Bits.CSCIE
#define CAN2RIER_WUPIE _CAN2RIER.Bits.WUPIE
#define CAN2RIER_TSTATE _CAN2RIER.MergedBits.grpTSTATE
#define CAN2RIER_RSTATE _CAN2RIER.MergedBits.grpRSTATE

#define CAN2RIER_RXFIE_MASK   1
#define CAN2RIER_OVRIE_MASK   2
#define CAN2RIER_TSTATE0_MASK   4
#define CAN2RIER_TSTATE1_MASK   8
#define CAN2RIER_RSTATE0_MASK   16
#define CAN2RIER_RSTATE1_MASK   32
#define CAN2RIER_CSCIE_MASK   64
#define CAN2RIER_WUPIE_MASK   128
#define CAN2RIER_TSTATE_MASK  12
#define CAN2RIER_TSTATE_BITNUM  2
#define CAN2RIER_RSTATE_MASK  48
#define CAN2RIER_RSTATE_BITNUM  4


/*** CAN2TFLG - MSCAN 2 Transmitter Flag Register; 0x000001C6 ***/
typedef union {
  byte Byte;
  struct {
    byte TXE0        :1;                                       /* Transmitter Buffer Empty 0 */
    byte TXE1        :1;                                       /* Transmitter Buffer Empty 1 */
    byte TXE2        :1;                                       /* Transmitter Buffer Empty 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpTXE  :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN2TFLGSTR;
extern volatile CAN2TFLGSTR _CAN2TFLG @(REG_BASE + 0x000001C6);
#define CAN2TFLG _CAN2TFLG.Byte
#define CAN2TFLG_TXE0 _CAN2TFLG.Bits.TXE0
#define CAN2TFLG_TXE1 _CAN2TFLG.Bits.TXE1
#define CAN2TFLG_TXE2 _CAN2TFLG.Bits.TXE2
#define CAN2TFLG_TXE _CAN2TFLG.MergedBits.grpTXE

#define CAN2TFLG_TXE0_MASK   1
#define CAN2TFLG_TXE1_MASK   2
#define CAN2TFLG_TXE2_MASK   4
#define CAN2TFLG_TXE_MASK  7
#define CAN2TFLG_TXE_BITNUM  0


/*** CAN2TIER - MSCAN 2 Transmitter Interrupt Enable Register; 0x000001C7 ***/
typedef union {
  byte Byte;
  struct {
    byte TXEIE0      :1;                                       /* Transmitter Empty Interrupt Enable 0 */
    byte TXEIE1      :1;                                       /* Transmitter Empty Interrupt Enable 1 */
    byte TXEIE2      :1;                                       /* Transmitter Empty Interrupt Enable 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpTXEIE :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN2TIERSTR;
extern volatile CAN2TIERSTR _CAN2TIER @(REG_BASE + 0x000001C7);
#define CAN2TIER _CAN2TIER.Byte
#define CAN2TIER_TXEIE0 _CAN2TIER.Bits.TXEIE0
#define CAN2TIER_TXEIE1 _CAN2TIER.Bits.TXEIE1
#define CAN2TIER_TXEIE2 _CAN2TIER.Bits.TXEIE2
#define CAN2TIER_TXEIE _CAN2TIER.MergedBits.grpTXEIE

#define CAN2TIER_TXEIE0_MASK   1
#define CAN2TIER_TXEIE1_MASK   2
#define CAN2TIER_TXEIE2_MASK   4
#define CAN2TIER_TXEIE_MASK  7
#define CAN2TIER_TXEIE_BITNUM  0


/*** CAN2TARQ - MSCAN 2 Transmitter Message Abort Request; 0x000001C8 ***/
typedef union {
  byte Byte;
  struct {
    byte ABTRQ0      :1;                                       /* Abort Request 0 */
    byte ABTRQ1      :1;                                       /* Abort Request 1 */
    byte ABTRQ2      :1;                                       /* Abort Request 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpABTRQ :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN2TARQSTR;
extern volatile CAN2TARQSTR _CAN2TARQ @(REG_BASE + 0x000001C8);
#define CAN2TARQ _CAN2TARQ.Byte
#define CAN2TARQ_ABTRQ0 _CAN2TARQ.Bits.ABTRQ0
#define CAN2TARQ_ABTRQ1 _CAN2TARQ.Bits.ABTRQ1
#define CAN2TARQ_ABTRQ2 _CAN2TARQ.Bits.ABTRQ2
#define CAN2TARQ_ABTRQ _CAN2TARQ.MergedBits.grpABTRQ

#define CAN2TARQ_ABTRQ0_MASK   1
#define CAN2TARQ_ABTRQ1_MASK   2
#define CAN2TARQ_ABTRQ2_MASK   4
#define CAN2TARQ_ABTRQ_MASK  7
#define CAN2TARQ_ABTRQ_BITNUM  0


/*** CAN2TAAK - MSCAN 2 Transmitter Message Abort Control; 0x000001C9 ***/
typedef union {
  byte Byte;
  struct {
    byte ABTAK0      :1;                                       /* Abort Acknowledge 0 */
    byte ABTAK1      :1;                                       /* Abort Acknowledge 1 */
    byte ABTAK2      :1;                                       /* Abort Acknowledge 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpABTAK :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN2TAAKSTR;
extern volatile CAN2TAAKSTR _CAN2TAAK @(REG_BASE + 0x000001C9);
#define CAN2TAAK _CAN2TAAK.Byte
#define CAN2TAAK_ABTAK0 _CAN2TAAK.Bits.ABTAK0
#define CAN2TAAK_ABTAK1 _CAN2TAAK.Bits.ABTAK1
#define CAN2TAAK_ABTAK2 _CAN2TAAK.Bits.ABTAK2
#define CAN2TAAK_ABTAK _CAN2TAAK.MergedBits.grpABTAK

#define CAN2TAAK_ABTAK0_MASK   1
#define CAN2TAAK_ABTAK1_MASK   2
#define CAN2TAAK_ABTAK2_MASK   4
#define CAN2TAAK_ABTAK_MASK  7
#define CAN2TAAK_ABTAK_BITNUM  0


/*** CAN2TBSEL - MSCAN 2 Transmit Buffer Selection; 0x000001CA ***/
typedef union {
  byte Byte;
  struct {
    byte TX0         :1;                                       /* Transmit Buffer Select 0 */
    byte TX1         :1;                                       /* Transmit Buffer Select 1 */
    byte TX2         :1;                                       /* Transmit Buffer Select 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpTX   :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN2TBSELSTR;
extern volatile CAN2TBSELSTR _CAN2TBSEL @(REG_BASE + 0x000001CA);
#define CAN2TBSEL _CAN2TBSEL.Byte
#define CAN2TBSEL_TX0 _CAN2TBSEL.Bits.TX0
#define CAN2TBSEL_TX1 _CAN2TBSEL.Bits.TX1
#define CAN2TBSEL_TX2 _CAN2TBSEL.Bits.TX2
#define CAN2TBSEL_TX _CAN2TBSEL.MergedBits.grpTX

#define CAN2TBSEL_TX0_MASK   1
#define CAN2TBSEL_TX1_MASK   2
#define CAN2TBSEL_TX2_MASK   4
#define CAN2TBSEL_TX_MASK  7
#define CAN2TBSEL_TX_BITNUM  0


/*** CAN2IDAC - MSCAN 2 Identifier Acceptance Control Register; 0x000001CB ***/
typedef union {
  byte Byte;
  struct {
    byte IDHIT0      :1;                                       /* Identifier Acceptance Hit Indicator 0 */
    byte IDHIT1      :1;                                       /* Identifier Acceptance Hit Indicator 1 */
    byte IDHIT2      :1;                                       /* Identifier Acceptance Hit Indicator 2 */
    byte             :1; 
    byte IDAM0       :1;                                       /* Identifier Acceptance Mode 0 */
    byte IDAM1       :1;                                       /* Identifier Acceptance Mode 1 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpIDHIT :3;
    byte         :1;
    byte grpIDAM :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN2IDACSTR;
