frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
extern volatile CAN2IDACSTR _CAN2IDAC @(REG_BASE + 0x000001CB);
#define CAN2IDAC _CAN2IDAC.Byte
#define CAN2IDAC_IDHIT0 _CAN2IDAC.Bits.IDHIT0
#define CAN2IDAC_IDHIT1 _CAN2IDAC.Bits.IDHIT1
#define CAN2IDAC_IDHIT2 _CAN2IDAC.Bits.IDHIT2
#define CAN2IDAC_IDAM0 _CAN2IDAC.Bits.IDAM0
#define CAN2IDAC_IDAM1 _CAN2IDAC.Bits.IDAM1
#define CAN2IDAC_IDHIT _CAN2IDAC.MergedBits.grpIDHIT
#define CAN2IDAC_IDAM _CAN2IDAC.MergedBits.grpIDAM

#define CAN2IDAC_IDHIT0_MASK   1
#define CAN2IDAC_IDHIT1_MASK   2
#define CAN2IDAC_IDHIT2_MASK   4
#define CAN2IDAC_IDAM0_MASK   16
#define CAN2IDAC_IDAM1_MASK   32
#define CAN2IDAC_IDHIT_MASK  7
#define CAN2IDAC_IDHIT_BITNUM  0
#define CAN2IDAC_IDAM_MASK  48
#define CAN2IDAC_IDAM_BITNUM  4


/*** CAN2MISC - MSCAN 2 Miscellaneous Register; 0x000001CD ***/
typedef union {
  byte Byte;
  struct {
    byte BOHOLD      :1;                                       /* Bus-Off state Hold until user request */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} CAN2MISCSTR;
extern volatile CAN2MISCSTR _CAN2MISC @(REG_BASE + 0x000001CD);
#define CAN2MISC _CAN2MISC.Byte
#define CAN2MISC_BOHOLD _CAN2MISC.Bits.BOHOLD

#define CAN2MISC_BOHOLD_MASK   1


/*** CAN2RXERR - MSCAN 2 Receive Error Counter Register; 0x000001CE ***/
typedef union {
  byte Byte;
  struct {
    byte RXERR0      :1;                                       /* Bit 0 */
    byte RXERR1      :1;                                       /* Bit 1 */
    byte RXERR2      :1;                                       /* Bit 2 */
    byte RXERR3      :1;                                       /* Bit 3 */
    byte RXERR4      :1;                                       /* Bit 4 */
    byte RXERR5      :1;                                       /* Bit 5 */
    byte RXERR6      :1;                                       /* Bit 6 */
    byte RXERR7      :1;                                       /* Bit 7 */
  } Bits;
  struct {
    byte grpRXERR :8;
  } MergedBits;
} CAN2RXERRSTR;
extern volatile CAN2RXERRSTR _CAN2RXERR @(REG_BASE + 0x000001CE);
#define CAN2RXERR _CAN2RXERR.Byte
#define CAN2RXERR_RXERR0 _CAN2RXERR.Bits.RXERR0
#define CAN2RXERR_RXERR1 _CAN2RXERR.Bits.RXERR1
#define CAN2RXERR_RXERR2 _CAN2RXERR.Bits.RXERR2
#define CAN2RXERR_RXERR3 _CAN2RXERR.Bits.RXERR3
#define CAN2RXERR_RXERR4 _CAN2RXERR.Bits.RXERR4
#define CAN2RXERR_RXERR5 _CAN2RXERR.Bits.RXERR5
#define CAN2RXERR_RXERR6 _CAN2RXERR.Bits.RXERR6
#define CAN2RXERR_RXERR7 _CAN2RXERR.Bits.RXERR7
#define CAN2RXERR_RXERR _CAN2RXERR.MergedBits.grpRXERR

#define CAN2RXERR_RXERR0_MASK   1
#define CAN2RXERR_RXERR1_MASK   2
#define CAN2RXERR_RXERR2_MASK   4
#define CAN2RXERR_RXERR3_MASK   8
#define CAN2RXERR_RXERR4_MASK   16
#define CAN2RXERR_RXERR5_MASK   32
#define CAN2RXERR_RXERR6_MASK   64
#define CAN2RXERR_RXERR7_MASK   128
#define CAN2RXERR_RXERR_MASK  255
#define CAN2RXERR_RXERR_BITNUM  0


/*** CAN2TXERR - MSCAN 2 Transmit Error Counter Register; 0x000001CF ***/
typedef union {
  byte Byte;
  struct {
    byte TXERR0      :1;                                       /* Bit 0 */
    byte TXERR1      :1;                                       /* Bit 1 */
    byte TXERR2      :1;                                       /* Bit 2 */
    byte TXERR3      :1;                                       /* Bit 3 */
    byte TXERR4      :1;                                       /* Bit 4 */
    byte TXERR5      :1;                                       /* Bit 5 */
    byte TXERR6      :1;                                       /* Bit 6 */
    byte TXERR7      :1;                                       /* Bit 7 */
  } Bits;
  struct {
    byte grpTXERR :8;
  } MergedBits;
} CAN2TXERRSTR;
extern volatile CAN2TXERRSTR _CAN2TXERR @(REG_BASE + 0x000001CF);
#define CAN2TXERR _CAN2TXERR.Byte
#define CAN2TXERR_TXERR0 _CAN2TXERR.Bits.TXERR0
#define CAN2TXERR_TXERR1 _CAN2TXERR.Bits.TXERR1
#define CAN2TXERR_TXERR2 _CAN2TXERR.Bits.TXERR2
#define CAN2TXERR_TXERR3 _CAN2TXERR.Bits.TXERR3
#define CAN2TXERR_TXERR4 _CAN2TXERR.Bits.TXERR4
#define CAN2TXERR_TXERR5 _CAN2TXERR.Bits.TXERR5
#define CAN2TXERR_TXERR6 _CAN2TXERR.Bits.TXERR6
#define CAN2TXERR_TXERR7 _CAN2TXERR.Bits.TXERR7
#define CAN2TXERR_TXERR _CAN2TXERR.MergedBits.grpTXERR

#define CAN2TXERR_TXERR0_MASK   1
#define CAN2TXERR_TXERR1_MASK   2
#define CAN2TXERR_TXERR2_MASK   4
#define CAN2TXERR_TXERR3_MASK   8
#define CAN2TXERR_TXERR4_MASK   16
#define CAN2TXERR_TXERR5_MASK   32
#define CAN2TXERR_TXERR6_MASK   64
#define CAN2TXERR_TXERR7_MASK   128
#define CAN2TXERR_TXERR_MASK  255
#define CAN2TXERR_TXERR_BITNUM  0


/*** CAN2IDAR0 - MSCAN 2 Identifier Acceptance Register 0; 0x000001D0 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
  struct {
    byte grpAC   :8;
  } MergedBits;
} CAN2IDAR0STR;
extern volatile CAN2IDAR0STR _CAN2IDAR0 @(REG_BASE + 0x000001D0);
#define CAN2IDAR0 _CAN2IDAR0.Byte
#define CAN2IDAR0_AC0 _CAN2IDAR0.Bits.AC0
#define CAN2IDAR0_AC1 _CAN2IDAR0.Bits.AC1
#define CAN2IDAR0_AC2 _CAN2IDAR0.Bits.AC2
#define CAN2IDAR0_AC3 _CAN2IDAR0.Bits.AC3
#define CAN2IDAR0_AC4 _CAN2IDAR0.Bits.AC4
#define CAN2IDAR0_AC5 _CAN2IDAR0.Bits.AC5
#define CAN2IDAR0_AC6 _CAN2IDAR0.Bits.AC6
#define CAN2IDAR0_AC7 _CAN2IDAR0.Bits.AC7
/* CAN2IDAR_ARR: Access 4 CAN2IDARx registers in a array */
#define CAN2IDAR_ARR ((Byte *) &CAN2IDAR0)
#define CAN2IDAR0_AC _CAN2IDAR0.MergedBits.grpAC

#define CAN2IDAR0_AC0_MASK   1
#define CAN2IDAR0_AC1_MASK   2
#define CAN2IDAR0_AC2_MASK   4
#define CAN2IDAR0_AC3_MASK   8
#define CAN2IDAR0_AC4_MASK   16
#define CAN2IDAR0_AC5_MASK   32
#define CAN2IDAR0_AC6_MASK   64
#define CAN2IDAR0_AC7_MASK   128
#define CAN2IDAR0_AC_MASK  255
#define CAN2IDAR0_AC_BITNUM  0


