frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
/*** CAN2IDAR1 - MSCAN 2 Identifier Acceptance Register 1; 0x000001D1 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
  struct {
    byte grpAC   :8;
  } MergedBits;
} CAN2IDAR1STR;
extern volatile CAN2IDAR1STR _CAN2IDAR1 @(REG_BASE + 0x000001D1);
#define CAN2IDAR1 _CAN2IDAR1.Byte
#define CAN2IDAR1_AC0 _CAN2IDAR1.Bits.AC0
#define CAN2IDAR1_AC1 _CAN2IDAR1.Bits.AC1
#define CAN2IDAR1_AC2 _CAN2IDAR1.Bits.AC2
#define CAN2IDAR1_AC3 _CAN2IDAR1.Bits.AC3
#define CAN2IDAR1_AC4 _CAN2IDAR1.Bits.AC4
#define CAN2IDAR1_AC5 _CAN2IDAR1.Bits.AC5
#define CAN2IDAR1_AC6 _CAN2IDAR1.Bits.AC6
#define CAN2IDAR1_AC7 _CAN2IDAR1.Bits.AC7
#define CAN2IDAR1_AC _CAN2IDAR1.MergedBits.grpAC

#define CAN2IDAR1_AC0_MASK   1
#define CAN2IDAR1_AC1_MASK   2
#define CAN2IDAR1_AC2_MASK   4
#define CAN2IDAR1_AC3_MASK   8
#define CAN2IDAR1_AC4_MASK   16
#define CAN2IDAR1_AC5_MASK   32
#define CAN2IDAR1_AC6_MASK   64
#define CAN2IDAR1_AC7_MASK   128
#define CAN2IDAR1_AC_MASK  255
#define CAN2IDAR1_AC_BITNUM  0


/*** CAN2IDAR2 - MSCAN 2 Identifier Acceptance Register 2; 0x000001D2 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
  struct {
    byte grpAC   :8;
  } MergedBits;
} CAN2IDAR2STR;
extern volatile CAN2IDAR2STR _CAN2IDAR2 @(REG_BASE + 0x000001D2);
#define CAN2IDAR2 _CAN2IDAR2.Byte
#define CAN2IDAR2_AC0 _CAN2IDAR2.Bits.AC0
#define CAN2IDAR2_AC1 _CAN2IDAR2.Bits.AC1
#define CAN2IDAR2_AC2 _CAN2IDAR2.Bits.AC2
#define CAN2IDAR2_AC3 _CAN2IDAR2.Bits.AC3
#define CAN2IDAR2_AC4 _CAN2IDAR2.Bits.AC4
#define CAN2IDAR2_AC5 _CAN2IDAR2.Bits.AC5
#define CAN2IDAR2_AC6 _CAN2IDAR2.Bits.AC6
#define CAN2IDAR2_AC7 _CAN2IDAR2.Bits.AC7
#define CAN2IDAR2_AC _CAN2IDAR2.MergedBits.grpAC

#define CAN2IDAR2_AC0_MASK   1
#define CAN2IDAR2_AC1_MASK   2
#define CAN2IDAR2_AC2_MASK   4
#define CAN2IDAR2_AC3_MASK   8
#define CAN2IDAR2_AC4_MASK   16
#define CAN2IDAR2_AC5_MASK   32
#define CAN2IDAR2_AC6_MASK   64
#define CAN2IDAR2_AC7_MASK   128
#define CAN2IDAR2_AC_MASK  255
#define CAN2IDAR2_AC_BITNUM  0


/*** CAN2IDAR3 - MSCAN 2 Identifier Acceptance Register 3; 0x000001D3 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
  struct {
    byte grpAC   :8;
  } MergedBits;
} CAN2IDAR3STR;
extern volatile CAN2IDAR3STR _CAN2IDAR3 @(REG_BASE + 0x000001D3);
#define CAN2IDAR3 _CAN2IDAR3.Byte
#define CAN2IDAR3_AC0 _CAN2IDAR3.Bits.AC0
#define CAN2IDAR3_AC1 _CAN2IDAR3.Bits.AC1
#define CAN2IDAR3_AC2 _CAN2IDAR3.Bits.AC2
#define CAN2IDAR3_AC3 _CAN2IDAR3.Bits.AC3
#define CAN2IDAR3_AC4 _CAN2IDAR3.Bits.AC4
#define CAN2IDAR3_AC5 _CAN2IDAR3.Bits.AC5
#define CAN2IDAR3_AC6 _CAN2IDAR3.Bits.AC6
#define CAN2IDAR3_AC7 _CAN2IDAR3.Bits.AC7
#define CAN2IDAR3_AC _CAN2IDAR3.MergedBits.grpAC

#define CAN2IDAR3_AC0_MASK   1
#define CAN2IDAR3_AC1_MASK   2
#define CAN2IDAR3_AC2_MASK   4
#define CAN2IDAR3_AC3_MASK   8
#define CAN2IDAR3_AC4_MASK   16
#define CAN2IDAR3_AC5_MASK   32
#define CAN2IDAR3_AC6_MASK   64
#define CAN2IDAR3_AC7_MASK   128
#define CAN2IDAR3_AC_MASK  255
#define CAN2IDAR3_AC_BITNUM  0


/*** CAN2IDMR0 - MSCAN 2 Identifier Mask Register 0; 0x000001D4 ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
  struct {
    byte grpAM   :8;
  } MergedBits;
} CAN2IDMR0STR;
