frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
#define CAN2IDMR5_AM0_MASK   1
#define CAN2IDMR5_AM1_MASK   2
#define CAN2IDMR5_AM2_MASK   4
#define CAN2IDMR5_AM3_MASK   8
#define CAN2IDMR5_AM4_MASK   16
#define CAN2IDMR5_AM5_MASK   32
#define CAN2IDMR5_AM6_MASK   64
#define CAN2IDMR5_AM7_MASK   128
#define CAN2IDMR5_AM_MASK  255
#define CAN2IDMR5_AM_BITNUM  0


/*** CAN2IDMR6 - MSCAN 2 Identifier Mask Register 6; 0x000001DE ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
  struct {
    byte grpAM   :8;
  } MergedBits;
} CAN2IDMR6STR;
extern volatile CAN2IDMR6STR _CAN2IDMR6 @(REG_BASE + 0x000001DE);
#define CAN2IDMR6 _CAN2IDMR6.Byte
#define CAN2IDMR6_AM0 _CAN2IDMR6.Bits.AM0
#define CAN2IDMR6_AM1 _CAN2IDMR6.Bits.AM1
#define CAN2IDMR6_AM2 _CAN2IDMR6.Bits.AM2
#define CAN2IDMR6_AM3 _CAN2IDMR6.Bits.AM3
#define CAN2IDMR6_AM4 _CAN2IDMR6.Bits.AM4
#define CAN2IDMR6_AM5 _CAN2IDMR6.Bits.AM5
#define CAN2IDMR6_AM6 _CAN2IDMR6.Bits.AM6
#define CAN2IDMR6_AM7 _CAN2IDMR6.Bits.AM7
#define CAN2IDMR6_AM _CAN2IDMR6.MergedBits.grpAM

#define CAN2IDMR6_AM0_MASK   1
#define CAN2IDMR6_AM1_MASK   2
#define CAN2IDMR6_AM2_MASK   4
#define CAN2IDMR6_AM3_MASK   8
#define CAN2IDMR6_AM4_MASK   16
#define CAN2IDMR6_AM5_MASK   32
#define CAN2IDMR6_AM6_MASK   64
#define CAN2IDMR6_AM7_MASK   128
#define CAN2IDMR6_AM_MASK  255
#define CAN2IDMR6_AM_BITNUM  0


/*** CAN2IDMR7 - MSCAN 2 Identifier Mask Register 7; 0x000001DF ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
  struct {
    byte grpAM   :8;
  } MergedBits;
} CAN2IDMR7STR;
extern volatile CAN2IDMR7STR _CAN2IDMR7 @(REG_BASE + 0x000001DF);
#define CAN2IDMR7 _CAN2IDMR7.Byte
#define CAN2IDMR7_AM0 _CAN2IDMR7.Bits.AM0
#define CAN2IDMR7_AM1 _CAN2IDMR7.Bits.AM1
#define CAN2IDMR7_AM2 _CAN2IDMR7.Bits.AM2
#define CAN2IDMR7_AM3 _CAN2IDMR7.Bits.AM3
#define CAN2IDMR7_AM4 _CAN2IDMR7.Bits.AM4
#define CAN2IDMR7_AM5 _CAN2IDMR7.Bits.AM5
#define CAN2IDMR7_AM6 _CAN2IDMR7.Bits.AM6
#define CAN2IDMR7_AM7 _CAN2IDMR7.Bits.AM7
#define CAN2IDMR7_AM _CAN2IDMR7.MergedBits.grpAM

#define CAN2IDMR7_AM0_MASK   1
#define CAN2IDMR7_AM1_MASK   2
#define CAN2IDMR7_AM2_MASK   4
#define CAN2IDMR7_AM3_MASK   8
#define CAN2IDMR7_AM4_MASK   16
#define CAN2IDMR7_AM5_MASK   32
#define CAN2IDMR7_AM6_MASK   64
#define CAN2IDMR7_AM7_MASK   128
#define CAN2IDMR7_AM_MASK  255
#define CAN2IDMR7_AM_BITNUM  0


/*** CAN2RXIDR0 - MSCAN 2 Receive Identifier Register 0; 0x000001E0 ***/
typedef union {
  byte Byte;
  struct {
    byte ID21        :1;                                       /* Extended format identifier Bit 21 */
    byte ID22        :1;                                       /* Extended format identifier Bit 22 */
    byte ID23        :1;                                       /* Extended format identifier Bit 23 */
    byte ID24        :1;                                       /* Extended format identifier Bit 24 */
    byte ID25        :1;                                       /* Extended format identifier Bit 25 */
    byte ID26        :1;                                       /* Extended format identifier Bit 26 */
    byte ID27        :1;                                       /* Extended format identifier Bit 27 */
    byte ID28        :1;                                       /* Extended format identifier Bit 28 */
  } Bits;
  struct {
    byte grpID_21 :8;
  } MergedBits;
} CAN2RXIDR0STR;
extern volatile CAN2RXIDR0STR _CAN2RXIDR0 @(REG_BASE + 0x000001E0);
#define CAN2RXIDR0 _CAN2RXIDR0.Byte
#define CAN2RXIDR0_ID21 _CAN2RXIDR0.Bits.ID21
#define CAN2RXIDR0_ID22 _CAN2RXIDR0.Bits.ID22
#define CAN2RXIDR0_ID23 _CAN2RXIDR0.Bits.ID23
#define CAN2RXIDR0_ID24 _CAN2RXIDR0.Bits.ID24
#define CAN2RXIDR0_ID25 _CAN2RXIDR0.Bits.ID25
#define CAN2RXIDR0_ID26 _CAN2RXIDR0.Bits.ID26
#define CAN2RXIDR0_ID27 _CAN2RXIDR0.Bits.ID27
#define CAN2RXIDR0_ID28 _CAN2RXIDR0.Bits.ID28
/* CAN2RXIDR_ARR: Access 4 CAN2RXIDRx registers in a array */
#define CAN2RXIDR_ARR ((Byte *) &CAN2RXIDR0)
#define CAN2RXIDR0_ID_21 _CAN2RXIDR0.MergedBits.grpID_21
#define CAN2RXIDR0_ID CAN2RXIDR0_ID_21

#define CAN2RXIDR0_ID21_MASK   1
#define CAN2RXIDR0_ID22_MASK   2
#define CAN2RXIDR0_ID23_MASK   4
#define CAN2RXIDR0_ID24_MASK   8
#define CAN2RXIDR0_ID25_MASK   16
#define CAN2RXIDR0_ID26_MASK   32
#define CAN2RXIDR0_ID27_MASK   64
#define CAN2RXIDR0_ID28_MASK   128
#define CAN2RXIDR0_ID_21_MASK  255
#define CAN2RXIDR0_ID_21_BITNUM  0


/*** CAN2RXIDR1 - MSCAN 2 Receive Identifier Register 1; 0x000001E1 ***/
typedef union {
  byte Byte;
  struct {
    byte ID15        :1;                                       /* Extended format identifier Bit 15 */
    byte ID16        :1;                                       /* Extended format identifier Bit 16 */
    byte ID17        :1;                                       /* Extended format identifier Bit 17 */
    byte IDE         :1;                                       /* ID Extended */
    byte SRR         :1;                                       /* Substitute Remote Request */
    byte ID18        :1;                                       /* Extended format identifier Bit 18 */
    byte ID19        :1;                                       /* Extended format identifier Bit 19 */
    byte ID20        :1;                                       /* Extended format identifier Bit 20 */
  } Bits;
  struct {
    byte grpID_15 :3;
    byte         :1;
    byte         :1;
    byte grpID_18 :3;
  } MergedBits;
} CAN2RXIDR1STR;
extern volatile CAN2RXIDR1STR _CAN2RXIDR1 @(REG_BASE + 0x000001E1);
#define CAN2RXIDR1 _CAN2RXIDR1.Byte
#define CAN2RXIDR1_ID15 _CAN2RXIDR1.Bits.ID15
#define CAN2RXIDR1_ID16 _CAN2RXIDR1.Bits.ID16
#define CAN2RXIDR1_ID17 _CAN2RXIDR1.Bits.ID17
#define CAN2RXIDR1_IDE _CAN2RXIDR1.Bits.IDE
#define CAN2RXIDR1_SRR _CAN2RXIDR1.Bits.SRR
#define CAN2RXIDR1_ID18 _CAN2RXIDR1.Bits.ID18
#define CAN2RXIDR1_ID19 _CAN2RXIDR1.Bits.ID19
#define CAN2RXIDR1_ID20 _CAN2RXIDR1.Bits.ID20
#define CAN2RXIDR1_ID_15 _CAN2RXIDR1.MergedBits.grpID_15
#define CAN2RXIDR1_ID_18 _CAN2RXIDR1.MergedBits.grpID_18
#define CAN2RXIDR1_ID CAN2RXIDR1_ID_15

#define CAN2RXIDR1_ID15_MASK   1
#define CAN2RXIDR1_ID16_MASK   2
#define CAN2RXIDR1_ID17_MASK   4
#define CAN2RXIDR1_IDE_MASK   8
#define CAN2RXIDR1_SRR_MASK   16
#define CAN2RXIDR1_ID18_MASK   32
#define CAN2RXIDR1_ID19_MASK   64
#define CAN2RXIDR1_ID20_MASK   128
#define CAN2RXIDR1_ID_15_MASK  7
#define CAN2RXIDR1_ID_15_BITNUM  0
#define CAN2RXIDR1_ID_18_MASK  224
#define CAN2RXIDR1_ID_18_BITNUM  5


