frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
/*** CAN2RXIDR2 - MSCAN 2 Receive Identifier Register 2; 0x000001E2 ***/
typedef union {
  byte Byte;
  struct {
    byte ID7         :1;                                       /* Extended format identifier Bit 7 */
    byte ID8         :1;                                       /* Extended format identifier Bit 8 */
    byte ID9         :1;                                       /* Extended format identifier Bit 9 */
    byte ID10        :1;                                       /* Extended format identifier Bit 10 */
    byte ID11        :1;                                       /* Extended format identifier Bit 11 */
    byte ID12        :1;                                       /* Extended format identifier Bit 12 */
    byte ID13        :1;                                       /* Extended format identifier Bit 13 */
    byte ID14        :1;                                       /* Extended format identifier Bit 14 */
  } Bits;
  struct {
    byte grpID_7 :8;
  } MergedBits;
} CAN2RXIDR2STR;
extern volatile CAN2RXIDR2STR _CAN2RXIDR2 @(REG_BASE + 0x000001E2);
#define CAN2RXIDR2 _CAN2RXIDR2.Byte
#define CAN2RXIDR2_ID7 _CAN2RXIDR2.Bits.ID7
#define CAN2RXIDR2_ID8 _CAN2RXIDR2.Bits.ID8
#define CAN2RXIDR2_ID9 _CAN2RXIDR2.Bits.ID9
#define CAN2RXIDR2_ID10 _CAN2RXIDR2.Bits.ID10
#define CAN2RXIDR2_ID11 _CAN2RXIDR2.Bits.ID11
#define CAN2RXIDR2_ID12 _CAN2RXIDR2.Bits.ID12
#define CAN2RXIDR2_ID13 _CAN2RXIDR2.Bits.ID13
#define CAN2RXIDR2_ID14 _CAN2RXIDR2.Bits.ID14
#define CAN2RXIDR2_ID_7 _CAN2RXIDR2.MergedBits.grpID_7
#define CAN2RXIDR2_ID CAN2RXIDR2_ID_7

#define CAN2RXIDR2_ID7_MASK   1
#define CAN2RXIDR2_ID8_MASK   2
#define CAN2RXIDR2_ID9_MASK   4
#define CAN2RXIDR2_ID10_MASK   8
#define CAN2RXIDR2_ID11_MASK   16
#define CAN2RXIDR2_ID12_MASK   32
#define CAN2RXIDR2_ID13_MASK   64
#define CAN2RXIDR2_ID14_MASK   128
#define CAN2RXIDR2_ID_7_MASK  255
#define CAN2RXIDR2_ID_7_BITNUM  0


/*** CAN2RXIDR3 - MSCAN 2 Receive Identifier Register 3; 0x000001E3 ***/
typedef union {
  byte Byte;
  struct {
    byte RTR         :1;                                       /* Remote Transmission Request */
    byte ID0         :1;                                       /* Extended format identifier Bit 0 */
    byte ID1         :1;                                       /* Extended format identifier Bit 1 */
    byte ID2         :1;                                       /* Extended format identifier Bit 2 */
    byte ID3         :1;                                       /* Extended format identifier Bit 3 */
    byte ID4         :1;                                       /* Extended format identifier Bit 4 */
    byte ID5         :1;                                       /* Extended format identifier Bit 5 */
    byte ID6         :1;                                       /* Extended format identifier Bit 6 */
  } Bits;
  struct {
    byte         :1;
    byte grpID   :7;
  } MergedBits;
} CAN2RXIDR3STR;
extern volatile CAN2RXIDR3STR _CAN2RXIDR3 @(REG_BASE + 0x000001E3);
#define CAN2RXIDR3 _CAN2RXIDR3.Byte
#define CAN2RXIDR3_RTR _CAN2RXIDR3.Bits.RTR
#define CAN2RXIDR3_ID0 _CAN2RXIDR3.Bits.ID0
#define CAN2RXIDR3_ID1 _CAN2RXIDR3.Bits.ID1
#define CAN2RXIDR3_ID2 _CAN2RXIDR3.Bits.ID2
#define CAN2RXIDR3_ID3 _CAN2RXIDR3.Bits.ID3
#define CAN2RXIDR3_ID4 _CAN2RXIDR3.Bits.ID4
#define CAN2RXIDR3_ID5 _CAN2RXIDR3.Bits.ID5
#define CAN2RXIDR3_ID6 _CAN2RXIDR3.Bits.ID6
#define CAN2RXIDR3_ID _CAN2RXIDR3.MergedBits.grpID

#define CAN2RXIDR3_RTR_MASK   1
#define CAN2RXIDR3_ID0_MASK   2
#define CAN2RXIDR3_ID1_MASK   4
#define CAN2RXIDR3_ID2_MASK   8
#define CAN2RXIDR3_ID3_MASK   16
#define CAN2RXIDR3_ID4_MASK   32
#define CAN2RXIDR3_ID5_MASK   64
#define CAN2RXIDR3_ID6_MASK   128
#define CAN2RXIDR3_ID_MASK  254
#define CAN2RXIDR3_ID_BITNUM  1


/*** CAN2RXDSR0 - MSCAN 2 Receive Data Segment Register 0; 0x000001E4 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN2RXDSR0STR;
extern volatile CAN2RXDSR0STR _CAN2RXDSR0 @(REG_BASE + 0x000001E4);
#define CAN2RXDSR0 _CAN2RXDSR0.Byte
#define CAN2RXDSR0_DB0 _CAN2RXDSR0.Bits.DB0
#define CAN2RXDSR0_DB1 _CAN2RXDSR0.Bits.DB1
#define CAN2RXDSR0_DB2 _CAN2RXDSR0.Bits.DB2
#define CAN2RXDSR0_DB3 _CAN2RXDSR0.Bits.DB3
#define CAN2RXDSR0_DB4 _CAN2RXDSR0.Bits.DB4
#define CAN2RXDSR0_DB5 _CAN2RXDSR0.Bits.DB5
#define CAN2RXDSR0_DB6 _CAN2RXDSR0.Bits.DB6
#define CAN2RXDSR0_DB7 _CAN2RXDSR0.Bits.DB7
/* CAN2RXDSR_ARR: Access 8 CAN2RXDSRx registers in a array */
#define CAN2RXDSR_ARR ((Byte *) &CAN2RXDSR0)
#define CAN2RXDSR0_DB _CAN2RXDSR0.MergedBits.grpDB

#define CAN2RXDSR0_DB0_MASK   1
#define CAN2RXDSR0_DB1_MASK   2
#define CAN2RXDSR0_DB2_MASK   4
#define CAN2RXDSR0_DB3_MASK   8
#define CAN2RXDSR0_DB4_MASK   16
#define CAN2RXDSR0_DB5_MASK   32
#define CAN2RXDSR0_DB6_MASK   64
#define CAN2RXDSR0_DB7_MASK   128
#define CAN2RXDSR0_DB_MASK  255
#define CAN2RXDSR0_DB_BITNUM  0


/*** CAN2RXDSR1 - MSCAN 2 Receive Data Segment Register 1; 0x000001E5 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN2RXDSR1STR;
extern volatile CAN2RXDSR1STR _CAN2RXDSR1 @(REG_BASE + 0x000001E5);
#define CAN2RXDSR1 _CAN2RXDSR1.Byte
#define CAN2RXDSR1_DB0 _CAN2RXDSR1.Bits.DB0
#define CAN2RXDSR1_DB1 _CAN2RXDSR1.Bits.DB1
#define CAN2RXDSR1_DB2 _CAN2RXDSR1.Bits.DB2
#define CAN2RXDSR1_DB3 _CAN2RXDSR1.Bits.DB3
#define CAN2RXDSR1_DB4 _CAN2RXDSR1.Bits.DB4
#define CAN2RXDSR1_DB5 _CAN2RXDSR1.Bits.DB5
#define CAN2RXDSR1_DB6 _CAN2RXDSR1.Bits.DB6
#define CAN2RXDSR1_DB7 _CAN2RXDSR1.Bits.DB7
#define CAN2RXDSR1_DB _CAN2RXDSR1.MergedBits.grpDB

#define CAN2RXDSR1_DB0_MASK   1
#define CAN2RXDSR1_DB1_MASK   2
#define CAN2RXDSR1_DB2_MASK   4
#define CAN2RXDSR1_DB3_MASK   8
#define CAN2RXDSR1_DB4_MASK   16
#define CAN2RXDSR1_DB5_MASK   32
#define CAN2RXDSR1_DB6_MASK   64
#define CAN2RXDSR1_DB7_MASK   128
#define CAN2RXDSR1_DB_MASK  255
#define CAN2RXDSR1_DB_BITNUM  0


/*** CAN2RXDSR2 - MSCAN 2 Receive Data Segment Register 2; 0x000001E6 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN2RXDSR2STR;
extern volatile CAN2RXDSR2STR _CAN2RXDSR2 @(REG_BASE + 0x000001E6);
#define CAN2RXDSR2 _CAN2RXDSR2.Byte
#define CAN2RXDSR2_DB0 _CAN2RXDSR2.Bits.DB0
#define CAN2RXDSR2_DB1 _CAN2RXDSR2.Bits.DB1
#define CAN2RXDSR2_DB2 _CAN2RXDSR2.Bits.DB2
#define CAN2RXDSR2_DB3 _CAN2RXDSR2.Bits.DB3
#define CAN2RXDSR2_DB4 _CAN2RXDSR2.Bits.DB4
#define CAN2RXDSR2_DB5 _CAN2RXDSR2.Bits.DB5
#define CAN2RXDSR2_DB6 _CAN2RXDSR2.Bits.DB6
#define CAN2RXDSR2_DB7 _CAN2RXDSR2.Bits.DB7
#define CAN2RXDSR2_DB _CAN2RXDSR2.MergedBits.grpDB

