frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
#define CAN2RXDSR2_DB0_MASK   1
#define CAN2RXDSR2_DB1_MASK   2
#define CAN2RXDSR2_DB2_MASK   4
#define CAN2RXDSR2_DB3_MASK   8
#define CAN2RXDSR2_DB4_MASK   16
#define CAN2RXDSR2_DB5_MASK   32
#define CAN2RXDSR2_DB6_MASK   64
#define CAN2RXDSR2_DB7_MASK   128
#define CAN2RXDSR2_DB_MASK  255
#define CAN2RXDSR2_DB_BITNUM  0


/*** CAN2RXDSR3 - MSCAN 2 Receive Data Segment Register 3; 0x000001E7 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN2RXDSR3STR;
extern volatile CAN2RXDSR3STR _CAN2RXDSR3 @(REG_BASE + 0x000001E7);
#define CAN2RXDSR3 _CAN2RXDSR3.Byte
#define CAN2RXDSR3_DB0 _CAN2RXDSR3.Bits.DB0
#define CAN2RXDSR3_DB1 _CAN2RXDSR3.Bits.DB1
#define CAN2RXDSR3_DB2 _CAN2RXDSR3.Bits.DB2
#define CAN2RXDSR3_DB3 _CAN2RXDSR3.Bits.DB3
#define CAN2RXDSR3_DB4 _CAN2RXDSR3.Bits.DB4
#define CAN2RXDSR3_DB5 _CAN2RXDSR3.Bits.DB5
#define CAN2RXDSR3_DB6 _CAN2RXDSR3.Bits.DB6
#define CAN2RXDSR3_DB7 _CAN2RXDSR3.Bits.DB7
#define CAN2RXDSR3_DB _CAN2RXDSR3.MergedBits.grpDB

#define CAN2RXDSR3_DB0_MASK   1
#define CAN2RXDSR3_DB1_MASK   2
#define CAN2RXDSR3_DB2_MASK   4
#define CAN2RXDSR3_DB3_MASK   8
#define CAN2RXDSR3_DB4_MASK   16
#define CAN2RXDSR3_DB5_MASK   32
#define CAN2RXDSR3_DB6_MASK   64
#define CAN2RXDSR3_DB7_MASK   128
#define CAN2RXDSR3_DB_MASK  255
#define CAN2RXDSR3_DB_BITNUM  0


/*** CAN2RXDSR4 - MSCAN 2 Receive Data Segment Register 4; 0x000001E8 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN2RXDSR4STR;
extern volatile CAN2RXDSR4STR _CAN2RXDSR4 @(REG_BASE + 0x000001E8);
#define CAN2RXDSR4 _CAN2RXDSR4.Byte
#define CAN2RXDSR4_DB0 _CAN2RXDSR4.Bits.DB0
#define CAN2RXDSR4_DB1 _CAN2RXDSR4.Bits.DB1
#define CAN2RXDSR4_DB2 _CAN2RXDSR4.Bits.DB2
#define CAN2RXDSR4_DB3 _CAN2RXDSR4.Bits.DB3
#define CAN2RXDSR4_DB4 _CAN2RXDSR4.Bits.DB4
#define CAN2RXDSR4_DB5 _CAN2RXDSR4.Bits.DB5
#define CAN2RXDSR4_DB6 _CAN2RXDSR4.Bits.DB6
#define CAN2RXDSR4_DB7 _CAN2RXDSR4.Bits.DB7
#define CAN2RXDSR4_DB _CAN2RXDSR4.MergedBits.grpDB

#define CAN2RXDSR4_DB0_MASK   1
#define CAN2RXDSR4_DB1_MASK   2
#define CAN2RXDSR4_DB2_MASK   4
#define CAN2RXDSR4_DB3_MASK   8
#define CAN2RXDSR4_DB4_MASK   16
#define CAN2RXDSR4_DB5_MASK   32
#define CAN2RXDSR4_DB6_MASK   64
#define CAN2RXDSR4_DB7_MASK   128
#define CAN2RXDSR4_DB_MASK  255
#define CAN2RXDSR4_DB_BITNUM  0


/*** CAN2RXDSR5 - MSCAN 2 Receive Data Segment Register 5; 0x000001E9 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN2RXDSR5STR;
extern volatile CAN2RXDSR5STR _CAN2RXDSR5 @(REG_BASE + 0x000001E9);
#define CAN2RXDSR5 _CAN2RXDSR5.Byte
#define CAN2RXDSR5_DB0 _CAN2RXDSR5.Bits.DB0
#define CAN2RXDSR5_DB1 _CAN2RXDSR5.Bits.DB1
#define CAN2RXDSR5_DB2 _CAN2RXDSR5.Bits.DB2
#define CAN2RXDSR5_DB3 _CAN2RXDSR5.Bits.DB3
#define CAN2RXDSR5_DB4 _CAN2RXDSR5.Bits.DB4
#define CAN2RXDSR5_DB5 _CAN2RXDSR5.Bits.DB5
#define CAN2RXDSR5_DB6 _CAN2RXDSR5.Bits.DB6
#define CAN2RXDSR5_DB7 _CAN2RXDSR5.Bits.DB7
#define CAN2RXDSR5_DB _CAN2RXDSR5.MergedBits.grpDB

#define CAN2RXDSR5_DB0_MASK   1
#define CAN2RXDSR5_DB1_MASK   2
#define CAN2RXDSR5_DB2_MASK   4
#define CAN2RXDSR5_DB3_MASK   8
#define CAN2RXDSR5_DB4_MASK   16
#define CAN2RXDSR5_DB5_MASK   32
#define CAN2RXDSR5_DB6_MASK   64
#define CAN2RXDSR5_DB7_MASK   128
#define CAN2RXDSR5_DB_MASK  255
#define CAN2RXDSR5_DB_BITNUM  0


/*** CAN2RXDSR6 - MSCAN 2 Receive Data Segment Register 6; 0x000001EA ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN2RXDSR6STR;
