frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
extern volatile CAN2RXDSR6STR _CAN2RXDSR6 @(REG_BASE + 0x000001EA);
#define CAN2RXDSR6 _CAN2RXDSR6.Byte
#define CAN2RXDSR6_DB0 _CAN2RXDSR6.Bits.DB0
#define CAN2RXDSR6_DB1 _CAN2RXDSR6.Bits.DB1
#define CAN2RXDSR6_DB2 _CAN2RXDSR6.Bits.DB2
#define CAN2RXDSR6_DB3 _CAN2RXDSR6.Bits.DB3
#define CAN2RXDSR6_DB4 _CAN2RXDSR6.Bits.DB4
#define CAN2RXDSR6_DB5 _CAN2RXDSR6.Bits.DB5
#define CAN2RXDSR6_DB6 _CAN2RXDSR6.Bits.DB6
#define CAN2RXDSR6_DB7 _CAN2RXDSR6.Bits.DB7
#define CAN2RXDSR6_DB _CAN2RXDSR6.MergedBits.grpDB

#define CAN2RXDSR6_DB0_MASK   1
#define CAN2RXDSR6_DB1_MASK   2
#define CAN2RXDSR6_DB2_MASK   4
#define CAN2RXDSR6_DB3_MASK   8
#define CAN2RXDSR6_DB4_MASK   16
#define CAN2RXDSR6_DB5_MASK   32
#define CAN2RXDSR6_DB6_MASK   64
#define CAN2RXDSR6_DB7_MASK   128
#define CAN2RXDSR6_DB_MASK  255
#define CAN2RXDSR6_DB_BITNUM  0


/*** CAN2RXDSR7 - MSCAN 2 Receive Data Segment Register 7; 0x000001EB ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN2RXDSR7STR;
extern volatile CAN2RXDSR7STR _CAN2RXDSR7 @(REG_BASE + 0x000001EB);
#define CAN2RXDSR7 _CAN2RXDSR7.Byte
#define CAN2RXDSR7_DB0 _CAN2RXDSR7.Bits.DB0
#define CAN2RXDSR7_DB1 _CAN2RXDSR7.Bits.DB1
#define CAN2RXDSR7_DB2 _CAN2RXDSR7.Bits.DB2
#define CAN2RXDSR7_DB3 _CAN2RXDSR7.Bits.DB3
#define CAN2RXDSR7_DB4 _CAN2RXDSR7.Bits.DB4
#define CAN2RXDSR7_DB5 _CAN2RXDSR7.Bits.DB5
#define CAN2RXDSR7_DB6 _CAN2RXDSR7.Bits.DB6
#define CAN2RXDSR7_DB7 _CAN2RXDSR7.Bits.DB7
#define CAN2RXDSR7_DB _CAN2RXDSR7.MergedBits.grpDB

#define CAN2RXDSR7_DB0_MASK   1
#define CAN2RXDSR7_DB1_MASK   2
#define CAN2RXDSR7_DB2_MASK   4
#define CAN2RXDSR7_DB3_MASK   8
#define CAN2RXDSR7_DB4_MASK   16
#define CAN2RXDSR7_DB5_MASK   32
#define CAN2RXDSR7_DB6_MASK   64
#define CAN2RXDSR7_DB7_MASK   128
#define CAN2RXDSR7_DB_MASK  255
#define CAN2RXDSR7_DB_BITNUM  0


/*** CAN2RXDLR - MSCAN 2 Receive Data Length Register; 0x000001EC ***/
typedef union {
  byte Byte;
  struct {
    byte DLC0        :1;                                       /* Data Length Code Bit 0 */
    byte DLC1        :1;                                       /* Data Length Code Bit 1 */
    byte DLC2        :1;                                       /* Data Length Code Bit 2 */
    byte DLC3        :1;                                       /* Data Length Code Bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpDLC  :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN2RXDLRSTR;
extern volatile CAN2RXDLRSTR _CAN2RXDLR @(REG_BASE + 0x000001EC);
#define CAN2RXDLR _CAN2RXDLR.Byte
#define CAN2RXDLR_DLC0 _CAN2RXDLR.Bits.DLC0
#define CAN2RXDLR_DLC1 _CAN2RXDLR.Bits.DLC1
#define CAN2RXDLR_DLC2 _CAN2RXDLR.Bits.DLC2
#define CAN2RXDLR_DLC3 _CAN2RXDLR.Bits.DLC3
#define CAN2RXDLR_DLC _CAN2RXDLR.MergedBits.grpDLC

#define CAN2RXDLR_DLC0_MASK   1
#define CAN2RXDLR_DLC1_MASK   2
#define CAN2RXDLR_DLC2_MASK   4
#define CAN2RXDLR_DLC3_MASK   8
#define CAN2RXDLR_DLC_MASK  15
#define CAN2RXDLR_DLC_BITNUM  0


/*** CAN2RXTSR - MSCAN 2 Receive Time Stamp Register; 0x000001EE ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** CAN2RXTSRH - MSCAN 2 Receive Time Stamp Register High; 0x000001EE ***/
    union {
      byte Byte;
      struct {
        byte TSR8        :1;                                       /* Time Stamp Bit 8 */
        byte TSR9        :1;                                       /* Time Stamp Bit 9 */
        byte TSR10       :1;                                       /* Time Stamp Bit 10 */
        byte TSR11       :1;                                       /* Time Stamp Bit 11 */
        byte TSR12       :1;                                       /* Time Stamp Bit 12 */
        byte TSR13       :1;                                       /* Time Stamp Bit 13 */
        byte TSR14       :1;                                       /* Time Stamp Bit 14 */
        byte TSR15       :1;                                       /* Time Stamp Bit 15 */
      } Bits;
      struct {
        byte grpTSR_8 :8;
      } MergedBits;
    } CAN2RXTSRHSTR;
    #define CAN2RXTSRH _CAN2RXTSR.Overlap_STR.CAN2RXTSRHSTR.Byte
    #define CAN2RXTSRH_TSR8 _CAN2RXTSR.Overlap_STR.CAN2RXTSRHSTR.Bits.TSR8
    #define CAN2RXTSRH_TSR9 _CAN2RXTSR.Overlap_STR.CAN2RXTSRHSTR.Bits.TSR9
    #define CAN2RXTSRH_TSR10 _CAN2RXTSR.Overlap_STR.CAN2RXTSRHSTR.Bits.TSR10
    #define CAN2RXTSRH_TSR11 _CAN2RXTSR.Overlap_STR.CAN2RXTSRHSTR.Bits.TSR11
    #define CAN2RXTSRH_TSR12 _CAN2RXTSR.Overlap_STR.CAN2RXTSRHSTR.Bits.TSR12
    #define CAN2RXTSRH_TSR13 _CAN2RXTSR.Overlap_STR.CAN2RXTSRHSTR.Bits.TSR13
    #define CAN2RXTSRH_TSR14 _CAN2RXTSR.Overlap_STR.CAN2RXTSRHSTR.Bits.TSR14
    #define CAN2RXTSRH_TSR15 _CAN2RXTSR.Overlap_STR.CAN2RXTSRHSTR.Bits.TSR15
    
    #define CAN2RXTSRH_TSR_8 _CAN2RXTSR.Overlap_STR.CAN2RXTSRHSTR.MergedBits.grpTSR_8
    #define CAN2RXTSRH_TSR CAN2RXTSRH_TSR_8
    
    #define CAN2RXTSRH_TSR8_MASK   1
    #define CAN2RXTSRH_TSR9_MASK   2
    #define CAN2RXTSRH_TSR10_MASK   4
    #define CAN2RXTSRH_TSR11_MASK   8
    #define CAN2RXTSRH_TSR12_MASK   16
    #define CAN2RXTSRH_TSR13_MASK   32
    #define CAN2RXTSRH_TSR14_MASK   64
    #define CAN2RXTSRH_TSR15_MASK   128
    #define CAN2RXTSRH_TSR_8_MASK  255
    #define CAN2RXTSRH_TSR_8_BITNUM  0


    /*** CAN2RXTSRL - MSCAN 2 Receive Time Stamp Register Low; 0x000001EF ***/
    union {
      byte Byte;
      struct {
        byte TSR0        :1;                                       /* Time Stamp Bit 0 */
        byte TSR1        :1;                                       /* Time Stamp Bit 1 */
        byte TSR2        :1;                                       /* Time Stamp Bit 2 */
        byte TSR3        :1;                                       /* Time Stamp Bit 3 */
        byte TSR4        :1;                                       /* Time Stamp Bit 4 */
        byte TSR5        :1;                                       /* Time Stamp Bit 5 */
        byte TSR6        :1;                                       /* Time Stamp Bit 6 */
        byte TSR7        :1;                                       /* Time Stamp Bit 7 */
      } Bits;
      struct {
        byte grpTSR :8;
      } MergedBits;
    } CAN2RXTSRLSTR;
    #define CAN2RXTSRL _CAN2RXTSR.Overlap_STR.CAN2RXTSRLSTR.Byte
    #define CAN2RXTSRL_TSR0 _CAN2RXTSR.Overlap_STR.CAN2RXTSRLSTR.Bits.TSR0
    #define CAN2RXTSRL_TSR1 _CAN2RXTSR.Overlap_STR.CAN2RXTSRLSTR.Bits.TSR1
    #define CAN2RXTSRL_TSR2 _CAN2RXTSR.Overlap_STR.CAN2RXTSRLSTR.Bits.TSR2
    #define CAN2RXTSRL_TSR3 _CAN2RXTSR.Overlap_STR.CAN2RXTSRLSTR.Bits.TSR3
    #define CAN2RXTSRL_TSR4 _CAN2RXTSR.Overlap_STR.CAN2RXTSRLSTR.Bits.TSR4
    #define CAN2RXTSRL_TSR5 _CAN2RXTSR.Overlap_STR.CAN2RXTSRLSTR.Bits.TSR5
    #define CAN2RXTSRL_TSR6 _CAN2RXTSR.Overlap_STR.CAN2RXTSRLSTR.Bits.TSR6
    #define CAN2RXTSRL_TSR7 _CAN2RXTSR.Overlap_STR.CAN2RXTSRLSTR.Bits.TSR7
    
    #define CAN2RXTSRL_TSR _CAN2RXTSR.Overlap_STR.CAN2RXTSRLSTR.MergedBits.grpTSR
    
    #define CAN2RXTSRL_TSR0_MASK   1
    #define CAN2RXTSRL_TSR1_MASK   2
    #define CAN2RXTSRL_TSR2_MASK   4
    #define CAN2RXTSRL_TSR3_MASK   8
    #define CAN2RXTSRL_TSR4_MASK   16
    #define CAN2RXTSRL_TSR5_MASK   32
    #define CAN2RXTSRL_TSR6_MASK   64
    #define CAN2RXTSRL_TSR7_MASK   128
    #define CAN2RXTSRL_TSR_MASK  255
    #define CAN2RXTSRL_TSR_BITNUM  0

  } Overlap_STR;

