frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
extern volatile CAN2TXIDR1STR _CAN2TXIDR1 @(REG_BASE + 0x000001F1);
#define CAN2TXIDR1 _CAN2TXIDR1.Byte
#define CAN2TXIDR1_ID15 _CAN2TXIDR1.Bits.ID15
#define CAN2TXIDR1_ID16 _CAN2TXIDR1.Bits.ID16
#define CAN2TXIDR1_ID17 _CAN2TXIDR1.Bits.ID17
#define CAN2TXIDR1_IDE _CAN2TXIDR1.Bits.IDE
#define CAN2TXIDR1_SRR _CAN2TXIDR1.Bits.SRR
#define CAN2TXIDR1_ID18 _CAN2TXIDR1.Bits.ID18
#define CAN2TXIDR1_ID19 _CAN2TXIDR1.Bits.ID19
#define CAN2TXIDR1_ID20 _CAN2TXIDR1.Bits.ID20
#define CAN2TXIDR1_ID_15 _CAN2TXIDR1.MergedBits.grpID_15
#define CAN2TXIDR1_ID_18 _CAN2TXIDR1.MergedBits.grpID_18
#define CAN2TXIDR1_ID CAN2TXIDR1_ID_15

#define CAN2TXIDR1_ID15_MASK   1
#define CAN2TXIDR1_ID16_MASK   2
#define CAN2TXIDR1_ID17_MASK   4
#define CAN2TXIDR1_IDE_MASK   8
#define CAN2TXIDR1_SRR_MASK   16
#define CAN2TXIDR1_ID18_MASK   32
#define CAN2TXIDR1_ID19_MASK   64
#define CAN2TXIDR1_ID20_MASK   128
#define CAN2TXIDR1_ID_15_MASK  7
#define CAN2TXIDR1_ID_15_BITNUM  0
#define CAN2TXIDR1_ID_18_MASK  224
#define CAN2TXIDR1_ID_18_BITNUM  5


/*** CAN2TXIDR2 - MSCAN 2 Transmit Identifier Register 2; 0x000001F2 ***/
typedef union {
  byte Byte;
  struct {
    byte ID7         :1;                                       /* Extended format identifier Bit 7 */
    byte ID8         :1;                                       /* Extended format identifier Bit 8 */
    byte ID9         :1;                                       /* Extended format identifier Bit 9 */
    byte ID10        :1;                                       /* Extended format identifier Bit 10 */
    byte ID11        :1;                                       /* Extended format identifier Bit 11 */
    byte ID12        :1;                                       /* Extended format identifier Bit 12 */
    byte ID13        :1;                                       /* Extended format identifier Bit 13 */
    byte ID14        :1;                                       /* Extended format identifier Bit 14 */
  } Bits;
  struct {
    byte grpID_7 :8;
  } MergedBits;
} CAN2TXIDR2STR;
extern volatile CAN2TXIDR2STR _CAN2TXIDR2 @(REG_BASE + 0x000001F2);
#define CAN2TXIDR2 _CAN2TXIDR2.Byte
#define CAN2TXIDR2_ID7 _CAN2TXIDR2.Bits.ID7
#define CAN2TXIDR2_ID8 _CAN2TXIDR2.Bits.ID8
#define CAN2TXIDR2_ID9 _CAN2TXIDR2.Bits.ID9
#define CAN2TXIDR2_ID10 _CAN2TXIDR2.Bits.ID10
#define CAN2TXIDR2_ID11 _CAN2TXIDR2.Bits.ID11
#define CAN2TXIDR2_ID12 _CAN2TXIDR2.Bits.ID12
#define CAN2TXIDR2_ID13 _CAN2TXIDR2.Bits.ID13
#define CAN2TXIDR2_ID14 _CAN2TXIDR2.Bits.ID14
#define CAN2TXIDR2_ID_7 _CAN2TXIDR2.MergedBits.grpID_7
#define CAN2TXIDR2_ID CAN2TXIDR2_ID_7

#define CAN2TXIDR2_ID7_MASK   1
#define CAN2TXIDR2_ID8_MASK   2
#define CAN2TXIDR2_ID9_MASK   4
#define CAN2TXIDR2_ID10_MASK   8
#define CAN2TXIDR2_ID11_MASK   16
#define CAN2TXIDR2_ID12_MASK   32
#define CAN2TXIDR2_ID13_MASK   64
#define CAN2TXIDR2_ID14_MASK   128
#define CAN2TXIDR2_ID_7_MASK  255
#define CAN2TXIDR2_ID_7_BITNUM  0


/*** CAN2TXIDR3 - MSCAN 2 Transmit Identifier Register 3; 0x000001F3 ***/
typedef union {
  byte Byte;
  struct {
    byte RTR         :1;                                       /* Remote Transmission Request */
    byte ID0         :1;                                       /* Extended format identifier Bit 0 */
    byte ID1         :1;                                       /* Extended format identifier Bit 1 */
    byte ID2         :1;                                       /* Extended format identifier Bit 2 */
    byte ID3         :1;                                       /* Extended format identifier Bit 3 */
    byte ID4         :1;                                       /* Extended format identifier Bit 4 */
    byte ID5         :1;                                       /* Extended format identifier Bit 5 */
    byte ID6         :1;                                       /* Extended format identifier Bit 6 */
  } Bits;
  struct {
    byte         :1;
    byte grpID   :7;
  } MergedBits;
} CAN2TXIDR3STR;
extern volatile CAN2TXIDR3STR _CAN2TXIDR3 @(REG_BASE + 0x000001F3);
#define CAN2TXIDR3 _CAN2TXIDR3.Byte
#define CAN2TXIDR3_RTR _CAN2TXIDR3.Bits.RTR
#define CAN2TXIDR3_ID0 _CAN2TXIDR3.Bits.ID0
#define CAN2TXIDR3_ID1 _CAN2TXIDR3.Bits.ID1
#define CAN2TXIDR3_ID2 _CAN2TXIDR3.Bits.ID2
#define CAN2TXIDR3_ID3 _CAN2TXIDR3.Bits.ID3
#define CAN2TXIDR3_ID4 _CAN2TXIDR3.Bits.ID4
#define CAN2TXIDR3_ID5 _CAN2TXIDR3.Bits.ID5
#define CAN2TXIDR3_ID6 _CAN2TXIDR3.Bits.ID6
#define CAN2TXIDR3_ID _CAN2TXIDR3.MergedBits.grpID

#define CAN2TXIDR3_RTR_MASK   1
#define CAN2TXIDR3_ID0_MASK   2
#define CAN2TXIDR3_ID1_MASK   4
#define CAN2TXIDR3_ID2_MASK   8
#define CAN2TXIDR3_ID3_MASK   16
#define CAN2TXIDR3_ID4_MASK   32
#define CAN2TXIDR3_ID5_MASK   64
#define CAN2TXIDR3_ID6_MASK   128
#define CAN2TXIDR3_ID_MASK  254
#define CAN2TXIDR3_ID_BITNUM  1


/*** CAN2TXDSR0 - MSCAN 2 Transmit Data Segment Register 0; 0x000001F4 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN2TXDSR0STR;
extern volatile CAN2TXDSR0STR _CAN2TXDSR0 @(REG_BASE + 0x000001F4);
#define CAN2TXDSR0 _CAN2TXDSR0.Byte
#define CAN2TXDSR0_DB0 _CAN2TXDSR0.Bits.DB0
#define CAN2TXDSR0_DB1 _CAN2TXDSR0.Bits.DB1
#define CAN2TXDSR0_DB2 _CAN2TXDSR0.Bits.DB2
#define CAN2TXDSR0_DB3 _CAN2TXDSR0.Bits.DB3
#define CAN2TXDSR0_DB4 _CAN2TXDSR0.Bits.DB4
#define CAN2TXDSR0_DB5 _CAN2TXDSR0.Bits.DB5
#define CAN2TXDSR0_DB6 _CAN2TXDSR0.Bits.DB6
#define CAN2TXDSR0_DB7 _CAN2TXDSR0.Bits.DB7
/* CAN2TXDSR_ARR: Access 8 CAN2TXDSRx registers in a array */
#define CAN2TXDSR_ARR ((Byte *) &CAN2TXDSR0)
#define CAN2TXDSR0_DB _CAN2TXDSR0.MergedBits.grpDB

#define CAN2TXDSR0_DB0_MASK   1
#define CAN2TXDSR0_DB1_MASK   2
#define CAN2TXDSR0_DB2_MASK   4
#define CAN2TXDSR0_DB3_MASK   8
#define CAN2TXDSR0_DB4_MASK   16
#define CAN2TXDSR0_DB5_MASK   32
#define CAN2TXDSR0_DB6_MASK   64
#define CAN2TXDSR0_DB7_MASK   128
#define CAN2TXDSR0_DB_MASK  255
#define CAN2TXDSR0_DB_BITNUM  0


/*** CAN2TXDSR1 - MSCAN 2 Transmit Data Segment Register 1; 0x000001F5 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN2TXDSR1STR;
