frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
extern volatile CAN2TXDSR1STR _CAN2TXDSR1 @(REG_BASE + 0x000001F5);
#define CAN2TXDSR1 _CAN2TXDSR1.Byte
#define CAN2TXDSR1_DB0 _CAN2TXDSR1.Bits.DB0
#define CAN2TXDSR1_DB1 _CAN2TXDSR1.Bits.DB1
#define CAN2TXDSR1_DB2 _CAN2TXDSR1.Bits.DB2
#define CAN2TXDSR1_DB3 _CAN2TXDSR1.Bits.DB3
#define CAN2TXDSR1_DB4 _CAN2TXDSR1.Bits.DB4
#define CAN2TXDSR1_DB5 _CAN2TXDSR1.Bits.DB5
#define CAN2TXDSR1_DB6 _CAN2TXDSR1.Bits.DB6
#define CAN2TXDSR1_DB7 _CAN2TXDSR1.Bits.DB7
#define CAN2TXDSR1_DB _CAN2TXDSR1.MergedBits.grpDB

#define CAN2TXDSR1_DB0_MASK   1
#define CAN2TXDSR1_DB1_MASK   2
#define CAN2TXDSR1_DB2_MASK   4
#define CAN2TXDSR1_DB3_MASK   8
#define CAN2TXDSR1_DB4_MASK   16
#define CAN2TXDSR1_DB5_MASK   32
#define CAN2TXDSR1_DB6_MASK   64
#define CAN2TXDSR1_DB7_MASK   128
#define CAN2TXDSR1_DB_MASK  255
#define CAN2TXDSR1_DB_BITNUM  0


/*** CAN2TXDSR2 - MSCAN 2 Transmit Data Segment Register 2; 0x000001F6 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN2TXDSR2STR;
extern volatile CAN2TXDSR2STR _CAN2TXDSR2 @(REG_BASE + 0x000001F6);
#define CAN2TXDSR2 _CAN2TXDSR2.Byte
#define CAN2TXDSR2_DB0 _CAN2TXDSR2.Bits.DB0
#define CAN2TXDSR2_DB1 _CAN2TXDSR2.Bits.DB1
#define CAN2TXDSR2_DB2 _CAN2TXDSR2.Bits.DB2
#define CAN2TXDSR2_DB3 _CAN2TXDSR2.Bits.DB3
#define CAN2TXDSR2_DB4 _CAN2TXDSR2.Bits.DB4
#define CAN2TXDSR2_DB5 _CAN2TXDSR2.Bits.DB5
#define CAN2TXDSR2_DB6 _CAN2TXDSR2.Bits.DB6
#define CAN2TXDSR2_DB7 _CAN2TXDSR2.Bits.DB7
#define CAN2TXDSR2_DB _CAN2TXDSR2.MergedBits.grpDB

#define CAN2TXDSR2_DB0_MASK   1
#define CAN2TXDSR2_DB1_MASK   2
#define CAN2TXDSR2_DB2_MASK   4
#define CAN2TXDSR2_DB3_MASK   8
#define CAN2TXDSR2_DB4_MASK   16
#define CAN2TXDSR2_DB5_MASK   32
#define CAN2TXDSR2_DB6_MASK   64
#define CAN2TXDSR2_DB7_MASK   128
#define CAN2TXDSR2_DB_MASK  255
#define CAN2TXDSR2_DB_BITNUM  0


/*** CAN2TXDSR3 - MSCAN 2 Transmit Data Segment Register 3; 0x000001F7 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN2TXDSR3STR;
extern volatile CAN2TXDSR3STR _CAN2TXDSR3 @(REG_BASE + 0x000001F7);
#define CAN2TXDSR3 _CAN2TXDSR3.Byte
#define CAN2TXDSR3_DB0 _CAN2TXDSR3.Bits.DB0
#define CAN2TXDSR3_DB1 _CAN2TXDSR3.Bits.DB1
#define CAN2TXDSR3_DB2 _CAN2TXDSR3.Bits.DB2
#define CAN2TXDSR3_DB3 _CAN2TXDSR3.Bits.DB3
#define CAN2TXDSR3_DB4 _CAN2TXDSR3.Bits.DB4
#define CAN2TXDSR3_DB5 _CAN2TXDSR3.Bits.DB5
#define CAN2TXDSR3_DB6 _CAN2TXDSR3.Bits.DB6
#define CAN2TXDSR3_DB7 _CAN2TXDSR3.Bits.DB7
#define CAN2TXDSR3_DB _CAN2TXDSR3.MergedBits.grpDB

#define CAN2TXDSR3_DB0_MASK   1
#define CAN2TXDSR3_DB1_MASK   2
#define CAN2TXDSR3_DB2_MASK   4
#define CAN2TXDSR3_DB3_MASK   8
#define CAN2TXDSR3_DB4_MASK   16
#define CAN2TXDSR3_DB5_MASK   32
#define CAN2TXDSR3_DB6_MASK   64
#define CAN2TXDSR3_DB7_MASK   128
#define CAN2TXDSR3_DB_MASK  255
#define CAN2TXDSR3_DB_BITNUM  0


/*** CAN2TXDSR4 - MSCAN 2 Transmit Data Segment Register 4; 0x000001F8 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN2TXDSR4STR;
extern volatile CAN2TXDSR4STR _CAN2TXDSR4 @(REG_BASE + 0x000001F8);
#define CAN2TXDSR4 _CAN2TXDSR4.Byte
#define CAN2TXDSR4_DB0 _CAN2TXDSR4.Bits.DB0
#define CAN2TXDSR4_DB1 _CAN2TXDSR4.Bits.DB1
#define CAN2TXDSR4_DB2 _CAN2TXDSR4.Bits.DB2
#define CAN2TXDSR4_DB3 _CAN2TXDSR4.Bits.DB3
#define CAN2TXDSR4_DB4 _CAN2TXDSR4.Bits.DB4
#define CAN2TXDSR4_DB5 _CAN2TXDSR4.Bits.DB5
#define CAN2TXDSR4_DB6 _CAN2TXDSR4.Bits.DB6
#define CAN2TXDSR4_DB7 _CAN2TXDSR4.Bits.DB7
#define CAN2TXDSR4_DB _CAN2TXDSR4.MergedBits.grpDB

#define CAN2TXDSR4_DB0_MASK   1
#define CAN2TXDSR4_DB1_MASK   2
#define CAN2TXDSR4_DB2_MASK   4
#define CAN2TXDSR4_DB3_MASK   8
#define CAN2TXDSR4_DB4_MASK   16
#define CAN2TXDSR4_DB5_MASK   32
#define CAN2TXDSR4_DB6_MASK   64
#define CAN2TXDSR4_DB7_MASK   128
#define CAN2TXDSR4_DB_MASK  255
#define CAN2TXDSR4_DB_BITNUM  0


/*** CAN2TXDSR5 - MSCAN 2 Transmit Data Segment Register 5; 0x000001F9 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN2TXDSR5STR;
extern volatile CAN2TXDSR5STR _CAN2TXDSR5 @(REG_BASE + 0x000001F9);
#define CAN2TXDSR5 _CAN2TXDSR5.Byte
#define CAN2TXDSR5_DB0 _CAN2TXDSR5.Bits.DB0
#define CAN2TXDSR5_DB1 _CAN2TXDSR5.Bits.DB1
#define CAN2TXDSR5_DB2 _CAN2TXDSR5.Bits.DB2
#define CAN2TXDSR5_DB3 _CAN2TXDSR5.Bits.DB3
#define CAN2TXDSR5_DB4 _CAN2TXDSR5.Bits.DB4
#define CAN2TXDSR5_DB5 _CAN2TXDSR5.Bits.DB5
#define CAN2TXDSR5_DB6 _CAN2TXDSR5.Bits.DB6
#define CAN2TXDSR5_DB7 _CAN2TXDSR5.Bits.DB7
#define CAN2TXDSR5_DB _CAN2TXDSR5.MergedBits.grpDB

#define CAN2TXDSR5_DB0_MASK   1
#define CAN2TXDSR5_DB1_MASK   2
#define CAN2TXDSR5_DB2_MASK   4
#define CAN2TXDSR5_DB3_MASK   8
#define CAN2TXDSR5_DB4_MASK   16
#define CAN2TXDSR5_DB5_MASK   32
#define CAN2TXDSR5_DB6_MASK   64
#define CAN2TXDSR5_DB7_MASK   128
#define CAN2TXDSR5_DB_MASK  255
#define CAN2TXDSR5_DB_BITNUM  0


/*** CAN2TXDSR6 - MSCAN 2 Transmit Data Segment Register 6; 0x000001FA ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN2TXDSR6STR;
extern volatile CAN2TXDSR6STR _CAN2TXDSR6 @(REG_BASE + 0x000001FA);
#define CAN2TXDSR6 _CAN2TXDSR6.Byte
#define CAN2TXDSR6_DB0 _CAN2TXDSR6.Bits.DB0
#define CAN2TXDSR6_DB1 _CAN2TXDSR6.Bits.DB1
#define CAN2TXDSR6_DB2 _CAN2TXDSR6.Bits.DB2
#define CAN2TXDSR6_DB3 _CAN2TXDSR6.Bits.DB3
#define CAN2TXDSR6_DB4 _CAN2TXDSR6.Bits.DB4
#define CAN2TXDSR6_DB5 _CAN2TXDSR6.Bits.DB5
#define CAN2TXDSR6_DB6 _CAN2TXDSR6.Bits.DB6
#define CAN2TXDSR6_DB7 _CAN2TXDSR6.Bits.DB7
#define CAN2TXDSR6_DB _CAN2TXDSR6.MergedBits.grpDB

