frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
#define CAN2TXDSR6_DB0_MASK   1
#define CAN2TXDSR6_DB1_MASK   2
#define CAN2TXDSR6_DB2_MASK   4
#define CAN2TXDSR6_DB3_MASK   8
#define CAN2TXDSR6_DB4_MASK   16
#define CAN2TXDSR6_DB5_MASK   32
#define CAN2TXDSR6_DB6_MASK   64
#define CAN2TXDSR6_DB7_MASK   128
#define CAN2TXDSR6_DB_MASK  255
#define CAN2TXDSR6_DB_BITNUM  0


/*** CAN2TXDSR7 - MSCAN 2 Transmit Data Segment Register 7; 0x000001FB ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN2TXDSR7STR;
extern volatile CAN2TXDSR7STR _CAN2TXDSR7 @(REG_BASE + 0x000001FB);
#define CAN2TXDSR7 _CAN2TXDSR7.Byte
#define CAN2TXDSR7_DB0 _CAN2TXDSR7.Bits.DB0
#define CAN2TXDSR7_DB1 _CAN2TXDSR7.Bits.DB1
#define CAN2TXDSR7_DB2 _CAN2TXDSR7.Bits.DB2
#define CAN2TXDSR7_DB3 _CAN2TXDSR7.Bits.DB3
#define CAN2TXDSR7_DB4 _CAN2TXDSR7.Bits.DB4
#define CAN2TXDSR7_DB5 _CAN2TXDSR7.Bits.DB5
#define CAN2TXDSR7_DB6 _CAN2TXDSR7.Bits.DB6
#define CAN2TXDSR7_DB7 _CAN2TXDSR7.Bits.DB7
#define CAN2TXDSR7_DB _CAN2TXDSR7.MergedBits.grpDB

#define CAN2TXDSR7_DB0_MASK   1
#define CAN2TXDSR7_DB1_MASK   2
#define CAN2TXDSR7_DB2_MASK   4
#define CAN2TXDSR7_DB3_MASK   8
#define CAN2TXDSR7_DB4_MASK   16
#define CAN2TXDSR7_DB5_MASK   32
#define CAN2TXDSR7_DB6_MASK   64
#define CAN2TXDSR7_DB7_MASK   128
#define CAN2TXDSR7_DB_MASK  255
#define CAN2TXDSR7_DB_BITNUM  0


/*** CAN2TXDLR - MSCAN 2 Transmit Data Length Register; 0x000001FC ***/
typedef union {
  byte Byte;
  struct {
    byte DLC0        :1;                                       /* Data Length Code Bit 0 */
    byte DLC1        :1;                                       /* Data Length Code Bit 1 */
    byte DLC2        :1;                                       /* Data Length Code Bit 2 */
    byte DLC3        :1;                                       /* Data Length Code Bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpDLC  :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN2TXDLRSTR;
extern volatile CAN2TXDLRSTR _CAN2TXDLR @(REG_BASE + 0x000001FC);
#define CAN2TXDLR _CAN2TXDLR.Byte
#define CAN2TXDLR_DLC0 _CAN2TXDLR.Bits.DLC0
#define CAN2TXDLR_DLC1 _CAN2TXDLR.Bits.DLC1
#define CAN2TXDLR_DLC2 _CAN2TXDLR.Bits.DLC2
#define CAN2TXDLR_DLC3 _CAN2TXDLR.Bits.DLC3
#define CAN2TXDLR_DLC _CAN2TXDLR.MergedBits.grpDLC

#define CAN2TXDLR_DLC0_MASK   1
#define CAN2TXDLR_DLC1_MASK   2
#define CAN2TXDLR_DLC2_MASK   4
#define CAN2TXDLR_DLC3_MASK   8
#define CAN2TXDLR_DLC_MASK  15
#define CAN2TXDLR_DLC_BITNUM  0


/*** CAN2TXTBPR - MSCAN 2 Transmit Buffer Priority; 0x000001FD ***/
typedef union {
  byte Byte;
  struct {
    byte PRIO0       :1;                                       /* Transmit Buffer Priority Bit 0 */
    byte PRIO1       :1;                                       /* Transmit Buffer Priority Bit 1 */
    byte PRIO2       :1;                                       /* Transmit Buffer Priority Bit 2 */
    byte PRIO3       :1;                                       /* Transmit Buffer Priority Bit 3 */
    byte PRIO4       :1;                                       /* Transmit Buffer Priority Bit 4 */
    byte PRIO5       :1;                                       /* Transmit Buffer Priority Bit 5 */
    byte PRIO6       :1;                                       /* Transmit Buffer Priority Bit 6 */
    byte PRIO7       :1;                                       /* Transmit Buffer Priority Bit 7 */
  } Bits;
  struct {
    byte grpPRIO :8;
  } MergedBits;
} CAN2TXTBPRSTR;
extern volatile CAN2TXTBPRSTR _CAN2TXTBPR @(REG_BASE + 0x000001FD);
#define CAN2TXTBPR _CAN2TXTBPR.Byte
#define CAN2TXTBPR_PRIO0 _CAN2TXTBPR.Bits.PRIO0
#define CAN2TXTBPR_PRIO1 _CAN2TXTBPR.Bits.PRIO1
#define CAN2TXTBPR_PRIO2 _CAN2TXTBPR.Bits.PRIO2
#define CAN2TXTBPR_PRIO3 _CAN2TXTBPR.Bits.PRIO3
#define CAN2TXTBPR_PRIO4 _CAN2TXTBPR.Bits.PRIO4
#define CAN2TXTBPR_PRIO5 _CAN2TXTBPR.Bits.PRIO5
#define CAN2TXTBPR_PRIO6 _CAN2TXTBPR.Bits.PRIO6
#define CAN2TXTBPR_PRIO7 _CAN2TXTBPR.Bits.PRIO7
#define CAN2TXTBPR_PRIO _CAN2TXTBPR.MergedBits.grpPRIO

#define CAN2TXTBPR_PRIO0_MASK   1
#define CAN2TXTBPR_PRIO1_MASK   2
#define CAN2TXTBPR_PRIO2_MASK   4
#define CAN2TXTBPR_PRIO3_MASK   8
#define CAN2TXTBPR_PRIO4_MASK   16
#define CAN2TXTBPR_PRIO5_MASK   32
#define CAN2TXTBPR_PRIO6_MASK   64
#define CAN2TXTBPR_PRIO7_MASK   128
#define CAN2TXTBPR_PRIO_MASK  255
#define CAN2TXTBPR_PRIO_BITNUM  0


/*** CAN2TXTSR - MSCAN 2 Transmit Time Stamp Register; 0x000001FE ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** CAN2TXTSRH - MSCAN 2 Transmit Time Stamp Register High; 0x000001FE ***/
    union {
      byte Byte;
      struct {
        byte TSR8        :1;                                       /* Time Stamp Bit 8 */
        byte TSR9        :1;                                       /* Time Stamp Bit 9 */
        byte TSR10       :1;                                       /* Time Stamp Bit 10 */
        byte TSR11       :1;                                       /* Time Stamp Bit 11 */
        byte TSR12       :1;                                       /* Time Stamp Bit 12 */
        byte TSR13       :1;                                       /* Time Stamp Bit 13 */
        byte TSR14       :1;                                       /* Time Stamp Bit 14 */
        byte TSR15       :1;                                       /* Time Stamp Bit 15 */
      } Bits;
      struct {
        byte grpTSR_8 :8;
      } MergedBits;
    } CAN2TXTSRHSTR;
    #define CAN2TXTSRH _CAN2TXTSR.Overlap_STR.CAN2TXTSRHSTR.Byte
    #define CAN2TXTSRH_TSR8 _CAN2TXTSR.Overlap_STR.CAN2TXTSRHSTR.Bits.TSR8
    #define CAN2TXTSRH_TSR9 _CAN2TXTSR.Overlap_STR.CAN2TXTSRHSTR.Bits.TSR9
    #define CAN2TXTSRH_TSR10 _CAN2TXTSR.Overlap_STR.CAN2TXTSRHSTR.Bits.TSR10
    #define CAN2TXTSRH_TSR11 _CAN2TXTSR.Overlap_STR.CAN2TXTSRHSTR.Bits.TSR11
    #define CAN2TXTSRH_TSR12 _CAN2TXTSR.Overlap_STR.CAN2TXTSRHSTR.Bits.TSR12
    #define CAN2TXTSRH_TSR13 _CAN2TXTSR.Overlap_STR.CAN2TXTSRHSTR.Bits.TSR13
    #define CAN2TXTSRH_TSR14 _CAN2TXTSR.Overlap_STR.CAN2TXTSRHSTR.Bits.TSR14
    #define CAN2TXTSRH_TSR15 _CAN2TXTSR.Overlap_STR.CAN2TXTSRHSTR.Bits.TSR15
    
    #define CAN2TXTSRH_TSR_8 _CAN2TXTSR.Overlap_STR.CAN2TXTSRHSTR.MergedBits.grpTSR_8
    #define CAN2TXTSRH_TSR CAN2TXTSRH_TSR_8
    
    #define CAN2TXTSRH_TSR8_MASK   1
    #define CAN2TXTSRH_TSR9_MASK   2
    #define CAN2TXTSRH_TSR10_MASK   4
    #define CAN2TXTSRH_TSR11_MASK   8
    #define CAN2TXTSRH_TSR12_MASK   16
    #define CAN2TXTSRH_TSR13_MASK   32
    #define CAN2TXTSRH_TSR14_MASK   64
    #define CAN2TXTSRH_TSR15_MASK   128
    #define CAN2TXTSRH_TSR_8_MASK  255
    #define CAN2TXTSRH_TSR_8_BITNUM  0


