frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
    /*** CAN2TXTSRL - MSCAN 2 Transmit Time Stamp Register Low; 0x000001FF ***/
    union {
      byte Byte;
      struct {
        byte TSR0        :1;                                       /* Time Stamp Bit 0 */
        byte TSR1        :1;                                       /* Time Stamp Bit 1 */
        byte TSR2        :1;                                       /* Time Stamp Bit 2 */
        byte TSR3        :1;                                       /* Time Stamp Bit 3 */
        byte TSR4        :1;                                       /* Time Stamp Bit 4 */
        byte TSR5        :1;                                       /* Time Stamp Bit 5 */
        byte TSR6        :1;                                       /* Time Stamp Bit 6 */
        byte TSR7        :1;                                       /* Time Stamp Bit 7 */
      } Bits;
      struct {
        byte grpTSR :8;
      } MergedBits;
    } CAN2TXTSRLSTR;
    #define CAN2TXTSRL _CAN2TXTSR.Overlap_STR.CAN2TXTSRLSTR.Byte
    #define CAN2TXTSRL_TSR0 _CAN2TXTSR.Overlap_STR.CAN2TXTSRLSTR.Bits.TSR0
    #define CAN2TXTSRL_TSR1 _CAN2TXTSR.Overlap_STR.CAN2TXTSRLSTR.Bits.TSR1
    #define CAN2TXTSRL_TSR2 _CAN2TXTSR.Overlap_STR.CAN2TXTSRLSTR.Bits.TSR2
    #define CAN2TXTSRL_TSR3 _CAN2TXTSR.Overlap_STR.CAN2TXTSRLSTR.Bits.TSR3
    #define CAN2TXTSRL_TSR4 _CAN2TXTSR.Overlap_STR.CAN2TXTSRLSTR.Bits.TSR4
    #define CAN2TXTSRL_TSR5 _CAN2TXTSR.Overlap_STR.CAN2TXTSRLSTR.Bits.TSR5
    #define CAN2TXTSRL_TSR6 _CAN2TXTSR.Overlap_STR.CAN2TXTSRLSTR.Bits.TSR6
    #define CAN2TXTSRL_TSR7 _CAN2TXTSR.Overlap_STR.CAN2TXTSRLSTR.Bits.TSR7
    
    #define CAN2TXTSRL_TSR _CAN2TXTSR.Overlap_STR.CAN2TXTSRLSTR.MergedBits.grpTSR
    
    #define CAN2TXTSRL_TSR0_MASK   1
    #define CAN2TXTSRL_TSR1_MASK   2
    #define CAN2TXTSRL_TSR2_MASK   4
    #define CAN2TXTSRL_TSR3_MASK   8
    #define CAN2TXTSRL_TSR4_MASK   16
    #define CAN2TXTSRL_TSR5_MASK   32
    #define CAN2TXTSRL_TSR6_MASK   64
    #define CAN2TXTSRL_TSR7_MASK   128
    #define CAN2TXTSRL_TSR_MASK  255
    #define CAN2TXTSRL_TSR_BITNUM  0

  } Overlap_STR;

  struct {
    word TSR0        :1;                                       /* Time Stamp Bit 0 */
    word TSR1        :1;                                       /* Time Stamp Bit 1 */
    word TSR2        :1;                                       /* Time Stamp Bit 2 */
    word TSR3        :1;                                       /* Time Stamp Bit 3 */
    word TSR4        :1;                                       /* Time Stamp Bit 4 */
    word TSR5        :1;                                       /* Time Stamp Bit 5 */
    word TSR6        :1;                                       /* Time Stamp Bit 6 */
    word TSR7        :1;                                       /* Time Stamp Bit 7 */
    word TSR8        :1;                                       /* Time Stamp Bit 8 */
    word TSR9        :1;                                       /* Time Stamp Bit 9 */
    word TSR10       :1;                                       /* Time Stamp Bit 10 */
    word TSR11       :1;                                       /* Time Stamp Bit 11 */
    word TSR12       :1;                                       /* Time Stamp Bit 12 */
    word TSR13       :1;                                       /* Time Stamp Bit 13 */
    word TSR14       :1;                                       /* Time Stamp Bit 14 */
    word TSR15       :1;                                       /* Time Stamp Bit 15 */
  } Bits;
  struct {
    word grpTSR  :16;
  } MergedBits;
} CAN2TXTSRSTR;
extern volatile CAN2TXTSRSTR _CAN2TXTSR @(REG_BASE + 0x000001FE);
#define CAN2TXTSR _CAN2TXTSR.Word
#define CAN2TXTSR_TSR0 _CAN2TXTSR.Bits.TSR0
#define CAN2TXTSR_TSR1 _CAN2TXTSR.Bits.TSR1
#define CAN2TXTSR_TSR2 _CAN2TXTSR.Bits.TSR2
#define CAN2TXTSR_TSR3 _CAN2TXTSR.Bits.TSR3
#define CAN2TXTSR_TSR4 _CAN2TXTSR.Bits.TSR4
#define CAN2TXTSR_TSR5 _CAN2TXTSR.Bits.TSR5
#define CAN2TXTSR_TSR6 _CAN2TXTSR.Bits.TSR6
#define CAN2TXTSR_TSR7 _CAN2TXTSR.Bits.TSR7
#define CAN2TXTSR_TSR8 _CAN2TXTSR.Bits.TSR8
#define CAN2TXTSR_TSR9 _CAN2TXTSR.Bits.TSR9
#define CAN2TXTSR_TSR10 _CAN2TXTSR.Bits.TSR10
#define CAN2TXTSR_TSR11 _CAN2TXTSR.Bits.TSR11
#define CAN2TXTSR_TSR12 _CAN2TXTSR.Bits.TSR12
#define CAN2TXTSR_TSR13 _CAN2TXTSR.Bits.TSR13
#define CAN2TXTSR_TSR14 _CAN2TXTSR.Bits.TSR14
#define CAN2TXTSR_TSR15 _CAN2TXTSR.Bits.TSR15
#define CAN2TXTSR_TSR _CAN2TXTSR.MergedBits.grpTSR

#define CAN2TXTSR_TSR0_MASK   1
#define CAN2TXTSR_TSR1_MASK   2
#define CAN2TXTSR_TSR2_MASK   4
#define CAN2TXTSR_TSR3_MASK   8
#define CAN2TXTSR_TSR4_MASK   16
#define CAN2TXTSR_TSR5_MASK   32
#define CAN2TXTSR_TSR6_MASK   64
#define CAN2TXTSR_TSR7_MASK   128
#define CAN2TXTSR_TSR8_MASK   256
#define CAN2TXTSR_TSR9_MASK   512
#define CAN2TXTSR_TSR10_MASK   1024
#define CAN2TXTSR_TSR11_MASK   2048
#define CAN2TXTSR_TSR12_MASK   4096
#define CAN2TXTSR_TSR13_MASK   8192
#define CAN2TXTSR_TSR14_MASK   16384
#define CAN2TXTSR_TSR15_MASK   32768
#define CAN2TXTSR_TSR_MASK  65535
#define CAN2TXTSR_TSR_BITNUM  0


/*** CAN3CTL0 - MSCAN 3 Control 0 Register; 0x00000200 ***/
typedef union {
  byte Byte;
  struct {
    byte INITRQ      :1;                                       /* Initialization Mode Request */
    byte SLPRQ       :1;                                       /* Sleep Mode Request */
    byte WUPE        :1;                                       /* Wake-Up Enable */
    byte TIME        :1;                                       /* Timer Enable */
    byte SYNCH       :1;                                       /* Synchronized Status */
    byte CSWAI       :1;                                       /* CAN Stops in Wait Mode */
    byte RXACT       :1;                                       /* Receiver Active Status */
    byte RXFRM       :1;                                       /* Received Frame Flag */
  } Bits;
} CAN3CTL0STR;
extern volatile CAN3CTL0STR _CAN3CTL0 @(REG_BASE + 0x00000200);
#define CAN3CTL0 _CAN3CTL0.Byte
#define CAN3CTL0_INITRQ _CAN3CTL0.Bits.INITRQ
#define CAN3CTL0_SLPRQ _CAN3CTL0.Bits.SLPRQ
#define CAN3CTL0_WUPE _CAN3CTL0.Bits.WUPE
#define CAN3CTL0_TIME _CAN3CTL0.Bits.TIME
#define CAN3CTL0_SYNCH _CAN3CTL0.Bits.SYNCH
#define CAN3CTL0_CSWAI _CAN3CTL0.Bits.CSWAI
#define CAN3CTL0_RXACT _CAN3CTL0.Bits.RXACT
#define CAN3CTL0_RXFRM _CAN3CTL0.Bits.RXFRM
/* CAN3CTL_ARR: Access 2 CAN3CTLx registers in a array */
#define CAN3CTL_ARR ((Byte *) &CAN3CTL0)

