frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
#define CAN3CTL0_INITRQ_MASK   1
#define CAN3CTL0_SLPRQ_MASK   2
#define CAN3CTL0_WUPE_MASK   4
#define CAN3CTL0_TIME_MASK   8
#define CAN3CTL0_SYNCH_MASK   16
#define CAN3CTL0_CSWAI_MASK   32
#define CAN3CTL0_RXACT_MASK   64
#define CAN3CTL0_RXFRM_MASK   128


/*** CAN3CTL1 - MSCAN 3 Control 1 Register; 0x00000201 ***/
typedef union {
  byte Byte;
  struct {
    byte INITAK      :1;                                       /* Initialization Mode Acknowledge */
    byte SLPAK       :1;                                       /* Sleep Mode Acknowledge */
    byte WUPM        :1;                                       /* Wake-Up Mode */
    byte BORM        :1;                                       /* Bus-Off Recovery Mode */
    byte LISTEN      :1;                                       /* Listen Only Mode */
    byte LOOPB       :1;                                       /* Loop Back Self Test Mode */
    byte CLKSRC      :1;                                       /* MSCAN 3 Clock Source */
    byte CANE        :1;                                       /* MSCAN 3 Enable */
  } Bits;
} CAN3CTL1STR;
extern volatile CAN3CTL1STR _CAN3CTL1 @(REG_BASE + 0x00000201);
#define CAN3CTL1 _CAN3CTL1.Byte
#define CAN3CTL1_INITAK _CAN3CTL1.Bits.INITAK
#define CAN3CTL1_SLPAK _CAN3CTL1.Bits.SLPAK
#define CAN3CTL1_WUPM _CAN3CTL1.Bits.WUPM
#define CAN3CTL1_BORM _CAN3CTL1.Bits.BORM
#define CAN3CTL1_LISTEN _CAN3CTL1.Bits.LISTEN
#define CAN3CTL1_LOOPB _CAN3CTL1.Bits.LOOPB
#define CAN3CTL1_CLKSRC _CAN3CTL1.Bits.CLKSRC
#define CAN3CTL1_CANE _CAN3CTL1.Bits.CANE

#define CAN3CTL1_INITAK_MASK   1
#define CAN3CTL1_SLPAK_MASK   2
#define CAN3CTL1_WUPM_MASK   4
#define CAN3CTL1_BORM_MASK   8
#define CAN3CTL1_LISTEN_MASK   16
#define CAN3CTL1_LOOPB_MASK   32
#define CAN3CTL1_CLKSRC_MASK   64
#define CAN3CTL1_CANE_MASK   128


/*** CAN3BTR0 - MSCAN 3 Bus Timing Register 0; 0x00000202 ***/
typedef union {
  byte Byte;
  struct {
    byte BRP0        :1;                                       /* Baud Rate Prescaler 0 */
    byte BRP1        :1;                                       /* Baud Rate Prescaler 1 */
    byte BRP2        :1;                                       /* Baud Rate Prescaler 2 */
    byte BRP3        :1;                                       /* Baud Rate Prescaler 3 */
    byte BRP4        :1;                                       /* Baud Rate Prescaler 4 */
    byte BRP5        :1;                                       /* Baud Rate Prescaler 5 */
    byte SJW0        :1;                                       /* Synchronization Jump Width 0 */
    byte SJW1        :1;                                       /* Synchronization Jump Width 1 */
  } Bits;
  struct {
    byte grpBRP  :6;
    byte grpSJW  :2;
  } MergedBits;
} CAN3BTR0STR;
extern volatile CAN3BTR0STR _CAN3BTR0 @(REG_BASE + 0x00000202);
#define CAN3BTR0 _CAN3BTR0.Byte
#define CAN3BTR0_BRP0 _CAN3BTR0.Bits.BRP0
#define CAN3BTR0_BRP1 _CAN3BTR0.Bits.BRP1
#define CAN3BTR0_BRP2 _CAN3BTR0.Bits.BRP2
#define CAN3BTR0_BRP3 _CAN3BTR0.Bits.BRP3
#define CAN3BTR0_BRP4 _CAN3BTR0.Bits.BRP4
#define CAN3BTR0_BRP5 _CAN3BTR0.Bits.BRP5
#define CAN3BTR0_SJW0 _CAN3BTR0.Bits.SJW0
#define CAN3BTR0_SJW1 _CAN3BTR0.Bits.SJW1
/* CAN3BTR_ARR: Access 2 CAN3BTRx registers in a array */
#define CAN3BTR_ARR ((Byte *) &CAN3BTR0)
#define CAN3BTR0_BRP _CAN3BTR0.MergedBits.grpBRP
#define CAN3BTR0_SJW _CAN3BTR0.MergedBits.grpSJW

#define CAN3BTR0_BRP0_MASK   1
#define CAN3BTR0_BRP1_MASK   2
#define CAN3BTR0_BRP2_MASK   4
#define CAN3BTR0_BRP3_MASK   8
#define CAN3BTR0_BRP4_MASK   16
#define CAN3BTR0_BRP5_MASK   32
#define CAN3BTR0_SJW0_MASK   64
#define CAN3BTR0_SJW1_MASK   128
#define CAN3BTR0_BRP_MASK  63
#define CAN3BTR0_BRP_BITNUM  0
#define CAN3BTR0_SJW_MASK  192
#define CAN3BTR0_SJW_BITNUM  6


/*** CAN3BTR1 - MSCAN 3 Bus Timing Register 1; 0x00000203 ***/
typedef union {
  byte Byte;
  struct {
    byte TSEG10      :1;                                       /* Time Segment 10 */
    byte TSEG11      :1;                                       /* Time Segment 11 */
    byte TSEG12      :1;                                       /* Time Segment 12 */
    byte TSEG13      :1;                                       /* Time Segment 13 */
    byte TSEG20      :1;                                       /* Time Segment 20 */
    byte TSEG21      :1;                                       /* Time Segment 21 */
    byte TSEG22      :1;                                       /* Time Segment 22 */
    byte SAMP        :1;                                       /* Sampling */
  } Bits;
  struct {
    byte grpTSEG_10 :4;
    byte grpTSEG_20 :3;
    byte         :1;
  } MergedBits;
} CAN3BTR1STR;
extern volatile CAN3BTR1STR _CAN3BTR1 @(REG_BASE + 0x00000203);
#define CAN3BTR1 _CAN3BTR1.Byte
#define CAN3BTR1_TSEG10 _CAN3BTR1.Bits.TSEG10
#define CAN3BTR1_TSEG11 _CAN3BTR1.Bits.TSEG11
#define CAN3BTR1_TSEG12 _CAN3BTR1.Bits.TSEG12
#define CAN3BTR1_TSEG13 _CAN3BTR1.Bits.TSEG13
#define CAN3BTR1_TSEG20 _CAN3BTR1.Bits.TSEG20
#define CAN3BTR1_TSEG21 _CAN3BTR1.Bits.TSEG21
#define CAN3BTR1_TSEG22 _CAN3BTR1.Bits.TSEG22
#define CAN3BTR1_SAMP _CAN3BTR1.Bits.SAMP
#define CAN3BTR1_TSEG_10 _CAN3BTR1.MergedBits.grpTSEG_10
#define CAN3BTR1_TSEG_20 _CAN3BTR1.MergedBits.grpTSEG_20
#define CAN3BTR1_TSEG CAN3BTR1_TSEG_10

#define CAN3BTR1_TSEG10_MASK   1
#define CAN3BTR1_TSEG11_MASK   2
#define CAN3BTR1_TSEG12_MASK   4
#define CAN3BTR1_TSEG13_MASK   8
#define CAN3BTR1_TSEG20_MASK   16
#define CAN3BTR1_TSEG21_MASK   32
#define CAN3BTR1_TSEG22_MASK   64
#define CAN3BTR1_SAMP_MASK   128
#define CAN3BTR1_TSEG_10_MASK  15
#define CAN3BTR1_TSEG_10_BITNUM  0
#define CAN3BTR1_TSEG_20_MASK  112
#define CAN3BTR1_TSEG_20_BITNUM  4


/*** CAN3RFLG - MSCAN 3 Receiver Flag Register; 0x00000204 ***/
typedef union {
  byte Byte;
  struct {
    byte RXF         :1;                                       /* Receive Buffer Full */
    byte OVRIF       :1;                                       /* Overrun Interrupt Flag */
    byte TSTAT0      :1;                                       /* Transmitter Status Bit 0 */
    byte TSTAT1      :1;                                       /* Transmitter Status Bit 1 */
    byte RSTAT0      :1;                                       /* Receiver Status Bit 0 */
    byte RSTAT1      :1;                                       /* Receiver Status Bit 1 */
    byte CSCIF       :1;                                       /* CAN Status Change Interrupt Flag */
    byte WUPIF       :1;                                       /* Wake-up Interrupt Flag */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpTSTAT :2;
    byte grpRSTAT :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN3RFLGSTR;
extern volatile CAN3RFLGSTR _CAN3RFLG @(REG_BASE + 0x00000204);
#define CAN3RFLG _CAN3RFLG.Byte
#define CAN3RFLG_RXF _CAN3RFLG.Bits.RXF
#define CAN3RFLG_OVRIF _CAN3RFLG.Bits.OVRIF
#define CAN3RFLG_TSTAT0 _CAN3RFLG.Bits.TSTAT0
#define CAN3RFLG_TSTAT1 _CAN3RFLG.Bits.TSTAT1
#define CAN3RFLG_RSTAT0 _CAN3RFLG.Bits.RSTAT0
#define CAN3RFLG_RSTAT1 _CAN3RFLG.Bits.RSTAT1
#define CAN3RFLG_CSCIF _CAN3RFLG.Bits.CSCIF
#define CAN3RFLG_WUPIF _CAN3RFLG.Bits.WUPIF
#define CAN3RFLG_TSTAT _CAN3RFLG.MergedBits.grpTSTAT
#define CAN3RFLG_RSTAT _CAN3RFLG.MergedBits.grpRSTAT

#define CAN3RFLG_RXF_MASK   1
#define CAN3RFLG_OVRIF_MASK   2
#define CAN3RFLG_TSTAT0_MASK   4
#define CAN3RFLG_TSTAT1_MASK   8
#define CAN3RFLG_RSTAT0_MASK   16
#define CAN3RFLG_RSTAT1_MASK   32
#define CAN3RFLG_CSCIF_MASK   64
#define CAN3RFLG_WUPIF_MASK   128
#define CAN3RFLG_TSTAT_MASK  12
#define CAN3RFLG_TSTAT_BITNUM  2
#define CAN3RFLG_RSTAT_MASK  48
#define CAN3RFLG_RSTAT_BITNUM  4


/*** CAN3RIER - MSCAN 3 Receiver Interrupt Enable Register; 0x00000205 ***/
typedef union {
  byte Byte;
  struct {
    byte RXFIE       :1;                                       /* Receiver Full Interrupt Enable */
    byte OVRIE       :1;                                       /* Overrun Interrupt Enable */
    byte TSTATE0     :1;                                       /* Transmitter Status Change Enable 0 */
    byte TSTATE1     :1;                                       /* Transmitter Status Change Enable 1 */
    byte RSTATE0     :1;                                       /* Receiver Status Change Enable 0 */
    byte RSTATE1     :1;                                       /* Receiver Status Change Enable 1 */
    byte CSCIE       :1;                                       /* CAN Status Change Interrupt Enable */
    byte WUPIE       :1;                                       /* Wake-up Interrupt Enable */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpTSTATE :2;
    byte grpRSTATE :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN3RIERSTR;
extern volatile CAN3RIERSTR _CAN3RIER @(REG_BASE + 0x00000205);
#define CAN3RIER _CAN3RIER.Byte
#define CAN3RIER_RXFIE _CAN3RIER.Bits.RXFIE
#define CAN3RIER_OVRIE _CAN3RIER.Bits.OVRIE
#define CAN3RIER_TSTATE0 _CAN3RIER.Bits.TSTATE0
#define CAN3RIER_TSTATE1 _CAN3RIER.Bits.TSTATE1
#define CAN3RIER_RSTATE0 _CAN3RIER.Bits.RSTATE0
#define CAN3RIER_RSTATE1 _CAN3RIER.Bits.RSTATE1
#define CAN3RIER_CSCIE _CAN3RIER.Bits.CSCIE
#define CAN3RIER_WUPIE _CAN3RIER.Bits.WUPIE
#define CAN3RIER_TSTATE _CAN3RIER.MergedBits.grpTSTATE
#define CAN3RIER_RSTATE _CAN3RIER.MergedBits.grpRSTATE

#define CAN3RIER_RXFIE_MASK   1
#define CAN3RIER_OVRIE_MASK   2
#define CAN3RIER_TSTATE0_MASK   4
#define CAN3RIER_TSTATE1_MASK   8
#define CAN3RIER_RSTATE0_MASK   16
#define CAN3RIER_RSTATE1_MASK   32
#define CAN3RIER_CSCIE_MASK   64
#define CAN3RIER_WUPIE_MASK   128
#define CAN3RIER_TSTATE_MASK  12
#define CAN3RIER_TSTATE_BITNUM  2
#define CAN3RIER_RSTATE_MASK  48
#define CAN3RIER_RSTATE_BITNUM  4


/*** CAN3TFLG - MSCAN 3 Transmitter Flag Register; 0x00000206 ***/
typedef union {
  byte Byte;
  struct {
    byte TXE0        :1;                                       /* Transmitter Buffer Empty 0 */
    byte TXE1        :1;                                       /* Transmitter Buffer Empty 1 */
    byte TXE2        :1;                                       /* Transmitter Buffer Empty 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpTXE  :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN3TFLGSTR;
