frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
extern volatile CAN3TFLGSTR _CAN3TFLG @(REG_BASE + 0x00000206);
#define CAN3TFLG _CAN3TFLG.Byte
#define CAN3TFLG_TXE0 _CAN3TFLG.Bits.TXE0
#define CAN3TFLG_TXE1 _CAN3TFLG.Bits.TXE1
#define CAN3TFLG_TXE2 _CAN3TFLG.Bits.TXE2
#define CAN3TFLG_TXE _CAN3TFLG.MergedBits.grpTXE

#define CAN3TFLG_TXE0_MASK   1
#define CAN3TFLG_TXE1_MASK   2
#define CAN3TFLG_TXE2_MASK   4
#define CAN3TFLG_TXE_MASK  7
#define CAN3TFLG_TXE_BITNUM  0


/*** CAN3TIER - MSCAN 3 Transmitter Interrupt Enable Register; 0x00000207 ***/
typedef union {
  byte Byte;
  struct {
    byte TXEIE0      :1;                                       /* Transmitter Empty Interrupt Enable 0 */
    byte TXEIE1      :1;                                       /* Transmitter Empty Interrupt Enable 1 */
    byte TXEIE2      :1;                                       /* Transmitter Empty Interrupt Enable 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpTXEIE :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN3TIERSTR;
extern volatile CAN3TIERSTR _CAN3TIER @(REG_BASE + 0x00000207);
#define CAN3TIER _CAN3TIER.Byte
#define CAN3TIER_TXEIE0 _CAN3TIER.Bits.TXEIE0
#define CAN3TIER_TXEIE1 _CAN3TIER.Bits.TXEIE1
#define CAN3TIER_TXEIE2 _CAN3TIER.Bits.TXEIE2
#define CAN3TIER_TXEIE _CAN3TIER.MergedBits.grpTXEIE

#define CAN3TIER_TXEIE0_MASK   1
#define CAN3TIER_TXEIE1_MASK   2
#define CAN3TIER_TXEIE2_MASK   4
#define CAN3TIER_TXEIE_MASK  7
#define CAN3TIER_TXEIE_BITNUM  0


/*** CAN3TARQ - MSCAN 3 Transmitter Message Abort Request; 0x00000208 ***/
typedef union {
  byte Byte;
  struct {
    byte ABTRQ0      :1;                                       /* Abort Request 0 */
    byte ABTRQ1      :1;                                       /* Abort Request 1 */
    byte ABTRQ2      :1;                                       /* Abort Request 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpABTRQ :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN3TARQSTR;
extern volatile CAN3TARQSTR _CAN3TARQ @(REG_BASE + 0x00000208);
#define CAN3TARQ _CAN3TARQ.Byte
#define CAN3TARQ_ABTRQ0 _CAN3TARQ.Bits.ABTRQ0
#define CAN3TARQ_ABTRQ1 _CAN3TARQ.Bits.ABTRQ1
#define CAN3TARQ_ABTRQ2 _CAN3TARQ.Bits.ABTRQ2
#define CAN3TARQ_ABTRQ _CAN3TARQ.MergedBits.grpABTRQ

#define CAN3TARQ_ABTRQ0_MASK   1
#define CAN3TARQ_ABTRQ1_MASK   2
#define CAN3TARQ_ABTRQ2_MASK   4
#define CAN3TARQ_ABTRQ_MASK  7
#define CAN3TARQ_ABTRQ_BITNUM  0


/*** CAN3TAAK - MSCAN 3 Transmitter Message Abort Control; 0x00000209 ***/
typedef union {
  byte Byte;
  struct {
    byte ABTAK0      :1;                                       /* Abort Acknowledge 0 */
    byte ABTAK1      :1;                                       /* Abort Acknowledge 1 */
    byte ABTAK2      :1;                                       /* Abort Acknowledge 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpABTAK :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN3TAAKSTR;
extern volatile CAN3TAAKSTR _CAN3TAAK @(REG_BASE + 0x00000209);
#define CAN3TAAK _CAN3TAAK.Byte
#define CAN3TAAK_ABTAK0 _CAN3TAAK.Bits.ABTAK0
#define CAN3TAAK_ABTAK1 _CAN3TAAK.Bits.ABTAK1
#define CAN3TAAK_ABTAK2 _CAN3TAAK.Bits.ABTAK2
#define CAN3TAAK_ABTAK _CAN3TAAK.MergedBits.grpABTAK

#define CAN3TAAK_ABTAK0_MASK   1
#define CAN3TAAK_ABTAK1_MASK   2
#define CAN3TAAK_ABTAK2_MASK   4
#define CAN3TAAK_ABTAK_MASK  7
#define CAN3TAAK_ABTAK_BITNUM  0


/*** CAN3TBSEL - MSCAN 3 Transmit Buffer Selection; 0x0000020A ***/
typedef union {
  byte Byte;
  struct {
    byte TX0         :1;                                       /* Transmit Buffer Select 0 */
    byte TX1         :1;                                       /* Transmit Buffer Select 1 */
    byte TX2         :1;                                       /* Transmit Buffer Select 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpTX   :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN3TBSELSTR;
extern volatile CAN3TBSELSTR _CAN3TBSEL @(REG_BASE + 0x0000020A);
#define CAN3TBSEL _CAN3TBSEL.Byte
#define CAN3TBSEL_TX0 _CAN3TBSEL.Bits.TX0
#define CAN3TBSEL_TX1 _CAN3TBSEL.Bits.TX1
#define CAN3TBSEL_TX2 _CAN3TBSEL.Bits.TX2
#define CAN3TBSEL_TX _CAN3TBSEL.MergedBits.grpTX

#define CAN3TBSEL_TX0_MASK   1
#define CAN3TBSEL_TX1_MASK   2
#define CAN3TBSEL_TX2_MASK   4
#define CAN3TBSEL_TX_MASK  7
#define CAN3TBSEL_TX_BITNUM  0


/*** CAN3IDAC - MSCAN 3 Identifier Acceptance Control Register; 0x0000020B ***/
typedef union {
  byte Byte;
  struct {
    byte IDHIT0      :1;                                       /* Identifier Acceptance Hit Indicator 0 */
    byte IDHIT1      :1;                                       /* Identifier Acceptance Hit Indicator 1 */
    byte IDHIT2      :1;                                       /* Identifier Acceptance Hit Indicator 2 */
    byte             :1; 
    byte IDAM0       :1;                                       /* Identifier Acceptance Mode 0 */
    byte IDAM1       :1;                                       /* Identifier Acceptance Mode 1 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpIDHIT :3;
    byte         :1;
    byte grpIDAM :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN3IDACSTR;
extern volatile CAN3IDACSTR _CAN3IDAC @(REG_BASE + 0x0000020B);
#define CAN3IDAC _CAN3IDAC.Byte
#define CAN3IDAC_IDHIT0 _CAN3IDAC.Bits.IDHIT0
#define CAN3IDAC_IDHIT1 _CAN3IDAC.Bits.IDHIT1
#define CAN3IDAC_IDHIT2 _CAN3IDAC.Bits.IDHIT2
#define CAN3IDAC_IDAM0 _CAN3IDAC.Bits.IDAM0
#define CAN3IDAC_IDAM1 _CAN3IDAC.Bits.IDAM1
#define CAN3IDAC_IDHIT _CAN3IDAC.MergedBits.grpIDHIT
#define CAN3IDAC_IDAM _CAN3IDAC.MergedBits.grpIDAM

#define CAN3IDAC_IDHIT0_MASK   1
#define CAN3IDAC_IDHIT1_MASK   2
#define CAN3IDAC_IDHIT2_MASK   4
#define CAN3IDAC_IDAM0_MASK   16
#define CAN3IDAC_IDAM1_MASK   32
#define CAN3IDAC_IDHIT_MASK  7
#define CAN3IDAC_IDHIT_BITNUM  0
#define CAN3IDAC_IDAM_MASK  48
#define CAN3IDAC_IDAM_BITNUM  4


/*** CAN3MISC - MSCAN 3 Miscellaneous Register; 0x0000020D ***/
typedef union {
  byte Byte;
  struct {
    byte BOHOLD      :1;                                       /* Bus-Off state Hold until user request */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} CAN3MISCSTR;
extern volatile CAN3MISCSTR _CAN3MISC @(REG_BASE + 0x0000020D);
#define CAN3MISC _CAN3MISC.Byte
#define CAN3MISC_BOHOLD _CAN3MISC.Bits.BOHOLD

#define CAN3MISC_BOHOLD_MASK   1


