frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
/*** CAN3RXERR - MSCAN 3 Receive Error Counter Register; 0x0000020E ***/
typedef union {
  byte Byte;
  struct {
    byte RXERR0      :1;                                       /* Bit 0 */
    byte RXERR1      :1;                                       /* Bit 1 */
    byte RXERR2      :1;                                       /* Bit 2 */
    byte RXERR3      :1;                                       /* Bit 3 */
    byte RXERR4      :1;                                       /* Bit 4 */
    byte RXERR5      :1;                                       /* Bit 5 */
    byte RXERR6      :1;                                       /* Bit 6 */
    byte RXERR7      :1;                                       /* Bit 7 */
  } Bits;
  struct {
    byte grpRXERR :8;
  } MergedBits;
} CAN3RXERRSTR;
extern volatile CAN3RXERRSTR _CAN3RXERR @(REG_BASE + 0x0000020E);
#define CAN3RXERR _CAN3RXERR.Byte
#define CAN3RXERR_RXERR0 _CAN3RXERR.Bits.RXERR0
#define CAN3RXERR_RXERR1 _CAN3RXERR.Bits.RXERR1
#define CAN3RXERR_RXERR2 _CAN3RXERR.Bits.RXERR2
#define CAN3RXERR_RXERR3 _CAN3RXERR.Bits.RXERR3
#define CAN3RXERR_RXERR4 _CAN3RXERR.Bits.RXERR4
#define CAN3RXERR_RXERR5 _CAN3RXERR.Bits.RXERR5
#define CAN3RXERR_RXERR6 _CAN3RXERR.Bits.RXERR6
#define CAN3RXERR_RXERR7 _CAN3RXERR.Bits.RXERR7
#define CAN3RXERR_RXERR _CAN3RXERR.MergedBits.grpRXERR

#define CAN3RXERR_RXERR0_MASK   1
#define CAN3RXERR_RXERR1_MASK   2
#define CAN3RXERR_RXERR2_MASK   4
#define CAN3RXERR_RXERR3_MASK   8
#define CAN3RXERR_RXERR4_MASK   16
#define CAN3RXERR_RXERR5_MASK   32
#define CAN3RXERR_RXERR6_MASK   64
#define CAN3RXERR_RXERR7_MASK   128
#define CAN3RXERR_RXERR_MASK  255
#define CAN3RXERR_RXERR_BITNUM  0


/*** CAN3TXERR - MSCAN 3 Transmit Error Counter Register; 0x0000020F ***/
typedef union {
  byte Byte;
  struct {
    byte TXERR0      :1;                                       /* Bit 0 */
    byte TXERR1      :1;                                       /* Bit 1 */
    byte TXERR2      :1;                                       /* Bit 2 */
    byte TXERR3      :1;                                       /* Bit 3 */
    byte TXERR4      :1;                                       /* Bit 4 */
    byte TXERR5      :1;                                       /* Bit 5 */
    byte TXERR6      :1;                                       /* Bit 6 */
    byte TXERR7      :1;                                       /* Bit 7 */
  } Bits;
  struct {
    byte grpTXERR :8;
  } MergedBits;
} CAN3TXERRSTR;
extern volatile CAN3TXERRSTR _CAN3TXERR @(REG_BASE + 0x0000020F);
#define CAN3TXERR _CAN3TXERR.Byte
#define CAN3TXERR_TXERR0 _CAN3TXERR.Bits.TXERR0
#define CAN3TXERR_TXERR1 _CAN3TXERR.Bits.TXERR1
#define CAN3TXERR_TXERR2 _CAN3TXERR.Bits.TXERR2
#define CAN3TXERR_TXERR3 _CAN3TXERR.Bits.TXERR3
#define CAN3TXERR_TXERR4 _CAN3TXERR.Bits.TXERR4
#define CAN3TXERR_TXERR5 _CAN3TXERR.Bits.TXERR5
#define CAN3TXERR_TXERR6 _CAN3TXERR.Bits.TXERR6
#define CAN3TXERR_TXERR7 _CAN3TXERR.Bits.TXERR7
#define CAN3TXERR_TXERR _CAN3TXERR.MergedBits.grpTXERR

#define CAN3TXERR_TXERR0_MASK   1
#define CAN3TXERR_TXERR1_MASK   2
#define CAN3TXERR_TXERR2_MASK   4
#define CAN3TXERR_TXERR3_MASK   8
#define CAN3TXERR_TXERR4_MASK   16
#define CAN3TXERR_TXERR5_MASK   32
#define CAN3TXERR_TXERR6_MASK   64
#define CAN3TXERR_TXERR7_MASK   128
#define CAN3TXERR_TXERR_MASK  255
#define CAN3TXERR_TXERR_BITNUM  0


/*** CAN3IDAR0 - MSCAN 3 Identifier Acceptance Register 0; 0x00000210 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
  struct {
    byte grpAC   :8;
  } MergedBits;
} CAN3IDAR0STR;
extern volatile CAN3IDAR0STR _CAN3IDAR0 @(REG_BASE + 0x00000210);
#define CAN3IDAR0 _CAN3IDAR0.Byte
#define CAN3IDAR0_AC0 _CAN3IDAR0.Bits.AC0
#define CAN3IDAR0_AC1 _CAN3IDAR0.Bits.AC1
#define CAN3IDAR0_AC2 _CAN3IDAR0.Bits.AC2
#define CAN3IDAR0_AC3 _CAN3IDAR0.Bits.AC3
#define CAN3IDAR0_AC4 _CAN3IDAR0.Bits.AC4
#define CAN3IDAR0_AC5 _CAN3IDAR0.Bits.AC5
#define CAN3IDAR0_AC6 _CAN3IDAR0.Bits.AC6
#define CAN3IDAR0_AC7 _CAN3IDAR0.Bits.AC7
/* CAN3IDAR_ARR: Access 4 CAN3IDARx registers in a array */
#define CAN3IDAR_ARR ((Byte *) &CAN3IDAR0)
#define CAN3IDAR0_AC _CAN3IDAR0.MergedBits.grpAC

#define CAN3IDAR0_AC0_MASK   1
#define CAN3IDAR0_AC1_MASK   2
#define CAN3IDAR0_AC2_MASK   4
#define CAN3IDAR0_AC3_MASK   8
#define CAN3IDAR0_AC4_MASK   16
#define CAN3IDAR0_AC5_MASK   32
#define CAN3IDAR0_AC6_MASK   64
#define CAN3IDAR0_AC7_MASK   128
#define CAN3IDAR0_AC_MASK  255
#define CAN3IDAR0_AC_BITNUM  0


/*** CAN3IDAR1 - MSCAN 3 Identifier Acceptance Register 1; 0x00000211 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
  struct {
    byte grpAC   :8;
  } MergedBits;
} CAN3IDAR1STR;
extern volatile CAN3IDAR1STR _CAN3IDAR1 @(REG_BASE + 0x00000211);
#define CAN3IDAR1 _CAN3IDAR1.Byte
#define CAN3IDAR1_AC0 _CAN3IDAR1.Bits.AC0
#define CAN3IDAR1_AC1 _CAN3IDAR1.Bits.AC1
#define CAN3IDAR1_AC2 _CAN3IDAR1.Bits.AC2
#define CAN3IDAR1_AC3 _CAN3IDAR1.Bits.AC3
#define CAN3IDAR1_AC4 _CAN3IDAR1.Bits.AC4
#define CAN3IDAR1_AC5 _CAN3IDAR1.Bits.AC5
#define CAN3IDAR1_AC6 _CAN3IDAR1.Bits.AC6
#define CAN3IDAR1_AC7 _CAN3IDAR1.Bits.AC7
#define CAN3IDAR1_AC _CAN3IDAR1.MergedBits.grpAC

#define CAN3IDAR1_AC0_MASK   1
#define CAN3IDAR1_AC1_MASK   2
#define CAN3IDAR1_AC2_MASK   4
#define CAN3IDAR1_AC3_MASK   8
#define CAN3IDAR1_AC4_MASK   16
#define CAN3IDAR1_AC5_MASK   32
#define CAN3IDAR1_AC6_MASK   64
#define CAN3IDAR1_AC7_MASK   128
#define CAN3IDAR1_AC_MASK  255
#define CAN3IDAR1_AC_BITNUM  0


/*** CAN3IDAR2 - MSCAN 3 Identifier Acceptance Register 2; 0x00000212 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
  struct {
    byte grpAC   :8;
  } MergedBits;
} CAN3IDAR2STR;
extern volatile CAN3IDAR2STR _CAN3IDAR2 @(REG_BASE + 0x00000212);
#define CAN3IDAR2 _CAN3IDAR2.Byte
#define CAN3IDAR2_AC0 _CAN3IDAR2.Bits.AC0
#define CAN3IDAR2_AC1 _CAN3IDAR2.Bits.AC1
#define CAN3IDAR2_AC2 _CAN3IDAR2.Bits.AC2
#define CAN3IDAR2_AC3 _CAN3IDAR2.Bits.AC3
#define CAN3IDAR2_AC4 _CAN3IDAR2.Bits.AC4
#define CAN3IDAR2_AC5 _CAN3IDAR2.Bits.AC5
#define CAN3IDAR2_AC6 _CAN3IDAR2.Bits.AC6
#define CAN3IDAR2_AC7 _CAN3IDAR2.Bits.AC7
#define CAN3IDAR2_AC _CAN3IDAR2.MergedBits.grpAC

#define CAN3IDAR2_AC0_MASK   1
#define CAN3IDAR2_AC1_MASK   2
#define CAN3IDAR2_AC2_MASK   4
#define CAN3IDAR2_AC3_MASK   8
#define CAN3IDAR2_AC4_MASK   16
#define CAN3IDAR2_AC5_MASK   32
#define CAN3IDAR2_AC6_MASK   64
#define CAN3IDAR2_AC7_MASK   128
#define CAN3IDAR2_AC_MASK  255
#define CAN3IDAR2_AC_BITNUM  0


/*** CAN3IDAR3 - MSCAN 3 Identifier Acceptance Register 3; 0x00000213 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
  struct {
    byte grpAC   :8;
  } MergedBits;
} CAN3IDAR3STR;
extern volatile CAN3IDAR3STR _CAN3IDAR3 @(REG_BASE + 0x00000213);
#define CAN3IDAR3 _CAN3IDAR3.Byte
#define CAN3IDAR3_AC0 _CAN3IDAR3.Bits.AC0
#define CAN3IDAR3_AC1 _CAN3IDAR3.Bits.AC1
#define CAN3IDAR3_AC2 _CAN3IDAR3.Bits.AC2
#define CAN3IDAR3_AC3 _CAN3IDAR3.Bits.AC3
#define CAN3IDAR3_AC4 _CAN3IDAR3.Bits.AC4
#define CAN3IDAR3_AC5 _CAN3IDAR3.Bits.AC5
#define CAN3IDAR3_AC6 _CAN3IDAR3.Bits.AC6
#define CAN3IDAR3_AC7 _CAN3IDAR3.Bits.AC7
#define CAN3IDAR3_AC _CAN3IDAR3.MergedBits.grpAC

