frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
extern volatile CAN3RXDSR1STR _CAN3RXDSR1 @(REG_BASE + 0x00000225);
#define CAN3RXDSR1 _CAN3RXDSR1.Byte
#define CAN3RXDSR1_DB0 _CAN3RXDSR1.Bits.DB0
#define CAN3RXDSR1_DB1 _CAN3RXDSR1.Bits.DB1
#define CAN3RXDSR1_DB2 _CAN3RXDSR1.Bits.DB2
#define CAN3RXDSR1_DB3 _CAN3RXDSR1.Bits.DB3
#define CAN3RXDSR1_DB4 _CAN3RXDSR1.Bits.DB4
#define CAN3RXDSR1_DB5 _CAN3RXDSR1.Bits.DB5
#define CAN3RXDSR1_DB6 _CAN3RXDSR1.Bits.DB6
#define CAN3RXDSR1_DB7 _CAN3RXDSR1.Bits.DB7
#define CAN3RXDSR1_DB _CAN3RXDSR1.MergedBits.grpDB

#define CAN3RXDSR1_DB0_MASK   1
#define CAN3RXDSR1_DB1_MASK   2
#define CAN3RXDSR1_DB2_MASK   4
#define CAN3RXDSR1_DB3_MASK   8
#define CAN3RXDSR1_DB4_MASK   16
#define CAN3RXDSR1_DB5_MASK   32
#define CAN3RXDSR1_DB6_MASK   64
#define CAN3RXDSR1_DB7_MASK   128
#define CAN3RXDSR1_DB_MASK  255
#define CAN3RXDSR1_DB_BITNUM  0


/*** CAN3RXDSR2 - MSCAN 3 Receive Data Segment Register 2; 0x00000226 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN3RXDSR2STR;
extern volatile CAN3RXDSR2STR _CAN3RXDSR2 @(REG_BASE + 0x00000226);
#define CAN3RXDSR2 _CAN3RXDSR2.Byte
#define CAN3RXDSR2_DB0 _CAN3RXDSR2.Bits.DB0
#define CAN3RXDSR2_DB1 _CAN3RXDSR2.Bits.DB1
#define CAN3RXDSR2_DB2 _CAN3RXDSR2.Bits.DB2
#define CAN3RXDSR2_DB3 _CAN3RXDSR2.Bits.DB3
#define CAN3RXDSR2_DB4 _CAN3RXDSR2.Bits.DB4
#define CAN3RXDSR2_DB5 _CAN3RXDSR2.Bits.DB5
#define CAN3RXDSR2_DB6 _CAN3RXDSR2.Bits.DB6
#define CAN3RXDSR2_DB7 _CAN3RXDSR2.Bits.DB7
#define CAN3RXDSR2_DB _CAN3RXDSR2.MergedBits.grpDB

#define CAN3RXDSR2_DB0_MASK   1
#define CAN3RXDSR2_DB1_MASK   2
#define CAN3RXDSR2_DB2_MASK   4
#define CAN3RXDSR2_DB3_MASK   8
#define CAN3RXDSR2_DB4_MASK   16
#define CAN3RXDSR2_DB5_MASK   32
#define CAN3RXDSR2_DB6_MASK   64
#define CAN3RXDSR2_DB7_MASK   128
#define CAN3RXDSR2_DB_MASK  255
#define CAN3RXDSR2_DB_BITNUM  0


/*** CAN3RXDSR3 - MSCAN 3 Receive Data Segment Register 3; 0x00000227 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN3RXDSR3STR;
extern volatile CAN3RXDSR3STR _CAN3RXDSR3 @(REG_BASE + 0x00000227);
#define CAN3RXDSR3 _CAN3RXDSR3.Byte
#define CAN3RXDSR3_DB0 _CAN3RXDSR3.Bits.DB0
#define CAN3RXDSR3_DB1 _CAN3RXDSR3.Bits.DB1
#define CAN3RXDSR3_DB2 _CAN3RXDSR3.Bits.DB2
#define CAN3RXDSR3_DB3 _CAN3RXDSR3.Bits.DB3
#define CAN3RXDSR3_DB4 _CAN3RXDSR3.Bits.DB4
#define CAN3RXDSR3_DB5 _CAN3RXDSR3.Bits.DB5
#define CAN3RXDSR3_DB6 _CAN3RXDSR3.Bits.DB6
#define CAN3RXDSR3_DB7 _CAN3RXDSR3.Bits.DB7
#define CAN3RXDSR3_DB _CAN3RXDSR3.MergedBits.grpDB

#define CAN3RXDSR3_DB0_MASK   1
#define CAN3RXDSR3_DB1_MASK   2
#define CAN3RXDSR3_DB2_MASK   4
#define CAN3RXDSR3_DB3_MASK   8
#define CAN3RXDSR3_DB4_MASK   16
#define CAN3RXDSR3_DB5_MASK   32
#define CAN3RXDSR3_DB6_MASK   64
#define CAN3RXDSR3_DB7_MASK   128
#define CAN3RXDSR3_DB_MASK  255
#define CAN3RXDSR3_DB_BITNUM  0


/*** CAN3RXDSR4 - MSCAN 3 Receive Data Segment Register 4; 0x00000228 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN3RXDSR4STR;
extern volatile CAN3RXDSR4STR _CAN3RXDSR4 @(REG_BASE + 0x00000228);
#define CAN3RXDSR4 _CAN3RXDSR4.Byte
#define CAN3RXDSR4_DB0 _CAN3RXDSR4.Bits.DB0
#define CAN3RXDSR4_DB1 _CAN3RXDSR4.Bits.DB1
#define CAN3RXDSR4_DB2 _CAN3RXDSR4.Bits.DB2
#define CAN3RXDSR4_DB3 _CAN3RXDSR4.Bits.DB3
#define CAN3RXDSR4_DB4 _CAN3RXDSR4.Bits.DB4
#define CAN3RXDSR4_DB5 _CAN3RXDSR4.Bits.DB5
#define CAN3RXDSR4_DB6 _CAN3RXDSR4.Bits.DB6
#define CAN3RXDSR4_DB7 _CAN3RXDSR4.Bits.DB7
#define CAN3RXDSR4_DB _CAN3RXDSR4.MergedBits.grpDB

#define CAN3RXDSR4_DB0_MASK   1
#define CAN3RXDSR4_DB1_MASK   2
#define CAN3RXDSR4_DB2_MASK   4
#define CAN3RXDSR4_DB3_MASK   8
#define CAN3RXDSR4_DB4_MASK   16
#define CAN3RXDSR4_DB5_MASK   32
#define CAN3RXDSR4_DB6_MASK   64
#define CAN3RXDSR4_DB7_MASK   128
#define CAN3RXDSR4_DB_MASK  255
#define CAN3RXDSR4_DB_BITNUM  0


/*** CAN3RXDSR5 - MSCAN 3 Receive Data Segment Register 5; 0x00000229 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN3RXDSR5STR;
extern volatile CAN3RXDSR5STR _CAN3RXDSR5 @(REG_BASE + 0x00000229);
#define CAN3RXDSR5 _CAN3RXDSR5.Byte
#define CAN3RXDSR5_DB0 _CAN3RXDSR5.Bits.DB0
#define CAN3RXDSR5_DB1 _CAN3RXDSR5.Bits.DB1
#define CAN3RXDSR5_DB2 _CAN3RXDSR5.Bits.DB2
#define CAN3RXDSR5_DB3 _CAN3RXDSR5.Bits.DB3
#define CAN3RXDSR5_DB4 _CAN3RXDSR5.Bits.DB4
#define CAN3RXDSR5_DB5 _CAN3RXDSR5.Bits.DB5
#define CAN3RXDSR5_DB6 _CAN3RXDSR5.Bits.DB6
#define CAN3RXDSR5_DB7 _CAN3RXDSR5.Bits.DB7
#define CAN3RXDSR5_DB _CAN3RXDSR5.MergedBits.grpDB

#define CAN3RXDSR5_DB0_MASK   1
#define CAN3RXDSR5_DB1_MASK   2
#define CAN3RXDSR5_DB2_MASK   4
#define CAN3RXDSR5_DB3_MASK   8
#define CAN3RXDSR5_DB4_MASK   16
#define CAN3RXDSR5_DB5_MASK   32
#define CAN3RXDSR5_DB6_MASK   64
#define CAN3RXDSR5_DB7_MASK   128
#define CAN3RXDSR5_DB_MASK  255
#define CAN3RXDSR5_DB_BITNUM  0


/*** CAN3RXDSR6 - MSCAN 3 Receive Data Segment Register 6; 0x0000022A ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN3RXDSR6STR;
extern volatile CAN3RXDSR6STR _CAN3RXDSR6 @(REG_BASE + 0x0000022A);
#define CAN3RXDSR6 _CAN3RXDSR6.Byte
#define CAN3RXDSR6_DB0 _CAN3RXDSR6.Bits.DB0
#define CAN3RXDSR6_DB1 _CAN3RXDSR6.Bits.DB1
#define CAN3RXDSR6_DB2 _CAN3RXDSR6.Bits.DB2
#define CAN3RXDSR6_DB3 _CAN3RXDSR6.Bits.DB3
#define CAN3RXDSR6_DB4 _CAN3RXDSR6.Bits.DB4
#define CAN3RXDSR6_DB5 _CAN3RXDSR6.Bits.DB5
#define CAN3RXDSR6_DB6 _CAN3RXDSR6.Bits.DB6
#define CAN3RXDSR6_DB7 _CAN3RXDSR6.Bits.DB7
#define CAN3RXDSR6_DB _CAN3RXDSR6.MergedBits.grpDB

#define CAN3RXDSR6_DB0_MASK   1
#define CAN3RXDSR6_DB1_MASK   2
#define CAN3RXDSR6_DB2_MASK   4
#define CAN3RXDSR6_DB3_MASK   8
#define CAN3RXDSR6_DB4_MASK   16
#define CAN3RXDSR6_DB5_MASK   32
#define CAN3RXDSR6_DB6_MASK   64
#define CAN3RXDSR6_DB7_MASK   128
#define CAN3RXDSR6_DB_MASK  255
#define CAN3RXDSR6_DB_BITNUM  0


/*** CAN3RXDSR7 - MSCAN 3 Receive Data Segment Register 7; 0x0000022B ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN3RXDSR7STR;
