frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
extern volatile CAN3RXDSR7STR _CAN3RXDSR7 @(REG_BASE + 0x0000022B);
#define CAN3RXDSR7 _CAN3RXDSR7.Byte
#define CAN3RXDSR7_DB0 _CAN3RXDSR7.Bits.DB0
#define CAN3RXDSR7_DB1 _CAN3RXDSR7.Bits.DB1
#define CAN3RXDSR7_DB2 _CAN3RXDSR7.Bits.DB2
#define CAN3RXDSR7_DB3 _CAN3RXDSR7.Bits.DB3
#define CAN3RXDSR7_DB4 _CAN3RXDSR7.Bits.DB4
#define CAN3RXDSR7_DB5 _CAN3RXDSR7.Bits.DB5
#define CAN3RXDSR7_DB6 _CAN3RXDSR7.Bits.DB6
#define CAN3RXDSR7_DB7 _CAN3RXDSR7.Bits.DB7
#define CAN3RXDSR7_DB _CAN3RXDSR7.MergedBits.grpDB

#define CAN3RXDSR7_DB0_MASK   1
#define CAN3RXDSR7_DB1_MASK   2
#define CAN3RXDSR7_DB2_MASK   4
#define CAN3RXDSR7_DB3_MASK   8
#define CAN3RXDSR7_DB4_MASK   16
#define CAN3RXDSR7_DB5_MASK   32
#define CAN3RXDSR7_DB6_MASK   64
#define CAN3RXDSR7_DB7_MASK   128
#define CAN3RXDSR7_DB_MASK  255
#define CAN3RXDSR7_DB_BITNUM  0


/*** CAN3RXDLR - MSCAN 3 Receive Data Length Register; 0x0000022C ***/
typedef union {
  byte Byte;
  struct {
    byte DLC0        :1;                                       /* Data Length Code Bit 0 */
    byte DLC1        :1;                                       /* Data Length Code Bit 1 */
    byte DLC2        :1;                                       /* Data Length Code Bit 2 */
    byte DLC3        :1;                                       /* Data Length Code Bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpDLC  :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN3RXDLRSTR;
extern volatile CAN3RXDLRSTR _CAN3RXDLR @(REG_BASE + 0x0000022C);
#define CAN3RXDLR _CAN3RXDLR.Byte
#define CAN3RXDLR_DLC0 _CAN3RXDLR.Bits.DLC0
#define CAN3RXDLR_DLC1 _CAN3RXDLR.Bits.DLC1
#define CAN3RXDLR_DLC2 _CAN3RXDLR.Bits.DLC2
#define CAN3RXDLR_DLC3 _CAN3RXDLR.Bits.DLC3
#define CAN3RXDLR_DLC _CAN3RXDLR.MergedBits.grpDLC

#define CAN3RXDLR_DLC0_MASK   1
#define CAN3RXDLR_DLC1_MASK   2
#define CAN3RXDLR_DLC2_MASK   4
#define CAN3RXDLR_DLC3_MASK   8
#define CAN3RXDLR_DLC_MASK  15
#define CAN3RXDLR_DLC_BITNUM  0


/*** CAN3RXTSR - MSCAN 3 Receive Time Stamp Register; 0x0000022E ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** CAN3RXTSRH - MSCAN 3 Receive Time Stamp Register High; 0x0000022E ***/
    union {
      byte Byte;
      struct {
        byte TSR8        :1;                                       /* Time Stamp Bit 8 */
        byte TSR9        :1;                                       /* Time Stamp Bit 9 */
        byte TSR10       :1;                                       /* Time Stamp Bit 10 */
        byte TSR11       :1;                                       /* Time Stamp Bit 11 */
        byte TSR12       :1;                                       /* Time Stamp Bit 12 */
        byte TSR13       :1;                                       /* Time Stamp Bit 13 */
        byte TSR14       :1;                                       /* Time Stamp Bit 14 */
        byte TSR15       :1;                                       /* Time Stamp Bit 15 */
      } Bits;
      struct {
        byte grpTSR_8 :8;
      } MergedBits;
    } CAN3RXTSRHSTR;
    #define CAN3RXTSRH _CAN3RXTSR.Overlap_STR.CAN3RXTSRHSTR.Byte
    #define CAN3RXTSRH_TSR8 _CAN3RXTSR.Overlap_STR.CAN3RXTSRHSTR.Bits.TSR8
    #define CAN3RXTSRH_TSR9 _CAN3RXTSR.Overlap_STR.CAN3RXTSRHSTR.Bits.TSR9
    #define CAN3RXTSRH_TSR10 _CAN3RXTSR.Overlap_STR.CAN3RXTSRHSTR.Bits.TSR10
    #define CAN3RXTSRH_TSR11 _CAN3RXTSR.Overlap_STR.CAN3RXTSRHSTR.Bits.TSR11
    #define CAN3RXTSRH_TSR12 _CAN3RXTSR.Overlap_STR.CAN3RXTSRHSTR.Bits.TSR12
    #define CAN3RXTSRH_TSR13 _CAN3RXTSR.Overlap_STR.CAN3RXTSRHSTR.Bits.TSR13
    #define CAN3RXTSRH_TSR14 _CAN3RXTSR.Overlap_STR.CAN3RXTSRHSTR.Bits.TSR14
    #define CAN3RXTSRH_TSR15 _CAN3RXTSR.Overlap_STR.CAN3RXTSRHSTR.Bits.TSR15
    
    #define CAN3RXTSRH_TSR_8 _CAN3RXTSR.Overlap_STR.CAN3RXTSRHSTR.MergedBits.grpTSR_8
    #define CAN3RXTSRH_TSR CAN3RXTSRH_TSR_8
    
    #define CAN3RXTSRH_TSR8_MASK   1
    #define CAN3RXTSRH_TSR9_MASK   2
    #define CAN3RXTSRH_TSR10_MASK   4
    #define CAN3RXTSRH_TSR11_MASK   8
    #define CAN3RXTSRH_TSR12_MASK   16
    #define CAN3RXTSRH_TSR13_MASK   32
    #define CAN3RXTSRH_TSR14_MASK   64
    #define CAN3RXTSRH_TSR15_MASK   128
    #define CAN3RXTSRH_TSR_8_MASK  255
    #define CAN3RXTSRH_TSR_8_BITNUM  0


    /*** CAN3RXTSRL - MSCAN 3 Receive Time Stamp Register Low; 0x0000022F ***/
    union {
      byte Byte;
      struct {
        byte TSR0        :1;                                       /* Time Stamp Bit 0 */
        byte TSR1        :1;                                       /* Time Stamp Bit 1 */
        byte TSR2        :1;                                       /* Time Stamp Bit 2 */
        byte TSR3        :1;                                       /* Time Stamp Bit 3 */
        byte TSR4        :1;                                       /* Time Stamp Bit 4 */
        byte TSR5        :1;                                       /* Time Stamp Bit 5 */
        byte TSR6        :1;                                       /* Time Stamp Bit 6 */
        byte TSR7        :1;                                       /* Time Stamp Bit 7 */
      } Bits;
      struct {
        byte grpTSR :8;
      } MergedBits;
    } CAN3RXTSRLSTR;
    #define CAN3RXTSRL _CAN3RXTSR.Overlap_STR.CAN3RXTSRLSTR.Byte
    #define CAN3RXTSRL_TSR0 _CAN3RXTSR.Overlap_STR.CAN3RXTSRLSTR.Bits.TSR0
    #define CAN3RXTSRL_TSR1 _CAN3RXTSR.Overlap_STR.CAN3RXTSRLSTR.Bits.TSR1
    #define CAN3RXTSRL_TSR2 _CAN3RXTSR.Overlap_STR.CAN3RXTSRLSTR.Bits.TSR2
    #define CAN3RXTSRL_TSR3 _CAN3RXTSR.Overlap_STR.CAN3RXTSRLSTR.Bits.TSR3
    #define CAN3RXTSRL_TSR4 _CAN3RXTSR.Overlap_STR.CAN3RXTSRLSTR.Bits.TSR4
    #define CAN3RXTSRL_TSR5 _CAN3RXTSR.Overlap_STR.CAN3RXTSRLSTR.Bits.TSR5
    #define CAN3RXTSRL_TSR6 _CAN3RXTSR.Overlap_STR.CAN3RXTSRLSTR.Bits.TSR6
    #define CAN3RXTSRL_TSR7 _CAN3RXTSR.Overlap_STR.CAN3RXTSRLSTR.Bits.TSR7
    
    #define CAN3RXTSRL_TSR _CAN3RXTSR.Overlap_STR.CAN3RXTSRLSTR.MergedBits.grpTSR
    
    #define CAN3RXTSRL_TSR0_MASK   1
    #define CAN3RXTSRL_TSR1_MASK   2
    #define CAN3RXTSRL_TSR2_MASK   4
    #define CAN3RXTSRL_TSR3_MASK   8
    #define CAN3RXTSRL_TSR4_MASK   16
    #define CAN3RXTSRL_TSR5_MASK   32
    #define CAN3RXTSRL_TSR6_MASK   64
    #define CAN3RXTSRL_TSR7_MASK   128
    #define CAN3RXTSRL_TSR_MASK  255
    #define CAN3RXTSRL_TSR_BITNUM  0

  } Overlap_STR;

