frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
  struct {
    word TSR0        :1;                                       /* Time Stamp Bit 0 */
    word TSR1        :1;                                       /* Time Stamp Bit 1 */
    word TSR2        :1;                                       /* Time Stamp Bit 2 */
    word TSR3        :1;                                       /* Time Stamp Bit 3 */
    word TSR4        :1;                                       /* Time Stamp Bit 4 */
    word TSR5        :1;                                       /* Time Stamp Bit 5 */
    word TSR6        :1;                                       /* Time Stamp Bit 6 */
    word TSR7        :1;                                       /* Time Stamp Bit 7 */
    word TSR8        :1;                                       /* Time Stamp Bit 8 */
    word TSR9        :1;                                       /* Time Stamp Bit 9 */
    word TSR10       :1;                                       /* Time Stamp Bit 10 */
    word TSR11       :1;                                       /* Time Stamp Bit 11 */
    word TSR12       :1;                                       /* Time Stamp Bit 12 */
    word TSR13       :1;                                       /* Time Stamp Bit 13 */
    word TSR14       :1;                                       /* Time Stamp Bit 14 */
    word TSR15       :1;                                       /* Time Stamp Bit 15 */
  } Bits;
  struct {
    word grpTSR  :16;
  } MergedBits;
} CAN3RXTSRSTR;
extern volatile CAN3RXTSRSTR _CAN3RXTSR @(REG_BASE + 0x0000022E);
#define CAN3RXTSR _CAN3RXTSR.Word
#define CAN3RXTSR_TSR0 _CAN3RXTSR.Bits.TSR0
#define CAN3RXTSR_TSR1 _CAN3RXTSR.Bits.TSR1
#define CAN3RXTSR_TSR2 _CAN3RXTSR.Bits.TSR2
#define CAN3RXTSR_TSR3 _CAN3RXTSR.Bits.TSR3
#define CAN3RXTSR_TSR4 _CAN3RXTSR.Bits.TSR4
#define CAN3RXTSR_TSR5 _CAN3RXTSR.Bits.TSR5
#define CAN3RXTSR_TSR6 _CAN3RXTSR.Bits.TSR6
#define CAN3RXTSR_TSR7 _CAN3RXTSR.Bits.TSR7
#define CAN3RXTSR_TSR8 _CAN3RXTSR.Bits.TSR8
#define CAN3RXTSR_TSR9 _CAN3RXTSR.Bits.TSR9
#define CAN3RXTSR_TSR10 _CAN3RXTSR.Bits.TSR10
#define CAN3RXTSR_TSR11 _CAN3RXTSR.Bits.TSR11
#define CAN3RXTSR_TSR12 _CAN3RXTSR.Bits.TSR12
#define CAN3RXTSR_TSR13 _CAN3RXTSR.Bits.TSR13
#define CAN3RXTSR_TSR14 _CAN3RXTSR.Bits.TSR14
#define CAN3RXTSR_TSR15 _CAN3RXTSR.Bits.TSR15
#define CAN3RXTSR_TSR _CAN3RXTSR.MergedBits.grpTSR

#define CAN3RXTSR_TSR0_MASK   1
#define CAN3RXTSR_TSR1_MASK   2
#define CAN3RXTSR_TSR2_MASK   4
#define CAN3RXTSR_TSR3_MASK   8
#define CAN3RXTSR_TSR4_MASK   16
#define CAN3RXTSR_TSR5_MASK   32
#define CAN3RXTSR_TSR6_MASK   64
#define CAN3RXTSR_TSR7_MASK   128
#define CAN3RXTSR_TSR8_MASK   256
#define CAN3RXTSR_TSR9_MASK   512
#define CAN3RXTSR_TSR10_MASK   1024
#define CAN3RXTSR_TSR11_MASK   2048
#define CAN3RXTSR_TSR12_MASK   4096
#define CAN3RXTSR_TSR13_MASK   8192
#define CAN3RXTSR_TSR14_MASK   16384
#define CAN3RXTSR_TSR15_MASK   32768
#define CAN3RXTSR_TSR_MASK  65535
#define CAN3RXTSR_TSR_BITNUM  0


/*** CAN3TXIDR0 - MSCAN 3 Transmit Identifier Register 0; 0x00000230 ***/
typedef union {
  byte Byte;
  struct {
    byte ID21        :1;                                       /* Extended format identifier Bit 21 */
    byte ID22        :1;                                       /* Extended format identifier Bit 22 */
    byte ID23        :1;                                       /* Extended format identifier Bit 23 */
    byte ID24        :1;                                       /* Extended format identifier Bit 24 */
    byte ID25        :1;                                       /* Extended format identifier Bit 25 */
    byte ID26        :1;                                       /* Extended format identifier Bit 26 */
    byte ID27        :1;                                       /* Extended format identifier Bit 27 */
    byte ID28        :1;                                       /* Extended format identifier Bit 28 */
  } Bits;
  struct {
    byte grpID_21 :8;
  } MergedBits;
} CAN3TXIDR0STR;
extern volatile CAN3TXIDR0STR _CAN3TXIDR0 @(REG_BASE + 0x00000230);
#define CAN3TXIDR0 _CAN3TXIDR0.Byte
#define CAN3TXIDR0_ID21 _CAN3TXIDR0.Bits.ID21
#define CAN3TXIDR0_ID22 _CAN3TXIDR0.Bits.ID22
#define CAN3TXIDR0_ID23 _CAN3TXIDR0.Bits.ID23
#define CAN3TXIDR0_ID24 _CAN3TXIDR0.Bits.ID24
#define CAN3TXIDR0_ID25 _CAN3TXIDR0.Bits.ID25
#define CAN3TXIDR0_ID26 _CAN3TXIDR0.Bits.ID26
#define CAN3TXIDR0_ID27 _CAN3TXIDR0.Bits.ID27
#define CAN3TXIDR0_ID28 _CAN3TXIDR0.Bits.ID28
/* CAN3TXIDR_ARR: Access 4 CAN3TXIDRx registers in a array */
#define CAN3TXIDR_ARR ((Byte *) &CAN3TXIDR0)
#define CAN3TXIDR0_ID_21 _CAN3TXIDR0.MergedBits.grpID_21
#define CAN3TXIDR0_ID CAN3TXIDR0_ID_21

#define CAN3TXIDR0_ID21_MASK   1
#define CAN3TXIDR0_ID22_MASK   2
#define CAN3TXIDR0_ID23_MASK   4
#define CAN3TXIDR0_ID24_MASK   8
#define CAN3TXIDR0_ID25_MASK   16
#define CAN3TXIDR0_ID26_MASK   32
#define CAN3TXIDR0_ID27_MASK   64
#define CAN3TXIDR0_ID28_MASK   128
#define CAN3TXIDR0_ID_21_MASK  255
#define CAN3TXIDR0_ID_21_BITNUM  0


/*** CAN3TXIDR1 - MSCAN 3 Transmit Identifier Register 1; 0x00000231 ***/
typedef union {
  byte Byte;
  struct {
    byte ID15        :1;                                       /* Extended format identifier Bit 15 */
    byte ID16        :1;                                       /* Extended format identifier Bit 16 */
    byte ID17        :1;                                       /* Extended format identifier Bit 17 */
    byte IDE         :1;                                       /* ID Extended */
    byte SRR         :1;                                       /* Substitute Remote Request */
    byte ID18        :1;                                       /* Extended format identifier Bit 18 */
    byte ID19        :1;                                       /* Extended format identifier Bit 19 */
    byte ID20        :1;                                       /* Extended format identifier Bit 20 */
  } Bits;
  struct {
    byte grpID_15 :3;
    byte         :1;
    byte         :1;
    byte grpID_18 :3;
  } MergedBits;
} CAN3TXIDR1STR;
extern volatile CAN3TXIDR1STR _CAN3TXIDR1 @(REG_BASE + 0x00000231);
#define CAN3TXIDR1 _CAN3TXIDR1.Byte
#define CAN3TXIDR1_ID15 _CAN3TXIDR1.Bits.ID15
#define CAN3TXIDR1_ID16 _CAN3TXIDR1.Bits.ID16
#define CAN3TXIDR1_ID17 _CAN3TXIDR1.Bits.ID17
#define CAN3TXIDR1_IDE _CAN3TXIDR1.Bits.IDE
#define CAN3TXIDR1_SRR _CAN3TXIDR1.Bits.SRR
#define CAN3TXIDR1_ID18 _CAN3TXIDR1.Bits.ID18
#define CAN3TXIDR1_ID19 _CAN3TXIDR1.Bits.ID19
#define CAN3TXIDR1_ID20 _CAN3TXIDR1.Bits.ID20
#define CAN3TXIDR1_ID_15 _CAN3TXIDR1.MergedBits.grpID_15
#define CAN3TXIDR1_ID_18 _CAN3TXIDR1.MergedBits.grpID_18
#define CAN3TXIDR1_ID CAN3TXIDR1_ID_15

#define CAN3TXIDR1_ID15_MASK   1
#define CAN3TXIDR1_ID16_MASK   2
#define CAN3TXIDR1_ID17_MASK   4
#define CAN3TXIDR1_IDE_MASK   8
#define CAN3TXIDR1_SRR_MASK   16
#define CAN3TXIDR1_ID18_MASK   32
#define CAN3TXIDR1_ID19_MASK   64
#define CAN3TXIDR1_ID20_MASK   128
#define CAN3TXIDR1_ID_15_MASK  7
#define CAN3TXIDR1_ID_15_BITNUM  0
#define CAN3TXIDR1_ID_18_MASK  224
#define CAN3TXIDR1_ID_18_BITNUM  5


/*** CAN3TXIDR2 - MSCAN 3 Transmit Identifier Register 2; 0x00000232 ***/
typedef union {
  byte Byte;
  struct {
    byte ID7         :1;                                       /* Extended format identifier Bit 7 */
    byte ID8         :1;                                       /* Extended format identifier Bit 8 */
    byte ID9         :1;                                       /* Extended format identifier Bit 9 */
    byte ID10        :1;                                       /* Extended format identifier Bit 10 */
    byte ID11        :1;                                       /* Extended format identifier Bit 11 */
    byte ID12        :1;                                       /* Extended format identifier Bit 12 */
    byte ID13        :1;                                       /* Extended format identifier Bit 13 */
    byte ID14        :1;                                       /* Extended format identifier Bit 14 */
  } Bits;
  struct {
    byte grpID_7 :8;
  } MergedBits;
} CAN3TXIDR2STR;
