frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
extern volatile CAN3TXIDR2STR _CAN3TXIDR2 @(REG_BASE + 0x00000232);
#define CAN3TXIDR2 _CAN3TXIDR2.Byte
#define CAN3TXIDR2_ID7 _CAN3TXIDR2.Bits.ID7
#define CAN3TXIDR2_ID8 _CAN3TXIDR2.Bits.ID8
#define CAN3TXIDR2_ID9 _CAN3TXIDR2.Bits.ID9
#define CAN3TXIDR2_ID10 _CAN3TXIDR2.Bits.ID10
#define CAN3TXIDR2_ID11 _CAN3TXIDR2.Bits.ID11
#define CAN3TXIDR2_ID12 _CAN3TXIDR2.Bits.ID12
#define CAN3TXIDR2_ID13 _CAN3TXIDR2.Bits.ID13
#define CAN3TXIDR2_ID14 _CAN3TXIDR2.Bits.ID14
#define CAN3TXIDR2_ID_7 _CAN3TXIDR2.MergedBits.grpID_7
#define CAN3TXIDR2_ID CAN3TXIDR2_ID_7

#define CAN3TXIDR2_ID7_MASK   1
#define CAN3TXIDR2_ID8_MASK   2
#define CAN3TXIDR2_ID9_MASK   4
#define CAN3TXIDR2_ID10_MASK   8
#define CAN3TXIDR2_ID11_MASK   16
#define CAN3TXIDR2_ID12_MASK   32
#define CAN3TXIDR2_ID13_MASK   64
#define CAN3TXIDR2_ID14_MASK   128
#define CAN3TXIDR2_ID_7_MASK  255
#define CAN3TXIDR2_ID_7_BITNUM  0


/*** CAN3TXIDR3 - MSCAN 3 Transmit Identifier Register 3; 0x00000233 ***/
typedef union {
  byte Byte;
  struct {
    byte RTR         :1;                                       /* Remote Transmission Request */
    byte ID0         :1;                                       /* Extended format identifier Bit 0 */
    byte ID1         :1;                                       /* Extended format identifier Bit 1 */
    byte ID2         :1;                                       /* Extended format identifier Bit 2 */
    byte ID3         :1;                                       /* Extended format identifier Bit 3 */
    byte ID4         :1;                                       /* Extended format identifier Bit 4 */
    byte ID5         :1;                                       /* Extended format identifier Bit 5 */
    byte ID6         :1;                                       /* Extended format identifier Bit 6 */
  } Bits;
  struct {
    byte         :1;
    byte grpID   :7;
  } MergedBits;
} CAN3TXIDR3STR;
extern volatile CAN3TXIDR3STR _CAN3TXIDR3 @(REG_BASE + 0x00000233);
#define CAN3TXIDR3 _CAN3TXIDR3.Byte
#define CAN3TXIDR3_RTR _CAN3TXIDR3.Bits.RTR
#define CAN3TXIDR3_ID0 _CAN3TXIDR3.Bits.ID0
#define CAN3TXIDR3_ID1 _CAN3TXIDR3.Bits.ID1
#define CAN3TXIDR3_ID2 _CAN3TXIDR3.Bits.ID2
#define CAN3TXIDR3_ID3 _CAN3TXIDR3.Bits.ID3
#define CAN3TXIDR3_ID4 _CAN3TXIDR3.Bits.ID4
#define CAN3TXIDR3_ID5 _CAN3TXIDR3.Bits.ID5
#define CAN3TXIDR3_ID6 _CAN3TXIDR3.Bits.ID6
#define CAN3TXIDR3_ID _CAN3TXIDR3.MergedBits.grpID

#define CAN3TXIDR3_RTR_MASK   1
#define CAN3TXIDR3_ID0_MASK   2
#define CAN3TXIDR3_ID1_MASK   4
#define CAN3TXIDR3_ID2_MASK   8
#define CAN3TXIDR3_ID3_MASK   16
#define CAN3TXIDR3_ID4_MASK   32
#define CAN3TXIDR3_ID5_MASK   64
#define CAN3TXIDR3_ID6_MASK   128
#define CAN3TXIDR3_ID_MASK  254
#define CAN3TXIDR3_ID_BITNUM  1


/*** CAN3TXDSR0 - MSCAN 3 Transmit Data Segment Register 0; 0x00000234 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN3TXDSR0STR;
extern volatile CAN3TXDSR0STR _CAN3TXDSR0 @(REG_BASE + 0x00000234);
#define CAN3TXDSR0 _CAN3TXDSR0.Byte
#define CAN3TXDSR0_DB0 _CAN3TXDSR0.Bits.DB0
#define CAN3TXDSR0_DB1 _CAN3TXDSR0.Bits.DB1
#define CAN3TXDSR0_DB2 _CAN3TXDSR0.Bits.DB2
#define CAN3TXDSR0_DB3 _CAN3TXDSR0.Bits.DB3
#define CAN3TXDSR0_DB4 _CAN3TXDSR0.Bits.DB4
#define CAN3TXDSR0_DB5 _CAN3TXDSR0.Bits.DB5
#define CAN3TXDSR0_DB6 _CAN3TXDSR0.Bits.DB6
#define CAN3TXDSR0_DB7 _CAN3TXDSR0.Bits.DB7
/* CAN3TXDSR_ARR: Access 8 CAN3TXDSRx registers in a array */
#define CAN3TXDSR_ARR ((Byte *) &CAN3TXDSR0)
#define CAN3TXDSR0_DB _CAN3TXDSR0.MergedBits.grpDB

#define CAN3TXDSR0_DB0_MASK   1
#define CAN3TXDSR0_DB1_MASK   2
#define CAN3TXDSR0_DB2_MASK   4
#define CAN3TXDSR0_DB3_MASK   8
#define CAN3TXDSR0_DB4_MASK   16
#define CAN3TXDSR0_DB5_MASK   32
#define CAN3TXDSR0_DB6_MASK   64
#define CAN3TXDSR0_DB7_MASK   128
#define CAN3TXDSR0_DB_MASK  255
#define CAN3TXDSR0_DB_BITNUM  0


/*** CAN3TXDSR1 - MSCAN 3 Transmit Data Segment Register 1; 0x00000235 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN3TXDSR1STR;
extern volatile CAN3TXDSR1STR _CAN3TXDSR1 @(REG_BASE + 0x00000235);
#define CAN3TXDSR1 _CAN3TXDSR1.Byte
#define CAN3TXDSR1_DB0 _CAN3TXDSR1.Bits.DB0
#define CAN3TXDSR1_DB1 _CAN3TXDSR1.Bits.DB1
#define CAN3TXDSR1_DB2 _CAN3TXDSR1.Bits.DB2
#define CAN3TXDSR1_DB3 _CAN3TXDSR1.Bits.DB3
#define CAN3TXDSR1_DB4 _CAN3TXDSR1.Bits.DB4
#define CAN3TXDSR1_DB5 _CAN3TXDSR1.Bits.DB5
#define CAN3TXDSR1_DB6 _CAN3TXDSR1.Bits.DB6
#define CAN3TXDSR1_DB7 _CAN3TXDSR1.Bits.DB7
#define CAN3TXDSR1_DB _CAN3TXDSR1.MergedBits.grpDB

#define CAN3TXDSR1_DB0_MASK   1
#define CAN3TXDSR1_DB1_MASK   2
#define CAN3TXDSR1_DB2_MASK   4
#define CAN3TXDSR1_DB3_MASK   8
#define CAN3TXDSR1_DB4_MASK   16
#define CAN3TXDSR1_DB5_MASK   32
#define CAN3TXDSR1_DB6_MASK   64
#define CAN3TXDSR1_DB7_MASK   128
#define CAN3TXDSR1_DB_MASK  255
#define CAN3TXDSR1_DB_BITNUM  0


