frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
#define PIFH_PIFH0_MASK   1
#define PIFH_PIFH1_MASK   2
#define PIFH_PIFH2_MASK   4
#define PIFH_PIFH3_MASK   8
#define PIFH_PIFH4_MASK   16
#define PIFH_PIFH5_MASK   32
#define PIFH_PIFH6_MASK   64
#define PIFH_PIFH7_MASK   128
#define PIFH_PIFH_MASK  255
#define PIFH_PIFH_BITNUM  0


/*** PTJ - Port J I/O Register; 0x00000268 ***/
typedef union {
  byte Byte;
  struct {
    byte PTJ0        :1;                                       /* Port J Bit 0 */
    byte PTJ1        :1;                                       /* Port J Bit 1 */
    byte PTJ2        :1;                                       /* Port J Bit 2 */
    byte             :1; 
    byte PTJ4        :1;                                       /* Port J Bit 4 */
    byte PTJ5        :1;                                       /* Port J Bit 5 */
    byte PTJ6        :1;                                       /* Port J Bit 6 */
    byte PTJ7        :1;                                       /* Port J Bit 7 */
  } Bits;
  struct {
    byte grpPTJ  :3;
    byte         :1;
    byte grpPTJ_4 :4;
  } MergedBits;
} PTJSTR;
extern volatile PTJSTR _PTJ @(REG_BASE + 0x00000268);
#define PTJ _PTJ.Byte
#define PTJ_PTJ0 _PTJ.Bits.PTJ0
#define PTJ_PTJ1 _PTJ.Bits.PTJ1
#define PTJ_PTJ2 _PTJ.Bits.PTJ2
#define PTJ_PTJ4 _PTJ.Bits.PTJ4
#define PTJ_PTJ5 _PTJ.Bits.PTJ5
#define PTJ_PTJ6 _PTJ.Bits.PTJ6
#define PTJ_PTJ7 _PTJ.Bits.PTJ7
#define PTJ_PTJ _PTJ.MergedBits.grpPTJ
#define PTJ_PTJ_4 _PTJ.MergedBits.grpPTJ_4

#define PTJ_PTJ0_MASK   1
#define PTJ_PTJ1_MASK   2
#define PTJ_PTJ2_MASK   4
#define PTJ_PTJ4_MASK   16
#define PTJ_PTJ5_MASK   32
#define PTJ_PTJ6_MASK   64
#define PTJ_PTJ7_MASK   128
#define PTJ_PTJ_MASK  7
#define PTJ_PTJ_BITNUM  0
#define PTJ_PTJ_4_MASK  240
#define PTJ_PTJ_4_BITNUM  4


/*** PTIJ - Port J Input Register; 0x00000269 ***/
typedef union {
  byte Byte;
  struct {
    byte PTIJ0       :1;                                       /* Port J Bit 0 */
    byte PTIJ1       :1;                                       /* Port J Bit 1 */
    byte PTIJ2       :1;                                       /* Port J Bit 2 */
    byte             :1; 
    byte PTIJ4       :1;                                       /* Port J Bit 4 */
    byte PTIJ5       :1;                                       /* Port J Bit 5 */
    byte PTIJ6       :1;                                       /* Port J Bit 6 */
    byte PTIJ7       :1;                                       /* Port J Bit 7 */
  } Bits;
  struct {
    byte grpPTIJ :3;
    byte         :1;
    byte grpPTIJ_4 :4;
  } MergedBits;
} PTIJSTR;
extern volatile PTIJSTR _PTIJ @(REG_BASE + 0x00000269);
#define PTIJ _PTIJ.Byte
#define PTIJ_PTIJ0 _PTIJ.Bits.PTIJ0
#define PTIJ_PTIJ1 _PTIJ.Bits.PTIJ1
#define PTIJ_PTIJ2 _PTIJ.Bits.PTIJ2
#define PTIJ_PTIJ4 _PTIJ.Bits.PTIJ4
#define PTIJ_PTIJ5 _PTIJ.Bits.PTIJ5
#define PTIJ_PTIJ6 _PTIJ.Bits.PTIJ6
#define PTIJ_PTIJ7 _PTIJ.Bits.PTIJ7
#define PTIJ_PTIJ _PTIJ.MergedBits.grpPTIJ
#define PTIJ_PTIJ_4 _PTIJ.MergedBits.grpPTIJ_4

#define PTIJ_PTIJ0_MASK   1
#define PTIJ_PTIJ1_MASK   2
#define PTIJ_PTIJ2_MASK   4
#define PTIJ_PTIJ4_MASK   16
#define PTIJ_PTIJ5_MASK   32
#define PTIJ_PTIJ6_MASK   64
#define PTIJ_PTIJ7_MASK   128
#define PTIJ_PTIJ_MASK  7
#define PTIJ_PTIJ_BITNUM  0
#define PTIJ_PTIJ_4_MASK  240
#define PTIJ_PTIJ_4_BITNUM  4


/*** DDRJ - Port J Data Direction Register; 0x0000026A ***/
typedef union {
  byte Byte;
  struct {
    byte DDRJ0       :1;                                       /* Data Direction Port J Bit 0 */
    byte DDRJ1       :1;                                       /* Data Direction Port J Bit 1 */
    byte DDRJ2       :1;                                       /* Data Direction Port J Bit 2 */
    byte             :1; 
    byte DDRJ4       :1;                                       /* Data Direction Port J Bit 4 */
    byte DDRJ5       :1;                                       /* Data Direction Port J Bit 5 */
    byte DDRJ6       :1;                                       /* Data Direction Port J Bit 6 */
    byte DDRJ7       :1;                                       /* Data Direction Port J Bit 7 */
  } Bits;
  struct {
    byte grpDDRJ :3;
    byte         :1;
    byte grpDDRJ_4 :4;
  } MergedBits;
} DDRJSTR;
extern volatile DDRJSTR _DDRJ @(REG_BASE + 0x0000026A);
#define DDRJ _DDRJ.Byte
#define DDRJ_DDRJ0 _DDRJ.Bits.DDRJ0
#define DDRJ_DDRJ1 _DDRJ.Bits.DDRJ1
#define DDRJ_DDRJ2 _DDRJ.Bits.DDRJ2
#define DDRJ_DDRJ4 _DDRJ.Bits.DDRJ4
#define DDRJ_DDRJ5 _DDRJ.Bits.DDRJ5
#define DDRJ_DDRJ6 _DDRJ.Bits.DDRJ6
#define DDRJ_DDRJ7 _DDRJ.Bits.DDRJ7
#define DDRJ_DDRJ _DDRJ.MergedBits.grpDDRJ
#define DDRJ_DDRJ_4 _DDRJ.MergedBits.grpDDRJ_4

#define DDRJ_DDRJ0_MASK   1
#define DDRJ_DDRJ1_MASK   2
#define DDRJ_DDRJ2_MASK   4
#define DDRJ_DDRJ4_MASK   16
#define DDRJ_DDRJ5_MASK   32
#define DDRJ_DDRJ6_MASK   64
#define DDRJ_DDRJ7_MASK   128
#define DDRJ_DDRJ_MASK  7
#define DDRJ_DDRJ_BITNUM  0
#define DDRJ_DDRJ_4_MASK  240
#define DDRJ_DDRJ_4_BITNUM  4


/*** RDRJ - Port J Reduced Drive Register; 0x0000026B ***/
typedef union {
  byte Byte;
  struct {
    byte RDRJ0       :1;                                       /* Reduced Drive Port J Bit 0 */
    byte RDRJ1       :1;                                       /* Reduced Drive Port J Bit 1 */
    byte RDRJ2       :1;                                       /* Reduced Drive Port J Bit 2 */
    byte             :1; 
    byte RDRJ4       :1;                                       /* Reduced Drive Port J Bit 4 */
    byte RDRJ5       :1;                                       /* Reduced Drive Port J Bit 5 */
    byte RDRJ6       :1;                                       /* Reduced Drive Port J Bit 6 */
    byte RDRJ7       :1;                                       /* Reduced Drive Port J Bit 7 */
  } Bits;
  struct {
    byte grpRDRJ :3;
    byte         :1;
    byte grpRDRJ_4 :4;
  } MergedBits;
} RDRJSTR;
extern volatile RDRJSTR _RDRJ @(REG_BASE + 0x0000026B);
#define RDRJ _RDRJ.Byte
#define RDRJ_RDRJ0 _RDRJ.Bits.RDRJ0
#define RDRJ_RDRJ1 _RDRJ.Bits.RDRJ1
#define RDRJ_RDRJ2 _RDRJ.Bits.RDRJ2
#define RDRJ_RDRJ4 _RDRJ.Bits.RDRJ4
#define RDRJ_RDRJ5 _RDRJ.Bits.RDRJ5
#define RDRJ_RDRJ6 _RDRJ.Bits.RDRJ6
#define RDRJ_RDRJ7 _RDRJ.Bits.RDRJ7
#define RDRJ_RDRJ _RDRJ.MergedBits.grpRDRJ
#define RDRJ_RDRJ_4 _RDRJ.MergedBits.grpRDRJ_4

#define RDRJ_RDRJ0_MASK   1
#define RDRJ_RDRJ1_MASK   2
#define RDRJ_RDRJ2_MASK   4
#define RDRJ_RDRJ4_MASK   16
#define RDRJ_RDRJ5_MASK   32
#define RDRJ_RDRJ6_MASK   64
#define RDRJ_RDRJ7_MASK   128
#define RDRJ_RDRJ_MASK  7
#define RDRJ_RDRJ_BITNUM  0
#define RDRJ_RDRJ_4_MASK  240
#define RDRJ_RDRJ_4_BITNUM  4


/*** PERJ - Port J Pull Device Enable Register; 0x0000026C ***/
typedef union {
  byte Byte;
  struct {
    byte PERJ0       :1;                                       /* Pull Device Enable Port J Bit 0 */
    byte PERJ1       :1;                                       /* Pull Device Enable Port J Bit 1 */
    byte PERJ2       :1;                                       /* Pull Device Enable Port J Bit 2 */
    byte             :1; 
    byte PERJ4       :1;                                       /* Pull Device Enable Port J Bit 4 */
    byte PERJ5       :1;                                       /* Pull Device Enable Port J Bit 5 */
    byte PERJ6       :1;                                       /* Pull Device Enable Port J Bit 6 */
    byte PERJ7       :1;                                       /* Pull Device Enable Port J Bit 7 */
  } Bits;
  struct {
    byte grpPERJ :3;
    byte         :1;
    byte grpPERJ_4 :4;
  } MergedBits;
} PERJSTR;
extern volatile PERJSTR _PERJ @(REG_BASE + 0x0000026C);
#define PERJ _PERJ.Byte
#define PERJ_PERJ0 _PERJ.Bits.PERJ0
#define PERJ_PERJ1 _PERJ.Bits.PERJ1
#define PERJ_PERJ2 _PERJ.Bits.PERJ2
#define PERJ_PERJ4 _PERJ.Bits.PERJ4
#define PERJ_PERJ5 _PERJ.Bits.PERJ5
#define PERJ_PERJ6 _PERJ.Bits.PERJ6
#define PERJ_PERJ7 _PERJ.Bits.PERJ7
#define PERJ_PERJ _PERJ.MergedBits.grpPERJ
#define PERJ_PERJ_4 _PERJ.MergedBits.grpPERJ_4

#define PERJ_PERJ0_MASK   1
#define PERJ_PERJ1_MASK   2
#define PERJ_PERJ2_MASK   4
#define PERJ_PERJ4_MASK   16
#define PERJ_PERJ5_MASK   32
#define PERJ_PERJ6_MASK   64
#define PERJ_PERJ7_MASK   128
#define PERJ_PERJ_MASK  7
#define PERJ_PERJ_BITNUM  0
#define PERJ_PERJ_4_MASK  240
#define PERJ_PERJ_4_BITNUM  4


/*** PPSJ - Port J Polarity Select Register; 0x0000026D ***/
typedef union {
  byte Byte;
  struct {
    byte PPSJ0       :1;                                       /* Pull Select Port J Bit 0 */
    byte PPSJ1       :1;                                       /* Pull Select Port J Bit 1 */
    byte PPSJ2       :1;                                       /* Pull Select Port J Bit 2 */
    byte             :1; 
    byte PPSJ4       :1;                                       /* Pull Select Port J Bit 4 */
    byte PPSJ5       :1;                                       /* Pull Select Port J Bit 5 */
    byte PPSJ6       :1;                                       /* Pull Select Port J Bit 6 */
    byte PPSJ7       :1;                                       /* Pull Select Port J Bit 7 */
  } Bits;
  struct {
    byte grpPPSJ :3;
    byte         :1;
    byte grpPPSJ_4 :4;
  } MergedBits;
} PPSJSTR;
