frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
extern volatile CAN4CTL0STR _CAN4CTL0 @(REG_BASE + 0x00000280);
#define CAN4CTL0 _CAN4CTL0.Byte
#define CAN4CTL0_INITRQ _CAN4CTL0.Bits.INITRQ
#define CAN4CTL0_SLPRQ _CAN4CTL0.Bits.SLPRQ
#define CAN4CTL0_WUPE _CAN4CTL0.Bits.WUPE
#define CAN4CTL0_TIME _CAN4CTL0.Bits.TIME
#define CAN4CTL0_SYNCH _CAN4CTL0.Bits.SYNCH
#define CAN4CTL0_CSWAI _CAN4CTL0.Bits.CSWAI
#define CAN4CTL0_RXACT _CAN4CTL0.Bits.RXACT
#define CAN4CTL0_RXFRM _CAN4CTL0.Bits.RXFRM
/* CAN4CTL_ARR: Access 2 CAN4CTLx registers in a array */
#define CAN4CTL_ARR ((Byte *) &CAN4CTL0)

#define CAN4CTL0_INITRQ_MASK   1
#define CAN4CTL0_SLPRQ_MASK   2
#define CAN4CTL0_WUPE_MASK   4
#define CAN4CTL0_TIME_MASK   8
#define CAN4CTL0_SYNCH_MASK   16
#define CAN4CTL0_CSWAI_MASK   32
#define CAN4CTL0_RXACT_MASK   64
#define CAN4CTL0_RXFRM_MASK   128


/*** CAN4CTL1 - MSCAN 4 Control 1 Register; 0x00000281 ***/
typedef union {
  byte Byte;
  struct {
    byte INITAK      :1;                                       /* Initialization Mode Acknowledge */
    byte SLPAK       :1;                                       /* Sleep Mode Acknowledge */
    byte WUPM        :1;                                       /* Wake-Up Mode */
    byte BORM        :1;                                       /* Bus-Off Recovery Mode */
    byte LISTEN      :1;                                       /* Listen Only Mode */
    byte LOOPB       :1;                                       /* Loop Back Self Test Mode */
    byte CLKSRC      :1;                                       /* MSCAN 4 Clock Source */
    byte CANE        :1;                                       /* MSCAN 4 Enable */
  } Bits;
} CAN4CTL1STR;
extern volatile CAN4CTL1STR _CAN4CTL1 @(REG_BASE + 0x00000281);
#define CAN4CTL1 _CAN4CTL1.Byte
#define CAN4CTL1_INITAK _CAN4CTL1.Bits.INITAK
#define CAN4CTL1_SLPAK _CAN4CTL1.Bits.SLPAK
#define CAN4CTL1_WUPM _CAN4CTL1.Bits.WUPM
#define CAN4CTL1_BORM _CAN4CTL1.Bits.BORM
#define CAN4CTL1_LISTEN _CAN4CTL1.Bits.LISTEN
#define CAN4CTL1_LOOPB _CAN4CTL1.Bits.LOOPB
#define CAN4CTL1_CLKSRC _CAN4CTL1.Bits.CLKSRC
#define CAN4CTL1_CANE _CAN4CTL1.Bits.CANE

#define CAN4CTL1_INITAK_MASK   1
#define CAN4CTL1_SLPAK_MASK   2
#define CAN4CTL1_WUPM_MASK   4
#define CAN4CTL1_BORM_MASK   8
#define CAN4CTL1_LISTEN_MASK   16
#define CAN4CTL1_LOOPB_MASK   32
#define CAN4CTL1_CLKSRC_MASK   64
#define CAN4CTL1_CANE_MASK   128


/*** CAN4BTR0 - MSCAN 4 Bus Timing Register 0; 0x00000282 ***/
typedef union {
  byte Byte;
  struct {
    byte BRP0        :1;                                       /* Baud Rate Prescaler 0 */
    byte BRP1        :1;                                       /* Baud Rate Prescaler 1 */
    byte BRP2        :1;                                       /* Baud Rate Prescaler 2 */
    byte BRP3        :1;                                       /* Baud Rate Prescaler 3 */
    byte BRP4        :1;                                       /* Baud Rate Prescaler 4 */
    byte BRP5        :1;                                       /* Baud Rate Prescaler 5 */
    byte SJW0        :1;                                       /* Synchronization Jump Width 0 */
    byte SJW1        :1;                                       /* Synchronization Jump Width 1 */
  } Bits;
  struct {
    byte grpBRP  :6;
    byte grpSJW  :2;
  } MergedBits;
} CAN4BTR0STR;
extern volatile CAN4BTR0STR _CAN4BTR0 @(REG_BASE + 0x00000282);
#define CAN4BTR0 _CAN4BTR0.Byte
#define CAN4BTR0_BRP0 _CAN4BTR0.Bits.BRP0
#define CAN4BTR0_BRP1 _CAN4BTR0.Bits.BRP1
#define CAN4BTR0_BRP2 _CAN4BTR0.Bits.BRP2
#define CAN4BTR0_BRP3 _CAN4BTR0.Bits.BRP3
#define CAN4BTR0_BRP4 _CAN4BTR0.Bits.BRP4
#define CAN4BTR0_BRP5 _CAN4BTR0.Bits.BRP5
#define CAN4BTR0_SJW0 _CAN4BTR0.Bits.SJW0
#define CAN4BTR0_SJW1 _CAN4BTR0.Bits.SJW1
/* CAN4BTR_ARR: Access 2 CAN4BTRx registers in a array */
#define CAN4BTR_ARR ((Byte *) &CAN4BTR0)
#define CAN4BTR0_BRP _CAN4BTR0.MergedBits.grpBRP
#define CAN4BTR0_SJW _CAN4BTR0.MergedBits.grpSJW

#define CAN4BTR0_BRP0_MASK   1
#define CAN4BTR0_BRP1_MASK   2
#define CAN4BTR0_BRP2_MASK   4
#define CAN4BTR0_BRP3_MASK   8
#define CAN4BTR0_BRP4_MASK   16
#define CAN4BTR0_BRP5_MASK   32
#define CAN4BTR0_SJW0_MASK   64
#define CAN4BTR0_SJW1_MASK   128
#define CAN4BTR0_BRP_MASK  63
#define CAN4BTR0_BRP_BITNUM  0
#define CAN4BTR0_SJW_MASK  192
#define CAN4BTR0_SJW_BITNUM  6


/*** CAN4BTR1 - MSCAN 4 Bus Timing Register 1; 0x00000283 ***/
typedef union {
  byte Byte;
  struct {
    byte TSEG10      :1;                                       /* Time Segment 10 */
    byte TSEG11      :1;                                       /* Time Segment 11 */
    byte TSEG12      :1;                                       /* Time Segment 12 */
    byte TSEG13      :1;                                       /* Time Segment 13 */
    byte TSEG20      :1;                                       /* Time Segment 20 */
    byte TSEG21      :1;                                       /* Time Segment 21 */
    byte TSEG22      :1;                                       /* Time Segment 22 */
    byte SAMP        :1;                                       /* Sampling */
  } Bits;
  struct {
    byte grpTSEG_10 :4;
    byte grpTSEG_20 :3;
    byte         :1;
  } MergedBits;
} CAN4BTR1STR;
extern volatile CAN4BTR1STR _CAN4BTR1 @(REG_BASE + 0x00000283);
#define CAN4BTR1 _CAN4BTR1.Byte
#define CAN4BTR1_TSEG10 _CAN4BTR1.Bits.TSEG10
#define CAN4BTR1_TSEG11 _CAN4BTR1.Bits.TSEG11
#define CAN4BTR1_TSEG12 _CAN4BTR1.Bits.TSEG12
#define CAN4BTR1_TSEG13 _CAN4BTR1.Bits.TSEG13
#define CAN4BTR1_TSEG20 _CAN4BTR1.Bits.TSEG20
#define CAN4BTR1_TSEG21 _CAN4BTR1.Bits.TSEG21
#define CAN4BTR1_TSEG22 _CAN4BTR1.Bits.TSEG22
#define CAN4BTR1_SAMP _CAN4BTR1.Bits.SAMP
#define CAN4BTR1_TSEG_10 _CAN4BTR1.MergedBits.grpTSEG_10
#define CAN4BTR1_TSEG_20 _CAN4BTR1.MergedBits.grpTSEG_20
#define CAN4BTR1_TSEG CAN4BTR1_TSEG_10

#define CAN4BTR1_TSEG10_MASK   1
#define CAN4BTR1_TSEG11_MASK   2
#define CAN4BTR1_TSEG12_MASK   4
#define CAN4BTR1_TSEG13_MASK   8
#define CAN4BTR1_TSEG20_MASK   16
#define CAN4BTR1_TSEG21_MASK   32
#define CAN4BTR1_TSEG22_MASK   64
#define CAN4BTR1_SAMP_MASK   128
#define CAN4BTR1_TSEG_10_MASK  15
#define CAN4BTR1_TSEG_10_BITNUM  0
#define CAN4BTR1_TSEG_20_MASK  112
#define CAN4BTR1_TSEG_20_BITNUM  4


/*** CAN4RFLG - MSCAN 4 Receiver Flag Register; 0x00000284 ***/
typedef union {
  byte Byte;
  struct {
    byte RXF         :1;                                       /* Receive Buffer Full */
    byte OVRIF       :1;                                       /* Overrun Interrupt Flag */
    byte TSTAT0      :1;                                       /* Transmitter Status Bit 0 */
    byte TSTAT1      :1;                                       /* Transmitter Status Bit 1 */
    byte RSTAT0      :1;                                       /* Receiver Status Bit 0 */
    byte RSTAT1      :1;                                       /* Receiver Status Bit 1 */
    byte CSCIF       :1;                                       /* CAN Status Change Interrupt Flag */
    byte WUPIF       :1;                                       /* Wake-up Interrupt Flag */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpTSTAT :2;
    byte grpRSTAT :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN4RFLGSTR;
extern volatile CAN4RFLGSTR _CAN4RFLG @(REG_BASE + 0x00000284);
#define CAN4RFLG _CAN4RFLG.Byte
#define CAN4RFLG_RXF _CAN4RFLG.Bits.RXF
#define CAN4RFLG_OVRIF _CAN4RFLG.Bits.OVRIF
#define CAN4RFLG_TSTAT0 _CAN4RFLG.Bits.TSTAT0
#define CAN4RFLG_TSTAT1 _CAN4RFLG.Bits.TSTAT1
#define CAN4RFLG_RSTAT0 _CAN4RFLG.Bits.RSTAT0
#define CAN4RFLG_RSTAT1 _CAN4RFLG.Bits.RSTAT1
#define CAN4RFLG_CSCIF _CAN4RFLG.Bits.CSCIF
#define CAN4RFLG_WUPIF _CAN4RFLG.Bits.WUPIF
#define CAN4RFLG_TSTAT _CAN4RFLG.MergedBits.grpTSTAT
#define CAN4RFLG_RSTAT _CAN4RFLG.MergedBits.grpRSTAT

#define CAN4RFLG_RXF_MASK   1
#define CAN4RFLG_OVRIF_MASK   2
#define CAN4RFLG_TSTAT0_MASK   4
#define CAN4RFLG_TSTAT1_MASK   8
#define CAN4RFLG_RSTAT0_MASK   16
#define CAN4RFLG_RSTAT1_MASK   32
#define CAN4RFLG_CSCIF_MASK   64
#define CAN4RFLG_WUPIF_MASK   128
#define CAN4RFLG_TSTAT_MASK  12
#define CAN4RFLG_TSTAT_BITNUM  2
#define CAN4RFLG_RSTAT_MASK  48
#define CAN4RFLG_RSTAT_BITNUM  4


