frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
extern volatile CAN4IDAR0STR _CAN4IDAR0 @(REG_BASE + 0x00000290);
#define CAN4IDAR0 _CAN4IDAR0.Byte
#define CAN4IDAR0_AC0 _CAN4IDAR0.Bits.AC0
#define CAN4IDAR0_AC1 _CAN4IDAR0.Bits.AC1
#define CAN4IDAR0_AC2 _CAN4IDAR0.Bits.AC2
#define CAN4IDAR0_AC3 _CAN4IDAR0.Bits.AC3
#define CAN4IDAR0_AC4 _CAN4IDAR0.Bits.AC4
#define CAN4IDAR0_AC5 _CAN4IDAR0.Bits.AC5
#define CAN4IDAR0_AC6 _CAN4IDAR0.Bits.AC6
#define CAN4IDAR0_AC7 _CAN4IDAR0.Bits.AC7
/* CAN4IDAR_ARR: Access 4 CAN4IDARx registers in a array */
#define CAN4IDAR_ARR ((Byte *) &CAN4IDAR0)
#define CAN4IDAR0_AC _CAN4IDAR0.MergedBits.grpAC

#define CAN4IDAR0_AC0_MASK   1
#define CAN4IDAR0_AC1_MASK   2
#define CAN4IDAR0_AC2_MASK   4
#define CAN4IDAR0_AC3_MASK   8
#define CAN4IDAR0_AC4_MASK   16
#define CAN4IDAR0_AC5_MASK   32
#define CAN4IDAR0_AC6_MASK   64
#define CAN4IDAR0_AC7_MASK   128
#define CAN4IDAR0_AC_MASK  255
#define CAN4IDAR0_AC_BITNUM  0


/*** CAN4IDAR1 - MSCAN 4 Identifier Acceptance Register 1; 0x00000291 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
  struct {
    byte grpAC   :8;
  } MergedBits;
} CAN4IDAR1STR;
extern volatile CAN4IDAR1STR _CAN4IDAR1 @(REG_BASE + 0x00000291);
#define CAN4IDAR1 _CAN4IDAR1.Byte
#define CAN4IDAR1_AC0 _CAN4IDAR1.Bits.AC0
#define CAN4IDAR1_AC1 _CAN4IDAR1.Bits.AC1
#define CAN4IDAR1_AC2 _CAN4IDAR1.Bits.AC2
#define CAN4IDAR1_AC3 _CAN4IDAR1.Bits.AC3
#define CAN4IDAR1_AC4 _CAN4IDAR1.Bits.AC4
#define CAN4IDAR1_AC5 _CAN4IDAR1.Bits.AC5
#define CAN4IDAR1_AC6 _CAN4IDAR1.Bits.AC6
#define CAN4IDAR1_AC7 _CAN4IDAR1.Bits.AC7
#define CAN4IDAR1_AC _CAN4IDAR1.MergedBits.grpAC

#define CAN4IDAR1_AC0_MASK   1
#define CAN4IDAR1_AC1_MASK   2
#define CAN4IDAR1_AC2_MASK   4
#define CAN4IDAR1_AC3_MASK   8
#define CAN4IDAR1_AC4_MASK   16
#define CAN4IDAR1_AC5_MASK   32
#define CAN4IDAR1_AC6_MASK   64
#define CAN4IDAR1_AC7_MASK   128
#define CAN4IDAR1_AC_MASK  255
#define CAN4IDAR1_AC_BITNUM  0


/*** CAN4IDAR2 - MSCAN 4 Identifier Acceptance Register 2; 0x00000292 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
  struct {
    byte grpAC   :8;
  } MergedBits;
} CAN4IDAR2STR;
extern volatile CAN4IDAR2STR _CAN4IDAR2 @(REG_BASE + 0x00000292);
#define CAN4IDAR2 _CAN4IDAR2.Byte
#define CAN4IDAR2_AC0 _CAN4IDAR2.Bits.AC0
#define CAN4IDAR2_AC1 _CAN4IDAR2.Bits.AC1
#define CAN4IDAR2_AC2 _CAN4IDAR2.Bits.AC2
#define CAN4IDAR2_AC3 _CAN4IDAR2.Bits.AC3
#define CAN4IDAR2_AC4 _CAN4IDAR2.Bits.AC4
#define CAN4IDAR2_AC5 _CAN4IDAR2.Bits.AC5
#define CAN4IDAR2_AC6 _CAN4IDAR2.Bits.AC6
#define CAN4IDAR2_AC7 _CAN4IDAR2.Bits.AC7
#define CAN4IDAR2_AC _CAN4IDAR2.MergedBits.grpAC

#define CAN4IDAR2_AC0_MASK   1
#define CAN4IDAR2_AC1_MASK   2
#define CAN4IDAR2_AC2_MASK   4
#define CAN4IDAR2_AC3_MASK   8
#define CAN4IDAR2_AC4_MASK   16
#define CAN4IDAR2_AC5_MASK   32
#define CAN4IDAR2_AC6_MASK   64
#define CAN4IDAR2_AC7_MASK   128
#define CAN4IDAR2_AC_MASK  255
#define CAN4IDAR2_AC_BITNUM  0


/*** CAN4IDAR3 - MSCAN 4 Identifier Acceptance Register 3; 0x00000293 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
  struct {
    byte grpAC   :8;
  } MergedBits;
} CAN4IDAR3STR;
extern volatile CAN4IDAR3STR _CAN4IDAR3 @(REG_BASE + 0x00000293);
#define CAN4IDAR3 _CAN4IDAR3.Byte
#define CAN4IDAR3_AC0 _CAN4IDAR3.Bits.AC0
#define CAN4IDAR3_AC1 _CAN4IDAR3.Bits.AC1
#define CAN4IDAR3_AC2 _CAN4IDAR3.Bits.AC2
#define CAN4IDAR3_AC3 _CAN4IDAR3.Bits.AC3
#define CAN4IDAR3_AC4 _CAN4IDAR3.Bits.AC4
#define CAN4IDAR3_AC5 _CAN4IDAR3.Bits.AC5
#define CAN4IDAR3_AC6 _CAN4IDAR3.Bits.AC6
#define CAN4IDAR3_AC7 _CAN4IDAR3.Bits.AC7
#define CAN4IDAR3_AC _CAN4IDAR3.MergedBits.grpAC

#define CAN4IDAR3_AC0_MASK   1
#define CAN4IDAR3_AC1_MASK   2
#define CAN4IDAR3_AC2_MASK   4
#define CAN4IDAR3_AC3_MASK   8
#define CAN4IDAR3_AC4_MASK   16
#define CAN4IDAR3_AC5_MASK   32
#define CAN4IDAR3_AC6_MASK   64
#define CAN4IDAR3_AC7_MASK   128
#define CAN4IDAR3_AC_MASK  255
#define CAN4IDAR3_AC_BITNUM  0


/*** CAN4IDMR0 - MSCAN 4 Identifier Mask Register 0; 0x00000294 ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
  struct {
    byte grpAM   :8;
  } MergedBits;
} CAN4IDMR0STR;
extern volatile CAN4IDMR0STR _CAN4IDMR0 @(REG_BASE + 0x00000294);
#define CAN4IDMR0 _CAN4IDMR0.Byte
#define CAN4IDMR0_AM0 _CAN4IDMR0.Bits.AM0
#define CAN4IDMR0_AM1 _CAN4IDMR0.Bits.AM1
#define CAN4IDMR0_AM2 _CAN4IDMR0.Bits.AM2
#define CAN4IDMR0_AM3 _CAN4IDMR0.Bits.AM3
#define CAN4IDMR0_AM4 _CAN4IDMR0.Bits.AM4
#define CAN4IDMR0_AM5 _CAN4IDMR0.Bits.AM5
#define CAN4IDMR0_AM6 _CAN4IDMR0.Bits.AM6
#define CAN4IDMR0_AM7 _CAN4IDMR0.Bits.AM7
/* CAN4IDMR_ARR: Access 4 CAN4IDMRx registers in a array */
#define CAN4IDMR_ARR ((Byte *) &CAN4IDMR0)
#define CAN4IDMR0_AM _CAN4IDMR0.MergedBits.grpAM

#define CAN4IDMR0_AM0_MASK   1
#define CAN4IDMR0_AM1_MASK   2
#define CAN4IDMR0_AM2_MASK   4
#define CAN4IDMR0_AM3_MASK   8
#define CAN4IDMR0_AM4_MASK   16
#define CAN4IDMR0_AM5_MASK   32
#define CAN4IDMR0_AM6_MASK   64
#define CAN4IDMR0_AM7_MASK   128
#define CAN4IDMR0_AM_MASK  255
#define CAN4IDMR0_AM_BITNUM  0


/*** CAN4IDMR1 - MSCAN 4 Identifier Mask Register 1; 0x00000295 ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
  struct {
    byte grpAM   :8;
  } MergedBits;
} CAN4IDMR1STR;
extern volatile CAN4IDMR1STR _CAN4IDMR1 @(REG_BASE + 0x00000295);
#define CAN4IDMR1 _CAN4IDMR1.Byte
#define CAN4IDMR1_AM0 _CAN4IDMR1.Bits.AM0
#define CAN4IDMR1_AM1 _CAN4IDMR1.Bits.AM1
#define CAN4IDMR1_AM2 _CAN4IDMR1.Bits.AM2
#define CAN4IDMR1_AM3 _CAN4IDMR1.Bits.AM3
#define CAN4IDMR1_AM4 _CAN4IDMR1.Bits.AM4
#define CAN4IDMR1_AM5 _CAN4IDMR1.Bits.AM5
#define CAN4IDMR1_AM6 _CAN4IDMR1.Bits.AM6
#define CAN4IDMR1_AM7 _CAN4IDMR1.Bits.AM7
#define CAN4IDMR1_AM _CAN4IDMR1.MergedBits.grpAM

