frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
#define CAN4IDMR1_AM0_MASK   1
#define CAN4IDMR1_AM1_MASK   2
#define CAN4IDMR1_AM2_MASK   4
#define CAN4IDMR1_AM3_MASK   8
#define CAN4IDMR1_AM4_MASK   16
#define CAN4IDMR1_AM5_MASK   32
#define CAN4IDMR1_AM6_MASK   64
#define CAN4IDMR1_AM7_MASK   128
#define CAN4IDMR1_AM_MASK  255
#define CAN4IDMR1_AM_BITNUM  0


/*** CAN4IDMR2 - MSCAN 4 Identifier Mask Register 2; 0x00000296 ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
  struct {
    byte grpAM   :8;
  } MergedBits;
} CAN4IDMR2STR;
extern volatile CAN4IDMR2STR _CAN4IDMR2 @(REG_BASE + 0x00000296);
#define CAN4IDMR2 _CAN4IDMR2.Byte
#define CAN4IDMR2_AM0 _CAN4IDMR2.Bits.AM0
#define CAN4IDMR2_AM1 _CAN4IDMR2.Bits.AM1
#define CAN4IDMR2_AM2 _CAN4IDMR2.Bits.AM2
#define CAN4IDMR2_AM3 _CAN4IDMR2.Bits.AM3
#define CAN4IDMR2_AM4 _CAN4IDMR2.Bits.AM4
#define CAN4IDMR2_AM5 _CAN4IDMR2.Bits.AM5
#define CAN4IDMR2_AM6 _CAN4IDMR2.Bits.AM6
#define CAN4IDMR2_AM7 _CAN4IDMR2.Bits.AM7
#define CAN4IDMR2_AM _CAN4IDMR2.MergedBits.grpAM

#define CAN4IDMR2_AM0_MASK   1
#define CAN4IDMR2_AM1_MASK   2
#define CAN4IDMR2_AM2_MASK   4
#define CAN4IDMR2_AM3_MASK   8
#define CAN4IDMR2_AM4_MASK   16
#define CAN4IDMR2_AM5_MASK   32
#define CAN4IDMR2_AM6_MASK   64
#define CAN4IDMR2_AM7_MASK   128
#define CAN4IDMR2_AM_MASK  255
#define CAN4IDMR2_AM_BITNUM  0


/*** CAN4IDMR3 - MSCAN 4 Identifier Mask Register 3; 0x00000297 ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
  struct {
    byte grpAM   :8;
  } MergedBits;
} CAN4IDMR3STR;
extern volatile CAN4IDMR3STR _CAN4IDMR3 @(REG_BASE + 0x00000297);
#define CAN4IDMR3 _CAN4IDMR3.Byte
#define CAN4IDMR3_AM0 _CAN4IDMR3.Bits.AM0
#define CAN4IDMR3_AM1 _CAN4IDMR3.Bits.AM1
#define CAN4IDMR3_AM2 _CAN4IDMR3.Bits.AM2
#define CAN4IDMR3_AM3 _CAN4IDMR3.Bits.AM3
#define CAN4IDMR3_AM4 _CAN4IDMR3.Bits.AM4
#define CAN4IDMR3_AM5 _CAN4IDMR3.Bits.AM5
#define CAN4IDMR3_AM6 _CAN4IDMR3.Bits.AM6
#define CAN4IDMR3_AM7 _CAN4IDMR3.Bits.AM7
#define CAN4IDMR3_AM _CAN4IDMR3.MergedBits.grpAM

#define CAN4IDMR3_AM0_MASK   1
#define CAN4IDMR3_AM1_MASK   2
#define CAN4IDMR3_AM2_MASK   4
#define CAN4IDMR3_AM3_MASK   8
#define CAN4IDMR3_AM4_MASK   16
#define CAN4IDMR3_AM5_MASK   32
#define CAN4IDMR3_AM6_MASK   64
#define CAN4IDMR3_AM7_MASK   128
#define CAN4IDMR3_AM_MASK  255
#define CAN4IDMR3_AM_BITNUM  0


/*** CAN4IDAR4 - MSCAN 4 Identifier Acceptance Register 4; 0x00000298 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
  struct {
    byte grpAC   :8;
  } MergedBits;
} CAN4IDAR4STR;
extern volatile CAN4IDAR4STR _CAN4IDAR4 @(REG_BASE + 0x00000298);
#define CAN4IDAR4 _CAN4IDAR4.Byte
#define CAN4IDAR4_AC0 _CAN4IDAR4.Bits.AC0
#define CAN4IDAR4_AC1 _CAN4IDAR4.Bits.AC1
#define CAN4IDAR4_AC2 _CAN4IDAR4.Bits.AC2
#define CAN4IDAR4_AC3 _CAN4IDAR4.Bits.AC3
#define CAN4IDAR4_AC4 _CAN4IDAR4.Bits.AC4
#define CAN4IDAR4_AC5 _CAN4IDAR4.Bits.AC5
#define CAN4IDAR4_AC6 _CAN4IDAR4.Bits.AC6
#define CAN4IDAR4_AC7 _CAN4IDAR4.Bits.AC7
#define CAN4IDAR4_AC _CAN4IDAR4.MergedBits.grpAC

#define CAN4IDAR4_AC0_MASK   1
#define CAN4IDAR4_AC1_MASK   2
#define CAN4IDAR4_AC2_MASK   4
#define CAN4IDAR4_AC3_MASK   8
#define CAN4IDAR4_AC4_MASK   16
#define CAN4IDAR4_AC5_MASK   32
#define CAN4IDAR4_AC6_MASK   64
#define CAN4IDAR4_AC7_MASK   128
#define CAN4IDAR4_AC_MASK  255
#define CAN4IDAR4_AC_BITNUM  0


/*** CAN4IDAR5 - MSCAN 4 Identifier Acceptance Register 5; 0x00000299 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
  struct {
    byte grpAC   :8;
  } MergedBits;
} CAN4IDAR5STR;
