frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
extern volatile CAN4IDAR5STR _CAN4IDAR5 @(REG_BASE + 0x00000299);
#define CAN4IDAR5 _CAN4IDAR5.Byte
#define CAN4IDAR5_AC0 _CAN4IDAR5.Bits.AC0
#define CAN4IDAR5_AC1 _CAN4IDAR5.Bits.AC1
#define CAN4IDAR5_AC2 _CAN4IDAR5.Bits.AC2
#define CAN4IDAR5_AC3 _CAN4IDAR5.Bits.AC3
#define CAN4IDAR5_AC4 _CAN4IDAR5.Bits.AC4
#define CAN4IDAR5_AC5 _CAN4IDAR5.Bits.AC5
#define CAN4IDAR5_AC6 _CAN4IDAR5.Bits.AC6
#define CAN4IDAR5_AC7 _CAN4IDAR5.Bits.AC7
#define CAN4IDAR5_AC _CAN4IDAR5.MergedBits.grpAC

#define CAN4IDAR5_AC0_MASK   1
#define CAN4IDAR5_AC1_MASK   2
#define CAN4IDAR5_AC2_MASK   4
#define CAN4IDAR5_AC3_MASK   8
#define CAN4IDAR5_AC4_MASK   16
#define CAN4IDAR5_AC5_MASK   32
#define CAN4IDAR5_AC6_MASK   64
#define CAN4IDAR5_AC7_MASK   128
#define CAN4IDAR5_AC_MASK  255
#define CAN4IDAR5_AC_BITNUM  0


/*** CAN4IDAR6 - MSCAN 4 Identifier Acceptance Register 6; 0x0000029A ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
  struct {
    byte grpAC   :8;
  } MergedBits;
} CAN4IDAR6STR;
extern volatile CAN4IDAR6STR _CAN4IDAR6 @(REG_BASE + 0x0000029A);
#define CAN4IDAR6 _CAN4IDAR6.Byte
#define CAN4IDAR6_AC0 _CAN4IDAR6.Bits.AC0
#define CAN4IDAR6_AC1 _CAN4IDAR6.Bits.AC1
#define CAN4IDAR6_AC2 _CAN4IDAR6.Bits.AC2
#define CAN4IDAR6_AC3 _CAN4IDAR6.Bits.AC3
#define CAN4IDAR6_AC4 _CAN4IDAR6.Bits.AC4
#define CAN4IDAR6_AC5 _CAN4IDAR6.Bits.AC5
#define CAN4IDAR6_AC6 _CAN4IDAR6.Bits.AC6
#define CAN4IDAR6_AC7 _CAN4IDAR6.Bits.AC7
#define CAN4IDAR6_AC _CAN4IDAR6.MergedBits.grpAC

#define CAN4IDAR6_AC0_MASK   1
#define CAN4IDAR6_AC1_MASK   2
#define CAN4IDAR6_AC2_MASK   4
#define CAN4IDAR6_AC3_MASK   8
#define CAN4IDAR6_AC4_MASK   16
#define CAN4IDAR6_AC5_MASK   32
#define CAN4IDAR6_AC6_MASK   64
#define CAN4IDAR6_AC7_MASK   128
#define CAN4IDAR6_AC_MASK  255
#define CAN4IDAR6_AC_BITNUM  0


/*** CAN4IDAR7 - MSCAN 4 Identifier Acceptance Register 7; 0x0000029B ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
  struct {
    byte grpAC   :8;
  } MergedBits;
} CAN4IDAR7STR;
extern volatile CAN4IDAR7STR _CAN4IDAR7 @(REG_BASE + 0x0000029B);
#define CAN4IDAR7 _CAN4IDAR7.Byte
#define CAN4IDAR7_AC0 _CAN4IDAR7.Bits.AC0
#define CAN4IDAR7_AC1 _CAN4IDAR7.Bits.AC1
#define CAN4IDAR7_AC2 _CAN4IDAR7.Bits.AC2
#define CAN4IDAR7_AC3 _CAN4IDAR7.Bits.AC3
#define CAN4IDAR7_AC4 _CAN4IDAR7.Bits.AC4
#define CAN4IDAR7_AC5 _CAN4IDAR7.Bits.AC5
#define CAN4IDAR7_AC6 _CAN4IDAR7.Bits.AC6
#define CAN4IDAR7_AC7 _CAN4IDAR7.Bits.AC7
#define CAN4IDAR7_AC _CAN4IDAR7.MergedBits.grpAC

#define CAN4IDAR7_AC0_MASK   1
#define CAN4IDAR7_AC1_MASK   2
#define CAN4IDAR7_AC2_MASK   4
#define CAN4IDAR7_AC3_MASK   8
#define CAN4IDAR7_AC4_MASK   16
#define CAN4IDAR7_AC5_MASK   32
#define CAN4IDAR7_AC6_MASK   64
#define CAN4IDAR7_AC7_MASK   128
#define CAN4IDAR7_AC_MASK  255
#define CAN4IDAR7_AC_BITNUM  0


/*** CAN4IDMR4 - MSCAN 4 Identifier Mask Register 4; 0x0000029C ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
  struct {
    byte grpAM   :8;
  } MergedBits;
} CAN4IDMR4STR;
extern volatile CAN4IDMR4STR _CAN4IDMR4 @(REG_BASE + 0x0000029C);
#define CAN4IDMR4 _CAN4IDMR4.Byte
#define CAN4IDMR4_AM0 _CAN4IDMR4.Bits.AM0
#define CAN4IDMR4_AM1 _CAN4IDMR4.Bits.AM1
#define CAN4IDMR4_AM2 _CAN4IDMR4.Bits.AM2
#define CAN4IDMR4_AM3 _CAN4IDMR4.Bits.AM3
#define CAN4IDMR4_AM4 _CAN4IDMR4.Bits.AM4
#define CAN4IDMR4_AM5 _CAN4IDMR4.Bits.AM5
#define CAN4IDMR4_AM6 _CAN4IDMR4.Bits.AM6
#define CAN4IDMR4_AM7 _CAN4IDMR4.Bits.AM7
#define CAN4IDMR4_AM _CAN4IDMR4.MergedBits.grpAM

#define CAN4IDMR4_AM0_MASK   1
#define CAN4IDMR4_AM1_MASK   2
#define CAN4IDMR4_AM2_MASK   4
#define CAN4IDMR4_AM3_MASK   8
#define CAN4IDMR4_AM4_MASK   16
#define CAN4IDMR4_AM5_MASK   32
#define CAN4IDMR4_AM6_MASK   64
#define CAN4IDMR4_AM7_MASK   128
#define CAN4IDMR4_AM_MASK  255
#define CAN4IDMR4_AM_BITNUM  0


/*** CAN4IDMR5 - MSCAN 4 Identifier Mask Register 5; 0x0000029D ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
  struct {
    byte grpAM   :8;
  } MergedBits;
} CAN4IDMR5STR;
extern volatile CAN4IDMR5STR _CAN4IDMR5 @(REG_BASE + 0x0000029D);
#define CAN4IDMR5 _CAN4IDMR5.Byte
#define CAN4IDMR5_AM0 _CAN4IDMR5.Bits.AM0
#define CAN4IDMR5_AM1 _CAN4IDMR5.Bits.AM1
#define CAN4IDMR5_AM2 _CAN4IDMR5.Bits.AM2
#define CAN4IDMR5_AM3 _CAN4IDMR5.Bits.AM3
#define CAN4IDMR5_AM4 _CAN4IDMR5.Bits.AM4
#define CAN4IDMR5_AM5 _CAN4IDMR5.Bits.AM5
#define CAN4IDMR5_AM6 _CAN4IDMR5.Bits.AM6
#define CAN4IDMR5_AM7 _CAN4IDMR5.Bits.AM7
#define CAN4IDMR5_AM _CAN4IDMR5.MergedBits.grpAM

#define CAN4IDMR5_AM0_MASK   1
#define CAN4IDMR5_AM1_MASK   2
#define CAN4IDMR5_AM2_MASK   4
#define CAN4IDMR5_AM3_MASK   8
#define CAN4IDMR5_AM4_MASK   16
#define CAN4IDMR5_AM5_MASK   32
#define CAN4IDMR5_AM6_MASK   64
#define CAN4IDMR5_AM7_MASK   128
#define CAN4IDMR5_AM_MASK  255
#define CAN4IDMR5_AM_BITNUM  0


/*** CAN4IDMR6 - MSCAN 4 Identifier Mask Register 6; 0x0000029E ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
  struct {
    byte grpAM   :8;
  } MergedBits;
} CAN4IDMR6STR;
