frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
#define CAN4RXIDR1_ID15_MASK   1
#define CAN4RXIDR1_ID16_MASK   2
#define CAN4RXIDR1_ID17_MASK   4
#define CAN4RXIDR1_IDE_MASK   8
#define CAN4RXIDR1_SRR_MASK   16
#define CAN4RXIDR1_ID18_MASK   32
#define CAN4RXIDR1_ID19_MASK   64
#define CAN4RXIDR1_ID20_MASK   128
#define CAN4RXIDR1_ID_15_MASK  7
#define CAN4RXIDR1_ID_15_BITNUM  0
#define CAN4RXIDR1_ID_18_MASK  224
#define CAN4RXIDR1_ID_18_BITNUM  5


/*** CAN4RXIDR2 - MSCAN 4 Receive Identifier Register 2; 0x000002A2 ***/
typedef union {
  byte Byte;
  struct {
    byte ID7         :1;                                       /* Extended format identifier Bit 7 */
    byte ID8         :1;                                       /* Extended format identifier Bit 8 */
    byte ID9         :1;                                       /* Extended format identifier Bit 9 */
    byte ID10        :1;                                       /* Extended format identifier Bit 10 */
    byte ID11        :1;                                       /* Extended format identifier Bit 11 */
    byte ID12        :1;                                       /* Extended format identifier Bit 12 */
    byte ID13        :1;                                       /* Extended format identifier Bit 13 */
    byte ID14        :1;                                       /* Extended format identifier Bit 14 */
  } Bits;
  struct {
    byte grpID_7 :8;
  } MergedBits;
} CAN4RXIDR2STR;
extern volatile CAN4RXIDR2STR _CAN4RXIDR2 @(REG_BASE + 0x000002A2);
#define CAN4RXIDR2 _CAN4RXIDR2.Byte
#define CAN4RXIDR2_ID7 _CAN4RXIDR2.Bits.ID7
#define CAN4RXIDR2_ID8 _CAN4RXIDR2.Bits.ID8
#define CAN4RXIDR2_ID9 _CAN4RXIDR2.Bits.ID9
#define CAN4RXIDR2_ID10 _CAN4RXIDR2.Bits.ID10
#define CAN4RXIDR2_ID11 _CAN4RXIDR2.Bits.ID11
#define CAN4RXIDR2_ID12 _CAN4RXIDR2.Bits.ID12
#define CAN4RXIDR2_ID13 _CAN4RXIDR2.Bits.ID13
#define CAN4RXIDR2_ID14 _CAN4RXIDR2.Bits.ID14
#define CAN4RXIDR2_ID_7 _CAN4RXIDR2.MergedBits.grpID_7
#define CAN4RXIDR2_ID CAN4RXIDR2_ID_7

#define CAN4RXIDR2_ID7_MASK   1
#define CAN4RXIDR2_ID8_MASK   2
#define CAN4RXIDR2_ID9_MASK   4
#define CAN4RXIDR2_ID10_MASK   8
#define CAN4RXIDR2_ID11_MASK   16
#define CAN4RXIDR2_ID12_MASK   32
#define CAN4RXIDR2_ID13_MASK   64
#define CAN4RXIDR2_ID14_MASK   128
#define CAN4RXIDR2_ID_7_MASK  255
#define CAN4RXIDR2_ID_7_BITNUM  0


/*** CAN4RXIDR3 - MSCAN 4 Receive Identifier Register 3; 0x000002A3 ***/
typedef union {
  byte Byte;
  struct {
    byte RTR         :1;                                       /* Remote Transmission Request */
    byte ID0         :1;                                       /* Extended format identifier Bit 0 */
    byte ID1         :1;                                       /* Extended format identifier Bit 1 */
    byte ID2         :1;                                       /* Extended format identifier Bit 2 */
    byte ID3         :1;                                       /* Extended format identifier Bit 3 */
    byte ID4         :1;                                       /* Extended format identifier Bit 4 */
    byte ID5         :1;                                       /* Extended format identifier Bit 5 */
    byte ID6         :1;                                       /* Extended format identifier Bit 6 */
  } Bits;
  struct {
    byte         :1;
    byte grpID   :7;
  } MergedBits;
} CAN4RXIDR3STR;
extern volatile CAN4RXIDR3STR _CAN4RXIDR3 @(REG_BASE + 0x000002A3);
#define CAN4RXIDR3 _CAN4RXIDR3.Byte
#define CAN4RXIDR3_RTR _CAN4RXIDR3.Bits.RTR
#define CAN4RXIDR3_ID0 _CAN4RXIDR3.Bits.ID0
#define CAN4RXIDR3_ID1 _CAN4RXIDR3.Bits.ID1
#define CAN4RXIDR3_ID2 _CAN4RXIDR3.Bits.ID2
#define CAN4RXIDR3_ID3 _CAN4RXIDR3.Bits.ID3
#define CAN4RXIDR3_ID4 _CAN4RXIDR3.Bits.ID4
#define CAN4RXIDR3_ID5 _CAN4RXIDR3.Bits.ID5
#define CAN4RXIDR3_ID6 _CAN4RXIDR3.Bits.ID6
#define CAN4RXIDR3_ID _CAN4RXIDR3.MergedBits.grpID

#define CAN4RXIDR3_RTR_MASK   1
#define CAN4RXIDR3_ID0_MASK   2
#define CAN4RXIDR3_ID1_MASK   4
#define CAN4RXIDR3_ID2_MASK   8
#define CAN4RXIDR3_ID3_MASK   16
#define CAN4RXIDR3_ID4_MASK   32
#define CAN4RXIDR3_ID5_MASK   64
#define CAN4RXIDR3_ID6_MASK   128
#define CAN4RXIDR3_ID_MASK  254
#define CAN4RXIDR3_ID_BITNUM  1


/*** CAN4RXDSR0 - MSCAN 4 Receive Data Segment Register 0; 0x000002A4 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN4RXDSR0STR;
extern volatile CAN4RXDSR0STR _CAN4RXDSR0 @(REG_BASE + 0x000002A4);
#define CAN4RXDSR0 _CAN4RXDSR0.Byte
#define CAN4RXDSR0_DB0 _CAN4RXDSR0.Bits.DB0
#define CAN4RXDSR0_DB1 _CAN4RXDSR0.Bits.DB1
#define CAN4RXDSR0_DB2 _CAN4RXDSR0.Bits.DB2
#define CAN4RXDSR0_DB3 _CAN4RXDSR0.Bits.DB3
#define CAN4RXDSR0_DB4 _CAN4RXDSR0.Bits.DB4
#define CAN4RXDSR0_DB5 _CAN4RXDSR0.Bits.DB5
#define CAN4RXDSR0_DB6 _CAN4RXDSR0.Bits.DB6
#define CAN4RXDSR0_DB7 _CAN4RXDSR0.Bits.DB7
/* CAN4RXDSR_ARR: Access 8 CAN4RXDSRx registers in a array */
#define CAN4RXDSR_ARR ((Byte *) &CAN4RXDSR0)
#define CAN4RXDSR0_DB _CAN4RXDSR0.MergedBits.grpDB

#define CAN4RXDSR0_DB0_MASK   1
#define CAN4RXDSR0_DB1_MASK   2
#define CAN4RXDSR0_DB2_MASK   4
#define CAN4RXDSR0_DB3_MASK   8
#define CAN4RXDSR0_DB4_MASK   16
#define CAN4RXDSR0_DB5_MASK   32
#define CAN4RXDSR0_DB6_MASK   64
#define CAN4RXDSR0_DB7_MASK   128
#define CAN4RXDSR0_DB_MASK  255
#define CAN4RXDSR0_DB_BITNUM  0


/*** CAN4RXDSR1 - MSCAN 4 Receive Data Segment Register 1; 0x000002A5 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN4RXDSR1STR;
extern volatile CAN4RXDSR1STR _CAN4RXDSR1 @(REG_BASE + 0x000002A5);
#define CAN4RXDSR1 _CAN4RXDSR1.Byte
#define CAN4RXDSR1_DB0 _CAN4RXDSR1.Bits.DB0
#define CAN4RXDSR1_DB1 _CAN4RXDSR1.Bits.DB1
#define CAN4RXDSR1_DB2 _CAN4RXDSR1.Bits.DB2
#define CAN4RXDSR1_DB3 _CAN4RXDSR1.Bits.DB3
#define CAN4RXDSR1_DB4 _CAN4RXDSR1.Bits.DB4
#define CAN4RXDSR1_DB5 _CAN4RXDSR1.Bits.DB5
#define CAN4RXDSR1_DB6 _CAN4RXDSR1.Bits.DB6
#define CAN4RXDSR1_DB7 _CAN4RXDSR1.Bits.DB7
#define CAN4RXDSR1_DB _CAN4RXDSR1.MergedBits.grpDB

#define CAN4RXDSR1_DB0_MASK   1
#define CAN4RXDSR1_DB1_MASK   2
#define CAN4RXDSR1_DB2_MASK   4
#define CAN4RXDSR1_DB3_MASK   8
#define CAN4RXDSR1_DB4_MASK   16
#define CAN4RXDSR1_DB5_MASK   32
#define CAN4RXDSR1_DB6_MASK   64
#define CAN4RXDSR1_DB7_MASK   128
#define CAN4RXDSR1_DB_MASK  255
#define CAN4RXDSR1_DB_BITNUM  0


