frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
/*** CAN4RXDSR2 - MSCAN 4 Receive Data Segment Register 2; 0x000002A6 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN4RXDSR2STR;
extern volatile CAN4RXDSR2STR _CAN4RXDSR2 @(REG_BASE + 0x000002A6);
#define CAN4RXDSR2 _CAN4RXDSR2.Byte
#define CAN4RXDSR2_DB0 _CAN4RXDSR2.Bits.DB0
#define CAN4RXDSR2_DB1 _CAN4RXDSR2.Bits.DB1
#define CAN4RXDSR2_DB2 _CAN4RXDSR2.Bits.DB2
#define CAN4RXDSR2_DB3 _CAN4RXDSR2.Bits.DB3
#define CAN4RXDSR2_DB4 _CAN4RXDSR2.Bits.DB4
#define CAN4RXDSR2_DB5 _CAN4RXDSR2.Bits.DB5
#define CAN4RXDSR2_DB6 _CAN4RXDSR2.Bits.DB6
#define CAN4RXDSR2_DB7 _CAN4RXDSR2.Bits.DB7
#define CAN4RXDSR2_DB _CAN4RXDSR2.MergedBits.grpDB

#define CAN4RXDSR2_DB0_MASK   1
#define CAN4RXDSR2_DB1_MASK   2
#define CAN4RXDSR2_DB2_MASK   4
#define CAN4RXDSR2_DB3_MASK   8
#define CAN4RXDSR2_DB4_MASK   16
#define CAN4RXDSR2_DB5_MASK   32
#define CAN4RXDSR2_DB6_MASK   64
#define CAN4RXDSR2_DB7_MASK   128
#define CAN4RXDSR2_DB_MASK  255
#define CAN4RXDSR2_DB_BITNUM  0


/*** CAN4RXDSR3 - MSCAN 4 Receive Data Segment Register 3; 0x000002A7 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN4RXDSR3STR;
extern volatile CAN4RXDSR3STR _CAN4RXDSR3 @(REG_BASE + 0x000002A7);
#define CAN4RXDSR3 _CAN4RXDSR3.Byte
#define CAN4RXDSR3_DB0 _CAN4RXDSR3.Bits.DB0
#define CAN4RXDSR3_DB1 _CAN4RXDSR3.Bits.DB1
#define CAN4RXDSR3_DB2 _CAN4RXDSR3.Bits.DB2
#define CAN4RXDSR3_DB3 _CAN4RXDSR3.Bits.DB3
#define CAN4RXDSR3_DB4 _CAN4RXDSR3.Bits.DB4
#define CAN4RXDSR3_DB5 _CAN4RXDSR3.Bits.DB5
#define CAN4RXDSR3_DB6 _CAN4RXDSR3.Bits.DB6
#define CAN4RXDSR3_DB7 _CAN4RXDSR3.Bits.DB7
#define CAN4RXDSR3_DB _CAN4RXDSR3.MergedBits.grpDB

#define CAN4RXDSR3_DB0_MASK   1
#define CAN4RXDSR3_DB1_MASK   2
#define CAN4RXDSR3_DB2_MASK   4
#define CAN4RXDSR3_DB3_MASK   8
#define CAN4RXDSR3_DB4_MASK   16
#define CAN4RXDSR3_DB5_MASK   32
#define CAN4RXDSR3_DB6_MASK   64
#define CAN4RXDSR3_DB7_MASK   128
#define CAN4RXDSR3_DB_MASK  255
#define CAN4RXDSR3_DB_BITNUM  0


/*** CAN4RXDSR4 - MSCAN 4 Receive Data Segment Register 4; 0x000002A8 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN4RXDSR4STR;
extern volatile CAN4RXDSR4STR _CAN4RXDSR4 @(REG_BASE + 0x000002A8);
#define CAN4RXDSR4 _CAN4RXDSR4.Byte
#define CAN4RXDSR4_DB0 _CAN4RXDSR4.Bits.DB0
#define CAN4RXDSR4_DB1 _CAN4RXDSR4.Bits.DB1
#define CAN4RXDSR4_DB2 _CAN4RXDSR4.Bits.DB2
#define CAN4RXDSR4_DB3 _CAN4RXDSR4.Bits.DB3
#define CAN4RXDSR4_DB4 _CAN4RXDSR4.Bits.DB4
#define CAN4RXDSR4_DB5 _CAN4RXDSR4.Bits.DB5
#define CAN4RXDSR4_DB6 _CAN4RXDSR4.Bits.DB6
#define CAN4RXDSR4_DB7 _CAN4RXDSR4.Bits.DB7
#define CAN4RXDSR4_DB _CAN4RXDSR4.MergedBits.grpDB

#define CAN4RXDSR4_DB0_MASK   1
#define CAN4RXDSR4_DB1_MASK   2
#define CAN4RXDSR4_DB2_MASK   4
#define CAN4RXDSR4_DB3_MASK   8
#define CAN4RXDSR4_DB4_MASK   16
#define CAN4RXDSR4_DB5_MASK   32
#define CAN4RXDSR4_DB6_MASK   64
#define CAN4RXDSR4_DB7_MASK   128
#define CAN4RXDSR4_DB_MASK  255
#define CAN4RXDSR4_DB_BITNUM  0


/*** CAN4RXDSR5 - MSCAN 4 Receive Data Segment Register 5; 0x000002A9 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN4RXDSR5STR;
extern volatile CAN4RXDSR5STR _CAN4RXDSR5 @(REG_BASE + 0x000002A9);
#define CAN4RXDSR5 _CAN4RXDSR5.Byte
#define CAN4RXDSR5_DB0 _CAN4RXDSR5.Bits.DB0
#define CAN4RXDSR5_DB1 _CAN4RXDSR5.Bits.DB1
#define CAN4RXDSR5_DB2 _CAN4RXDSR5.Bits.DB2
#define CAN4RXDSR5_DB3 _CAN4RXDSR5.Bits.DB3
#define CAN4RXDSR5_DB4 _CAN4RXDSR5.Bits.DB4
#define CAN4RXDSR5_DB5 _CAN4RXDSR5.Bits.DB5
#define CAN4RXDSR5_DB6 _CAN4RXDSR5.Bits.DB6
#define CAN4RXDSR5_DB7 _CAN4RXDSR5.Bits.DB7
#define CAN4RXDSR5_DB _CAN4RXDSR5.MergedBits.grpDB

#define CAN4RXDSR5_DB0_MASK   1
#define CAN4RXDSR5_DB1_MASK   2
#define CAN4RXDSR5_DB2_MASK   4
#define CAN4RXDSR5_DB3_MASK   8
#define CAN4RXDSR5_DB4_MASK   16
#define CAN4RXDSR5_DB5_MASK   32
#define CAN4RXDSR5_DB6_MASK   64
#define CAN4RXDSR5_DB7_MASK   128
#define CAN4RXDSR5_DB_MASK  255
#define CAN4RXDSR5_DB_BITNUM  0


/*** CAN4RXDSR6 - MSCAN 4 Receive Data Segment Register 6; 0x000002AA ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN4RXDSR6STR;
extern volatile CAN4RXDSR6STR _CAN4RXDSR6 @(REG_BASE + 0x000002AA);
#define CAN4RXDSR6 _CAN4RXDSR6.Byte
#define CAN4RXDSR6_DB0 _CAN4RXDSR6.Bits.DB0
#define CAN4RXDSR6_DB1 _CAN4RXDSR6.Bits.DB1
#define CAN4RXDSR6_DB2 _CAN4RXDSR6.Bits.DB2
#define CAN4RXDSR6_DB3 _CAN4RXDSR6.Bits.DB3
#define CAN4RXDSR6_DB4 _CAN4RXDSR6.Bits.DB4
#define CAN4RXDSR6_DB5 _CAN4RXDSR6.Bits.DB5
#define CAN4RXDSR6_DB6 _CAN4RXDSR6.Bits.DB6
#define CAN4RXDSR6_DB7 _CAN4RXDSR6.Bits.DB7
#define CAN4RXDSR6_DB _CAN4RXDSR6.MergedBits.grpDB

#define CAN4RXDSR6_DB0_MASK   1
#define CAN4RXDSR6_DB1_MASK   2
#define CAN4RXDSR6_DB2_MASK   4
#define CAN4RXDSR6_DB3_MASK   8
#define CAN4RXDSR6_DB4_MASK   16
#define CAN4RXDSR6_DB5_MASK   32
#define CAN4RXDSR6_DB6_MASK   64
#define CAN4RXDSR6_DB7_MASK   128
#define CAN4RXDSR6_DB_MASK  255
#define CAN4RXDSR6_DB_BITNUM  0


/*** CAN4RXDSR7 - MSCAN 4 Receive Data Segment Register 7; 0x000002AB ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN4RXDSR7STR;
extern volatile CAN4RXDSR7STR _CAN4RXDSR7 @(REG_BASE + 0x000002AB);
#define CAN4RXDSR7 _CAN4RXDSR7.Byte
#define CAN4RXDSR7_DB0 _CAN4RXDSR7.Bits.DB0
#define CAN4RXDSR7_DB1 _CAN4RXDSR7.Bits.DB1
#define CAN4RXDSR7_DB2 _CAN4RXDSR7.Bits.DB2
#define CAN4RXDSR7_DB3 _CAN4RXDSR7.Bits.DB3
#define CAN4RXDSR7_DB4 _CAN4RXDSR7.Bits.DB4
#define CAN4RXDSR7_DB5 _CAN4RXDSR7.Bits.DB5
#define CAN4RXDSR7_DB6 _CAN4RXDSR7.Bits.DB6
#define CAN4RXDSR7_DB7 _CAN4RXDSR7.Bits.DB7
#define CAN4RXDSR7_DB _CAN4RXDSR7.MergedBits.grpDB

