frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
extern volatile ATD0STAT2STR _ATD0STAT2 @(REG_BASE + 0x000002CA);
#define ATD0STAT2 _ATD0STAT2.Byte
#define ATD0STAT2_CCF8 _ATD0STAT2.Bits.CCF8
#define ATD0STAT2_CCF9 _ATD0STAT2.Bits.CCF9
#define ATD0STAT2_CCF10 _ATD0STAT2.Bits.CCF10
#define ATD0STAT2_CCF11 _ATD0STAT2.Bits.CCF11
#define ATD0STAT2_CCF12 _ATD0STAT2.Bits.CCF12
#define ATD0STAT2_CCF13 _ATD0STAT2.Bits.CCF13
#define ATD0STAT2_CCF14 _ATD0STAT2.Bits.CCF14
#define ATD0STAT2_CCF15 _ATD0STAT2.Bits.CCF15
#define ATD0STAT2_CCF_8 _ATD0STAT2.MergedBits.grpCCF_8
#define ATD0STAT2_CCF ATD0STAT2_CCF_8

#define ATD0STAT2_CCF8_MASK   1
#define ATD0STAT2_CCF9_MASK   2
#define ATD0STAT2_CCF10_MASK   4
#define ATD0STAT2_CCF11_MASK   8
#define ATD0STAT2_CCF12_MASK   16
#define ATD0STAT2_CCF13_MASK   32
#define ATD0STAT2_CCF14_MASK   64
#define ATD0STAT2_CCF15_MASK   128
#define ATD0STAT2_CCF_8_MASK  255
#define ATD0STAT2_CCF_8_BITNUM  0


/*** ATD0STAT1 - ATD 0 Status Register 1; 0x000002CB ***/
typedef union {
  byte Byte;
  struct {
    byte CCF0        :1;                                       /* Conversion Complete Flag 0 */
    byte CCF1        :1;                                       /* Conversion Complete Flag 1 */
    byte CCF2        :1;                                       /* Conversion Complete Flag 2 */
    byte CCF3        :1;                                       /* Conversion Complete Flag 3 */
    byte CCF4        :1;                                       /* Conversion Complete Flag 4 */
    byte CCF5        :1;                                       /* Conversion Complete Flag 5 */
    byte CCF6        :1;                                       /* Conversion Complete Flag 6 */
    byte CCF7        :1;                                       /* Conversion Complete Flag 7 */
  } Bits;
  struct {
    byte grpCCF  :8;
  } MergedBits;
} ATD0STAT1STR;
extern volatile ATD0STAT1STR _ATD0STAT1 @(REG_BASE + 0x000002CB);
#define ATD0STAT1 _ATD0STAT1.Byte
#define ATD0STAT1_CCF0 _ATD0STAT1.Bits.CCF0
#define ATD0STAT1_CCF1 _ATD0STAT1.Bits.CCF1
#define ATD0STAT1_CCF2 _ATD0STAT1.Bits.CCF2
#define ATD0STAT1_CCF3 _ATD0STAT1.Bits.CCF3
#define ATD0STAT1_CCF4 _ATD0STAT1.Bits.CCF4
#define ATD0STAT1_CCF5 _ATD0STAT1.Bits.CCF5
#define ATD0STAT1_CCF6 _ATD0STAT1.Bits.CCF6
#define ATD0STAT1_CCF7 _ATD0STAT1.Bits.CCF7
#define ATD0STAT1_CCF _ATD0STAT1.MergedBits.grpCCF

#define ATD0STAT1_CCF0_MASK   1
#define ATD0STAT1_CCF1_MASK   2
#define ATD0STAT1_CCF2_MASK   4
#define ATD0STAT1_CCF3_MASK   8
#define ATD0STAT1_CCF4_MASK   16
#define ATD0STAT1_CCF5_MASK   32
#define ATD0STAT1_CCF6_MASK   64
#define ATD0STAT1_CCF7_MASK   128
#define ATD0STAT1_CCF_MASK  255
#define ATD0STAT1_CCF_BITNUM  0


/*** ATD0DIEN - ATD 0 Input Enable Register; 0x000002CD ***/
typedef union {
  byte Byte;
  struct {
    byte IEN0        :1;                                       /* ATD Digital Input Enable on channel 0 */
    byte IEN1        :1;                                       /* ATD Digital Input Enable on channel 1 */
    byte IEN2        :1;                                       /* ATD Digital Input Enable on channel 2 */
    byte IEN3        :1;                                       /* ATD Digital Input Enable on channel 3 */
    byte IEN4        :1;                                       /* ATD Digital Input Enable on channel 4 */
    byte IEN5        :1;                                       /* ATD Digital Input Enable on channel 5 */
    byte IEN6        :1;                                       /* ATD Digital Input Enable on channel 6 */
    byte IEN7        :1;                                       /* ATD Digital Input Enable on channel 7 */
  } Bits;
  struct {
    byte grpIEN  :8;
  } MergedBits;
} ATD0DIENSTR;
extern volatile ATD0DIENSTR _ATD0DIEN @(REG_BASE + 0x000002CD);
#define ATD0DIEN _ATD0DIEN.Byte
#define ATD0DIEN_IEN0 _ATD0DIEN.Bits.IEN0
#define ATD0DIEN_IEN1 _ATD0DIEN.Bits.IEN1
#define ATD0DIEN_IEN2 _ATD0DIEN.Bits.IEN2
#define ATD0DIEN_IEN3 _ATD0DIEN.Bits.IEN3
#define ATD0DIEN_IEN4 _ATD0DIEN.Bits.IEN4
#define ATD0DIEN_IEN5 _ATD0DIEN.Bits.IEN5
#define ATD0DIEN_IEN6 _ATD0DIEN.Bits.IEN6
#define ATD0DIEN_IEN7 _ATD0DIEN.Bits.IEN7
#define ATD0DIEN_IEN _ATD0DIEN.MergedBits.grpIEN

#define ATD0DIEN_IEN0_MASK   1
#define ATD0DIEN_IEN1_MASK   2
#define ATD0DIEN_IEN2_MASK   4
#define ATD0DIEN_IEN3_MASK   8
#define ATD0DIEN_IEN4_MASK   16
#define ATD0DIEN_IEN5_MASK   32
#define ATD0DIEN_IEN6_MASK   64
#define ATD0DIEN_IEN7_MASK   128
#define ATD0DIEN_IEN_MASK  255
#define ATD0DIEN_IEN_BITNUM  0


/*** ATD0_PORTAD0 - ATD 0 Port AD0 Register; 0x000002CF ***/
typedef union {
  byte Byte;
  struct {
    byte PTAD0       :1;                                       /* A/D Channel 0 (AN0) Digital Input */
    byte PTAD1       :1;                                       /* A/D Channel 1 (AN1) Digital Input */
    byte PTAD2       :1;                                       /* A/D Channel 2 (AN2) Digital Input */
    byte PTAD3       :1;                                       /* A/D Channel 3 (AN3) Digital Input */
    byte PTAD4       :1;                                       /* A/D Channel 4 (AN4) Digital Input */
    byte PTAD5       :1;                                       /* A/D Channel 5 (AN5) Digital Input */
    byte PTAD6       :1;                                       /* A/D Channel 6 (AN6) Digital Input */
    byte PTAD7       :1;                                       /* A/D Channel 7 (AN7) Digital Input */
  } Bits;
  struct {
    byte grpPTAD :8;
  } MergedBits;
} ATD0_PORTAD0STR;
extern volatile ATD0_PORTAD0STR _ATD0_PORTAD0 @(REG_BASE + 0x000002CF);
#define ATD0_PORTAD0 _ATD0_PORTAD0.Byte
#define ATD0_PORTAD0_PTAD0 _ATD0_PORTAD0.Bits.PTAD0
#define ATD0_PORTAD0_PTAD1 _ATD0_PORTAD0.Bits.PTAD1
#define ATD0_PORTAD0_PTAD2 _ATD0_PORTAD0.Bits.PTAD2
#define ATD0_PORTAD0_PTAD3 _ATD0_PORTAD0.Bits.PTAD3
#define ATD0_PORTAD0_PTAD4 _ATD0_PORTAD0.Bits.PTAD4
#define ATD0_PORTAD0_PTAD5 _ATD0_PORTAD0.Bits.PTAD5
#define ATD0_PORTAD0_PTAD6 _ATD0_PORTAD0.Bits.PTAD6
#define ATD0_PORTAD0_PTAD7 _ATD0_PORTAD0.Bits.PTAD7
#define ATD0_PORTAD0_PTAD _ATD0_PORTAD0.MergedBits.grpPTAD

#define ATD0_PORTAD0_PTAD0_MASK   1
#define ATD0_PORTAD0_PTAD1_MASK   2
#define ATD0_PORTAD0_PTAD2_MASK   4
#define ATD0_PORTAD0_PTAD3_MASK   8
#define ATD0_PORTAD0_PTAD4_MASK   16
#define ATD0_PORTAD0_PTAD5_MASK   32
#define ATD0_PORTAD0_PTAD6_MASK   64
#define ATD0_PORTAD0_PTAD7_MASK   128
#define ATD0_PORTAD0_PTAD_MASK  255
#define ATD0_PORTAD0_PTAD_BITNUM  0


/*** ATD0DR0 - ATD 0 Conversion Result Register 0; 0x000002D0 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD0DR0H - ATD 0 Conversion Result Register 0 High; 0x000002D0 ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Bit 8 */
        byte BIT9        :1;                                       /* Bit 9 */
        byte BIT10       :1;                                       /* Bit 10 */
        byte BIT11       :1;                                       /* Bit 11 */
        byte BIT12       :1;                                       /* Bit 12 */
        byte BIT13       :1;                                       /* Bit 13 */
        byte BIT14       :1;                                       /* Bit 14 */
        byte BIT15       :1;                                       /* Bit 15 */
      } Bits;
      struct {
        byte grpBIT_8 :8;
      } MergedBits;
    } ATD0DR0HSTR;
    #define ATD0DR0H _ATD0DR0.Overlap_STR.ATD0DR0HSTR.Byte
    #define ATD0DR0H_BIT8 _ATD0DR0.Overlap_STR.ATD0DR0HSTR.Bits.BIT8
    #define ATD0DR0H_BIT9 _ATD0DR0.Overlap_STR.ATD0DR0HSTR.Bits.BIT9
    #define ATD0DR0H_BIT10 _ATD0DR0.Overlap_STR.ATD0DR0HSTR.Bits.BIT10
    #define ATD0DR0H_BIT11 _ATD0DR0.Overlap_STR.ATD0DR0HSTR.Bits.BIT11
    #define ATD0DR0H_BIT12 _ATD0DR0.Overlap_STR.ATD0DR0HSTR.Bits.BIT12
    #define ATD0DR0H_BIT13 _ATD0DR0.Overlap_STR.ATD0DR0HSTR.Bits.BIT13
    #define ATD0DR0H_BIT14 _ATD0DR0.Overlap_STR.ATD0DR0HSTR.Bits.BIT14
    #define ATD0DR0H_BIT15 _ATD0DR0.Overlap_STR.ATD0DR0HSTR.Bits.BIT15
    
    #define ATD0DR0H_BIT_8 _ATD0DR0.Overlap_STR.ATD0DR0HSTR.MergedBits.grpBIT_8
    #define ATD0DR0H_BIT ATD0DR0H_BIT_8
    
    #define ATD0DR0H_BIT8_MASK   1
    #define ATD0DR0H_BIT9_MASK   2
    #define ATD0DR0H_BIT10_MASK   4
    #define ATD0DR0H_BIT11_MASK   8
    #define ATD0DR0H_BIT12_MASK   16
    #define ATD0DR0H_BIT13_MASK   32
    #define ATD0DR0H_BIT14_MASK   64
    #define ATD0DR0H_BIT15_MASK   128
    #define ATD0DR0H_BIT_8_MASK  255
    #define ATD0DR0H_BIT_8_BITNUM  0


    /*** ATD0DR0L - ATD 0 Conversion Result Register 0 Low; 0x000002D1 ***/
    union {
      byte Byte;
      struct {
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte BIT6        :1;                                       /* Bit 6 */
        byte BIT7        :1;                                       /* Bit 7 */
      } Bits;
      struct {
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte grpBIT_6 :2;
      } MergedBits;
    } ATD0DR0LSTR;
    #define ATD0DR0L _ATD0DR0.Overlap_STR.ATD0DR0LSTR.Byte
    #define ATD0DR0L_BIT6 _ATD0DR0.Overlap_STR.ATD0DR0LSTR.Bits.BIT6
    #define ATD0DR0L_BIT7 _ATD0DR0.Overlap_STR.ATD0DR0LSTR.Bits.BIT7
    
    #define ATD0DR0L_BIT_6 _ATD0DR0.Overlap_STR.ATD0DR0LSTR.MergedBits.grpBIT_6
    #define ATD0DR0L_BIT ATD0DR0L_BIT_6
    
    #define ATD0DR0L_BIT6_MASK   64
    #define ATD0DR0L_BIT7_MASK   128
    #define ATD0DR0L_BIT_6_MASK  192
    #define ATD0DR0L_BIT_6_BITNUM  6

  } Overlap_STR;

