frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
#define PITLD0_PLD0_MASK   1
#define PITLD0_PLD1_MASK   2
#define PITLD0_PLD2_MASK   4
#define PITLD0_PLD3_MASK   8
#define PITLD0_PLD4_MASK   16
#define PITLD0_PLD5_MASK   32
#define PITLD0_PLD6_MASK   64
#define PITLD0_PLD7_MASK   128
#define PITLD0_PLD8_MASK   256
#define PITLD0_PLD9_MASK   512
#define PITLD0_PLD10_MASK   1024
#define PITLD0_PLD11_MASK   2048
#define PITLD0_PLD12_MASK   4096
#define PITLD0_PLD13_MASK   8192
#define PITLD0_PLD14_MASK   16384
#define PITLD0_PLD15_MASK   32768
#define PITLD0_PLD_MASK  65535
#define PITLD0_PLD_BITNUM  0


/*** PITCNT0 - PIT Count Register 0; 0x0000034A ***/
typedef union {
  word Word;
  struct {
    word PCNT0       :1;                                       /* PIT Count Bit 0 */
    word PCNT1       :1;                                       /* PIT Count Bit 1 */
    word PCNT2       :1;                                       /* PIT Count Bit 2 */
    word PCNT3       :1;                                       /* PIT Count Bit 3 */
    word PCNT4       :1;                                       /* PIT Count Bit 4 */
    word PCNT5       :1;                                       /* PIT Count Bit 5 */
    word PCNT6       :1;                                       /* PIT Count Bit 6 */
    word PCNT7       :1;                                       /* PIT Count Bit 7 */
    word PCNT8       :1;                                       /* PIT Count Bit 8 */
    word PCNT9       :1;                                       /* PIT Count Bit 9 */
    word PCNT10      :1;                                       /* PIT Count Bit 10 */
    word PCNT11      :1;                                       /* PIT Count Bit 11 */
    word PCNT12      :1;                                       /* PIT Count Bit 12 */
    word PCNT13      :1;                                       /* PIT Count Bit 13 */
    word PCNT14      :1;                                       /* PIT Count Bit 14 */
    word PCNT15      :1;                                       /* PIT Count Bit 15 */
  } Bits;
  struct {
    word grpPCNT :16;
  } MergedBits;
} PITCNT0STR;
extern volatile PITCNT0STR _PITCNT0 @(REG_BASE + 0x0000034A);
#define PITCNT0 _PITCNT0.Word
#define PITCNT0_PCNT0 _PITCNT0.Bits.PCNT0
#define PITCNT0_PCNT1 _PITCNT0.Bits.PCNT1
#define PITCNT0_PCNT2 _PITCNT0.Bits.PCNT2
#define PITCNT0_PCNT3 _PITCNT0.Bits.PCNT3
#define PITCNT0_PCNT4 _PITCNT0.Bits.PCNT4
#define PITCNT0_PCNT5 _PITCNT0.Bits.PCNT5
#define PITCNT0_PCNT6 _PITCNT0.Bits.PCNT6
#define PITCNT0_PCNT7 _PITCNT0.Bits.PCNT7
#define PITCNT0_PCNT8 _PITCNT0.Bits.PCNT8
#define PITCNT0_PCNT9 _PITCNT0.Bits.PCNT9
#define PITCNT0_PCNT10 _PITCNT0.Bits.PCNT10
#define PITCNT0_PCNT11 _PITCNT0.Bits.PCNT11
#define PITCNT0_PCNT12 _PITCNT0.Bits.PCNT12
#define PITCNT0_PCNT13 _PITCNT0.Bits.PCNT13
#define PITCNT0_PCNT14 _PITCNT0.Bits.PCNT14
#define PITCNT0_PCNT15 _PITCNT0.Bits.PCNT15
#define PITCNT0_PCNT _PITCNT0.MergedBits.grpPCNT

#define PITCNT0_PCNT0_MASK   1
#define PITCNT0_PCNT1_MASK   2
#define PITCNT0_PCNT2_MASK   4
#define PITCNT0_PCNT3_MASK   8
#define PITCNT0_PCNT4_MASK   16
#define PITCNT0_PCNT5_MASK   32
#define PITCNT0_PCNT6_MASK   64
#define PITCNT0_PCNT7_MASK   128
#define PITCNT0_PCNT8_MASK   256
#define PITCNT0_PCNT9_MASK   512
#define PITCNT0_PCNT10_MASK   1024
#define PITCNT0_PCNT11_MASK   2048
#define PITCNT0_PCNT12_MASK   4096
#define PITCNT0_PCNT13_MASK   8192
#define PITCNT0_PCNT14_MASK   16384
#define PITCNT0_PCNT15_MASK   32768
#define PITCNT0_PCNT_MASK  65535
#define PITCNT0_PCNT_BITNUM  0


/*** PITLD1 - PIT Load Register 1; 0x0000034C ***/
typedef union {
  word Word;
  struct {
    word PLD0        :1;                                       /* PIT Load Bit 0 */
    word PLD1        :1;                                       /* PIT Load Bit 1 */
    word PLD2        :1;                                       /* PIT Load Bit 2 */
    word PLD3        :1;                                       /* PIT Load Bit 3 */
    word PLD4        :1;                                       /* PIT Load Bit 4 */
    word PLD5        :1;                                       /* PIT Load Bit 5 */
    word PLD6        :1;                                       /* PIT Load Bit 6 */
    word PLD7        :1;                                       /* PIT Load Bit 7 */
    word PLD8        :1;                                       /* PIT Load Bit 8 */
    word PLD9        :1;                                       /* PIT Load Bit 9 */
    word PLD10       :1;                                       /* PIT Load Bit 10 */
    word PLD11       :1;                                       /* PIT Load Bit 11 */
    word PLD12       :1;                                       /* PIT Load Bit 12 */
    word PLD13       :1;                                       /* PIT Load Bit 13 */
    word PLD14       :1;                                       /* PIT Load Bit 14 */
    word PLD15       :1;                                       /* PIT Load Bit 15 */
  } Bits;
  struct {
    word grpPLD  :16;
  } MergedBits;
} PITLD1STR;
extern volatile PITLD1STR _PITLD1 @(REG_BASE + 0x0000034C);
#define PITLD1 _PITLD1.Word
#define PITLD1_PLD0 _PITLD1.Bits.PLD0
#define PITLD1_PLD1 _PITLD1.Bits.PLD1
#define PITLD1_PLD2 _PITLD1.Bits.PLD2
#define PITLD1_PLD3 _PITLD1.Bits.PLD3
#define PITLD1_PLD4 _PITLD1.Bits.PLD4
#define PITLD1_PLD5 _PITLD1.Bits.PLD5
#define PITLD1_PLD6 _PITLD1.Bits.PLD6
#define PITLD1_PLD7 _PITLD1.Bits.PLD7
#define PITLD1_PLD8 _PITLD1.Bits.PLD8
#define PITLD1_PLD9 _PITLD1.Bits.PLD9
#define PITLD1_PLD10 _PITLD1.Bits.PLD10
#define PITLD1_PLD11 _PITLD1.Bits.PLD11
#define PITLD1_PLD12 _PITLD1.Bits.PLD12
#define PITLD1_PLD13 _PITLD1.Bits.PLD13
#define PITLD1_PLD14 _PITLD1.Bits.PLD14
#define PITLD1_PLD15 _PITLD1.Bits.PLD15
#define PITLD1_PLD _PITLD1.MergedBits.grpPLD

#define PITLD1_PLD0_MASK   1
#define PITLD1_PLD1_MASK   2
#define PITLD1_PLD2_MASK   4
#define PITLD1_PLD3_MASK   8
#define PITLD1_PLD4_MASK   16
#define PITLD1_PLD5_MASK   32
#define PITLD1_PLD6_MASK   64
#define PITLD1_PLD7_MASK   128
#define PITLD1_PLD8_MASK   256
#define PITLD1_PLD9_MASK   512
#define PITLD1_PLD10_MASK   1024
#define PITLD1_PLD11_MASK   2048
#define PITLD1_PLD12_MASK   4096
#define PITLD1_PLD13_MASK   8192
#define PITLD1_PLD14_MASK   16384
#define PITLD1_PLD15_MASK   32768
#define PITLD1_PLD_MASK  65535
#define PITLD1_PLD_BITNUM  0


/*** PITCNT1 - PIT Count Register 1; 0x0000034E ***/
typedef union {
  word Word;
  struct {
    word PCNT0       :1;                                       /* PIT Count Bit 0 */
    word PCNT1       :1;                                       /* PIT Count Bit 1 */
    word PCNT2       :1;                                       /* PIT Count Bit 2 */
    word PCNT3       :1;                                       /* PIT Count Bit 3 */
    word PCNT4       :1;                                       /* PIT Count Bit 4 */
    word PCNT5       :1;                                       /* PIT Count Bit 5 */
    word PCNT6       :1;                                       /* PIT Count Bit 6 */
    word PCNT7       :1;                                       /* PIT Count Bit 7 */
    word PCNT8       :1;                                       /* PIT Count Bit 8 */
    word PCNT9       :1;                                       /* PIT Count Bit 9 */
    word PCNT10      :1;                                       /* PIT Count Bit 10 */
    word PCNT11      :1;                                       /* PIT Count Bit 11 */
    word PCNT12      :1;                                       /* PIT Count Bit 12 */
    word PCNT13      :1;                                       /* PIT Count Bit 13 */
    word PCNT14      :1;                                       /* PIT Count Bit 14 */
    word PCNT15      :1;                                       /* PIT Count Bit 15 */
  } Bits;
  struct {
    word grpPCNT :16;
  } MergedBits;
} PITCNT1STR;
extern volatile PITCNT1STR _PITCNT1 @(REG_BASE + 0x0000034E);
#define PITCNT1 _PITCNT1.Word
#define PITCNT1_PCNT0 _PITCNT1.Bits.PCNT0
#define PITCNT1_PCNT1 _PITCNT1.Bits.PCNT1
#define PITCNT1_PCNT2 _PITCNT1.Bits.PCNT2
#define PITCNT1_PCNT3 _PITCNT1.Bits.PCNT3
#define PITCNT1_PCNT4 _PITCNT1.Bits.PCNT4
#define PITCNT1_PCNT5 _PITCNT1.Bits.PCNT5
#define PITCNT1_PCNT6 _PITCNT1.Bits.PCNT6
#define PITCNT1_PCNT7 _PITCNT1.Bits.PCNT7
#define PITCNT1_PCNT8 _PITCNT1.Bits.PCNT8
#define PITCNT1_PCNT9 _PITCNT1.Bits.PCNT9
#define PITCNT1_PCNT10 _PITCNT1.Bits.PCNT10
#define PITCNT1_PCNT11 _PITCNT1.Bits.PCNT11
#define PITCNT1_PCNT12 _PITCNT1.Bits.PCNT12
#define PITCNT1_PCNT13 _PITCNT1.Bits.PCNT13
#define PITCNT1_PCNT14 _PITCNT1.Bits.PCNT14
#define PITCNT1_PCNT15 _PITCNT1.Bits.PCNT15
#define PITCNT1_PCNT _PITCNT1.MergedBits.grpPCNT

