frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
#define PITCNT1_PCNT0_MASK   1
#define PITCNT1_PCNT1_MASK   2
#define PITCNT1_PCNT2_MASK   4
#define PITCNT1_PCNT3_MASK   8
#define PITCNT1_PCNT4_MASK   16
#define PITCNT1_PCNT5_MASK   32
#define PITCNT1_PCNT6_MASK   64
#define PITCNT1_PCNT7_MASK   128
#define PITCNT1_PCNT8_MASK   256
#define PITCNT1_PCNT9_MASK   512
#define PITCNT1_PCNT10_MASK   1024
#define PITCNT1_PCNT11_MASK   2048
#define PITCNT1_PCNT12_MASK   4096
#define PITCNT1_PCNT13_MASK   8192
#define PITCNT1_PCNT14_MASK   16384
#define PITCNT1_PCNT15_MASK   32768
#define PITCNT1_PCNT_MASK  65535
#define PITCNT1_PCNT_BITNUM  0


/*** PITLD2 - PIT Load Register 2; 0x00000350 ***/
typedef union {
  word Word;
  struct {
    word PLD0        :1;                                       /* PIT Load Bit 0 */
    word PLD1        :1;                                       /* PIT Load Bit 1 */
    word PLD2        :1;                                       /* PIT Load Bit 2 */
    word PLD3        :1;                                       /* PIT Load Bit 3 */
    word PLD4        :1;                                       /* PIT Load Bit 4 */
    word PLD5        :1;                                       /* PIT Load Bit 5 */
    word PLD6        :1;                                       /* PIT Load Bit 6 */
    word PLD7        :1;                                       /* PIT Load Bit 7 */
    word PLD8        :1;                                       /* PIT Load Bit 8 */
    word PLD9        :1;                                       /* PIT Load Bit 9 */
    word PLD10       :1;                                       /* PIT Load Bit 10 */
    word PLD11       :1;                                       /* PIT Load Bit 11 */
    word PLD12       :1;                                       /* PIT Load Bit 12 */
    word PLD13       :1;                                       /* PIT Load Bit 13 */
    word PLD14       :1;                                       /* PIT Load Bit 14 */
    word PLD15       :1;                                       /* PIT Load Bit 15 */
  } Bits;
  struct {
    word grpPLD  :16;
  } MergedBits;
} PITLD2STR;
extern volatile PITLD2STR _PITLD2 @(REG_BASE + 0x00000350);
#define PITLD2 _PITLD2.Word
#define PITLD2_PLD0 _PITLD2.Bits.PLD0
#define PITLD2_PLD1 _PITLD2.Bits.PLD1
#define PITLD2_PLD2 _PITLD2.Bits.PLD2
#define PITLD2_PLD3 _PITLD2.Bits.PLD3
#define PITLD2_PLD4 _PITLD2.Bits.PLD4
#define PITLD2_PLD5 _PITLD2.Bits.PLD5
#define PITLD2_PLD6 _PITLD2.Bits.PLD6
#define PITLD2_PLD7 _PITLD2.Bits.PLD7
#define PITLD2_PLD8 _PITLD2.Bits.PLD8
#define PITLD2_PLD9 _PITLD2.Bits.PLD9
#define PITLD2_PLD10 _PITLD2.Bits.PLD10
#define PITLD2_PLD11 _PITLD2.Bits.PLD11
#define PITLD2_PLD12 _PITLD2.Bits.PLD12
#define PITLD2_PLD13 _PITLD2.Bits.PLD13
#define PITLD2_PLD14 _PITLD2.Bits.PLD14
#define PITLD2_PLD15 _PITLD2.Bits.PLD15
#define PITLD2_PLD _PITLD2.MergedBits.grpPLD

#define PITLD2_PLD0_MASK   1
#define PITLD2_PLD1_MASK   2
#define PITLD2_PLD2_MASK   4
#define PITLD2_PLD3_MASK   8
#define PITLD2_PLD4_MASK   16
#define PITLD2_PLD5_MASK   32
#define PITLD2_PLD6_MASK   64
#define PITLD2_PLD7_MASK   128
#define PITLD2_PLD8_MASK   256
#define PITLD2_PLD9_MASK   512
#define PITLD2_PLD10_MASK   1024
#define PITLD2_PLD11_MASK   2048
#define PITLD2_PLD12_MASK   4096
#define PITLD2_PLD13_MASK   8192
#define PITLD2_PLD14_MASK   16384
#define PITLD2_PLD15_MASK   32768
#define PITLD2_PLD_MASK  65535
#define PITLD2_PLD_BITNUM  0


/*** PITCNT2 - PIT Count Register 2; 0x00000352 ***/
typedef union {
  word Word;
  struct {
    word PCNT0       :1;                                       /* PIT Count Bit 0 */
    word PCNT1       :1;                                       /* PIT Count Bit 1 */
    word PCNT2       :1;                                       /* PIT Count Bit 2 */
    word PCNT3       :1;                                       /* PIT Count Bit 3 */
    word PCNT4       :1;                                       /* PIT Count Bit 4 */
    word PCNT5       :1;                                       /* PIT Count Bit 5 */
    word PCNT6       :1;                                       /* PIT Count Bit 6 */
    word PCNT7       :1;                                       /* PIT Count Bit 7 */
    word PCNT8       :1;                                       /* PIT Count Bit 8 */
    word PCNT9       :1;                                       /* PIT Count Bit 9 */
    word PCNT10      :1;                                       /* PIT Count Bit 10 */
    word PCNT11      :1;                                       /* PIT Count Bit 11 */
    word PCNT12      :1;                                       /* PIT Count Bit 12 */
    word PCNT13      :1;                                       /* PIT Count Bit 13 */
    word PCNT14      :1;                                       /* PIT Count Bit 14 */
    word PCNT15      :1;                                       /* PIT Count Bit 15 */
  } Bits;
  struct {
    word grpPCNT :16;
  } MergedBits;
} PITCNT2STR;
extern volatile PITCNT2STR _PITCNT2 @(REG_BASE + 0x00000352);
#define PITCNT2 _PITCNT2.Word
#define PITCNT2_PCNT0 _PITCNT2.Bits.PCNT0
#define PITCNT2_PCNT1 _PITCNT2.Bits.PCNT1
#define PITCNT2_PCNT2 _PITCNT2.Bits.PCNT2
#define PITCNT2_PCNT3 _PITCNT2.Bits.PCNT3
#define PITCNT2_PCNT4 _PITCNT2.Bits.PCNT4
#define PITCNT2_PCNT5 _PITCNT2.Bits.PCNT5
#define PITCNT2_PCNT6 _PITCNT2.Bits.PCNT6
#define PITCNT2_PCNT7 _PITCNT2.Bits.PCNT7
#define PITCNT2_PCNT8 _PITCNT2.Bits.PCNT8
#define PITCNT2_PCNT9 _PITCNT2.Bits.PCNT9
#define PITCNT2_PCNT10 _PITCNT2.Bits.PCNT10
#define PITCNT2_PCNT11 _PITCNT2.Bits.PCNT11
#define PITCNT2_PCNT12 _PITCNT2.Bits.PCNT12
#define PITCNT2_PCNT13 _PITCNT2.Bits.PCNT13
#define PITCNT2_PCNT14 _PITCNT2.Bits.PCNT14
#define PITCNT2_PCNT15 _PITCNT2.Bits.PCNT15
#define PITCNT2_PCNT _PITCNT2.MergedBits.grpPCNT

#define PITCNT2_PCNT0_MASK   1
#define PITCNT2_PCNT1_MASK   2
#define PITCNT2_PCNT2_MASK   4
#define PITCNT2_PCNT3_MASK   8
#define PITCNT2_PCNT4_MASK   16
#define PITCNT2_PCNT5_MASK   32
#define PITCNT2_PCNT6_MASK   64
#define PITCNT2_PCNT7_MASK   128
#define PITCNT2_PCNT8_MASK   256
#define PITCNT2_PCNT9_MASK   512
#define PITCNT2_PCNT10_MASK   1024
#define PITCNT2_PCNT11_MASK   2048
#define PITCNT2_PCNT12_MASK   4096
#define PITCNT2_PCNT13_MASK   8192
#define PITCNT2_PCNT14_MASK   16384
#define PITCNT2_PCNT15_MASK   32768
#define PITCNT2_PCNT_MASK  65535
#define PITCNT2_PCNT_BITNUM  0


/*** PITLD3 - PIT Load Register 3; 0x00000354 ***/
typedef union {
  word Word;
  struct {
    word PLD0        :1;                                       /* PIT Load Bit 0 */
    word PLD1        :1;                                       /* PIT Load Bit 1 */
    word PLD2        :1;                                       /* PIT Load Bit 2 */
    word PLD3        :1;                                       /* PIT Load Bit 3 */
    word PLD4        :1;                                       /* PIT Load Bit 4 */
    word PLD5        :1;                                       /* PIT Load Bit 5 */
    word PLD6        :1;                                       /* PIT Load Bit 6 */
    word PLD7        :1;                                       /* PIT Load Bit 7 */
    word PLD8        :1;                                       /* PIT Load Bit 8 */
    word PLD9        :1;                                       /* PIT Load Bit 9 */
    word PLD10       :1;                                       /* PIT Load Bit 10 */
    word PLD11       :1;                                       /* PIT Load Bit 11 */
    word PLD12       :1;                                       /* PIT Load Bit 12 */
    word PLD13       :1;                                       /* PIT Load Bit 13 */
    word PLD14       :1;                                       /* PIT Load Bit 14 */
    word PLD15       :1;                                       /* PIT Load Bit 15 */
  } Bits;
  struct {
    word grpPLD  :16;
  } MergedBits;
} PITLD3STR;
