frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
extern volatile PITLD3STR _PITLD3 @(REG_BASE + 0x00000354);
#define PITLD3 _PITLD3.Word
#define PITLD3_PLD0 _PITLD3.Bits.PLD0
#define PITLD3_PLD1 _PITLD3.Bits.PLD1
#define PITLD3_PLD2 _PITLD3.Bits.PLD2
#define PITLD3_PLD3 _PITLD3.Bits.PLD3
#define PITLD3_PLD4 _PITLD3.Bits.PLD4
#define PITLD3_PLD5 _PITLD3.Bits.PLD5
#define PITLD3_PLD6 _PITLD3.Bits.PLD6
#define PITLD3_PLD7 _PITLD3.Bits.PLD7
#define PITLD3_PLD8 _PITLD3.Bits.PLD8
#define PITLD3_PLD9 _PITLD3.Bits.PLD9
#define PITLD3_PLD10 _PITLD3.Bits.PLD10
#define PITLD3_PLD11 _PITLD3.Bits.PLD11
#define PITLD3_PLD12 _PITLD3.Bits.PLD12
#define PITLD3_PLD13 _PITLD3.Bits.PLD13
#define PITLD3_PLD14 _PITLD3.Bits.PLD14
#define PITLD3_PLD15 _PITLD3.Bits.PLD15
#define PITLD3_PLD _PITLD3.MergedBits.grpPLD

#define PITLD3_PLD0_MASK   1
#define PITLD3_PLD1_MASK   2
#define PITLD3_PLD2_MASK   4
#define PITLD3_PLD3_MASK   8
#define PITLD3_PLD4_MASK   16
#define PITLD3_PLD5_MASK   32
#define PITLD3_PLD6_MASK   64
#define PITLD3_PLD7_MASK   128
#define PITLD3_PLD8_MASK   256
#define PITLD3_PLD9_MASK   512
#define PITLD3_PLD10_MASK   1024
#define PITLD3_PLD11_MASK   2048
#define PITLD3_PLD12_MASK   4096
#define PITLD3_PLD13_MASK   8192
#define PITLD3_PLD14_MASK   16384
#define PITLD3_PLD15_MASK   32768
#define PITLD3_PLD_MASK  65535
#define PITLD3_PLD_BITNUM  0


/*** PITCNT3 - PIT Count Register 3; 0x00000356 ***/
typedef union {
  word Word;
  struct {
    word PCNT0       :1;                                       /* PIT Count Bit 0 */
    word PCNT1       :1;                                       /* PIT Count Bit 1 */
    word PCNT2       :1;                                       /* PIT Count Bit 2 */
    word PCNT3       :1;                                       /* PIT Count Bit 3 */
    word PCNT4       :1;                                       /* PIT Count Bit 4 */
    word PCNT5       :1;                                       /* PIT Count Bit 5 */
    word PCNT6       :1;                                       /* PIT Count Bit 6 */
    word PCNT7       :1;                                       /* PIT Count Bit 7 */
    word PCNT8       :1;                                       /* PIT Count Bit 8 */
    word PCNT9       :1;                                       /* PIT Count Bit 9 */
    word PCNT10      :1;                                       /* PIT Count Bit 10 */
    word PCNT11      :1;                                       /* PIT Count Bit 11 */
    word PCNT12      :1;                                       /* PIT Count Bit 12 */
    word PCNT13      :1;                                       /* PIT Count Bit 13 */
    word PCNT14      :1;                                       /* PIT Count Bit 14 */
    word PCNT15      :1;                                       /* PIT Count Bit 15 */
  } Bits;
  struct {
    word grpPCNT :16;
  } MergedBits;
} PITCNT3STR;
extern volatile PITCNT3STR _PITCNT3 @(REG_BASE + 0x00000356);
#define PITCNT3 _PITCNT3.Word
#define PITCNT3_PCNT0 _PITCNT3.Bits.PCNT0
#define PITCNT3_PCNT1 _PITCNT3.Bits.PCNT1
#define PITCNT3_PCNT2 _PITCNT3.Bits.PCNT2
#define PITCNT3_PCNT3 _PITCNT3.Bits.PCNT3
#define PITCNT3_PCNT4 _PITCNT3.Bits.PCNT4
#define PITCNT3_PCNT5 _PITCNT3.Bits.PCNT5
#define PITCNT3_PCNT6 _PITCNT3.Bits.PCNT6
#define PITCNT3_PCNT7 _PITCNT3.Bits.PCNT7
#define PITCNT3_PCNT8 _PITCNT3.Bits.PCNT8
#define PITCNT3_PCNT9 _PITCNT3.Bits.PCNT9
#define PITCNT3_PCNT10 _PITCNT3.Bits.PCNT10
#define PITCNT3_PCNT11 _PITCNT3.Bits.PCNT11
#define PITCNT3_PCNT12 _PITCNT3.Bits.PCNT12
#define PITCNT3_PCNT13 _PITCNT3.Bits.PCNT13
#define PITCNT3_PCNT14 _PITCNT3.Bits.PCNT14
#define PITCNT3_PCNT15 _PITCNT3.Bits.PCNT15
#define PITCNT3_PCNT _PITCNT3.MergedBits.grpPCNT

#define PITCNT3_PCNT0_MASK   1
#define PITCNT3_PCNT1_MASK   2
#define PITCNT3_PCNT2_MASK   4
#define PITCNT3_PCNT3_MASK   8
#define PITCNT3_PCNT4_MASK   16
#define PITCNT3_PCNT5_MASK   32
#define PITCNT3_PCNT6_MASK   64
#define PITCNT3_PCNT7_MASK   128
#define PITCNT3_PCNT8_MASK   256
#define PITCNT3_PCNT9_MASK   512
#define PITCNT3_PCNT10_MASK   1024
#define PITCNT3_PCNT11_MASK   2048
#define PITCNT3_PCNT12_MASK   4096
#define PITCNT3_PCNT13_MASK   8192
#define PITCNT3_PCNT14_MASK   16384
#define PITCNT3_PCNT15_MASK   32768
#define PITCNT3_PCNT_MASK  65535
#define PITCNT3_PCNT_BITNUM  0


/*** XGMCTL - XGATE Module Control Register; 0x00000380 ***/
typedef union {
  byte Byte;
  struct {
    byte XGIE        :1;                                       /* XGATE Interrupt Enable */
    byte XGSWEIF     :1;                                       /* XGATE Software Error Interrupt Flag */
    byte             :1; 
    byte XGSS        :1;                                       /* XGATE Single Step */
    byte XGDBG       :1;                                       /* XGATE Debug Mode */
    byte XGDBGM      :1;                                       /* XGATE Debug Mode Mask */
    byte XGFRZ       :1;                                       /* Stop XGATE in Freeze Mode */
    byte XGE         :1;                                       /* XGATE Module Enable */
  } Bits;
} XGMCTLSTR;
extern volatile XGMCTLSTR _XGMCTL @(REG_BASE + 0x00000380);
#define XGMCTL _XGMCTL.Byte
#define XGMCTL_XGIE _XGMCTL.Bits.XGIE
#define XGMCTL_XGSWEIF _XGMCTL.Bits.XGSWEIF
#define XGMCTL_XGSS _XGMCTL.Bits.XGSS
#define XGMCTL_XGDBG _XGMCTL.Bits.XGDBG
#define XGMCTL_XGDBGM _XGMCTL.Bits.XGDBGM
#define XGMCTL_XGFRZ _XGMCTL.Bits.XGFRZ
#define XGMCTL_XGE _XGMCTL.Bits.XGE

#define XGMCTL_XGIE_MASK   1
#define XGMCTL_XGSWEIF_MASK   2
#define XGMCTL_XGSS_MASK   8
#define XGMCTL_XGDBG_MASK   16
#define XGMCTL_XGDBGM_MASK   32
#define XGMCTL_XGFRZ_MASK   64
#define XGMCTL_XGE_MASK   128


/*** XGCHID - XGATE Channel ID Register; 0x00000382 ***/
typedef union {
  byte Byte;
  struct {
    byte XGCHID      :7;                                       /* Request Identifier */
    byte             :1; 
  } Bits;
} XGCHIDSTR;
extern volatile XGCHIDSTR _XGCHID @(REG_BASE + 0x00000382);
#define XGCHID _XGCHID.Byte
#define XGCHID_XGCHID _XGCHID.Bits.XGCHID

#define XGCHID_XGCHID_MASK   127
#define XGCHID_XGCHID_BITNUM 0


/*** XGVBR01 - XGATE Vector Base Address Register; 0x00000384 ***/
typedef union {
  dword Dword;
   /* Overlapped registers: */
  struct {
    /*** XGVBR0 - XGATE Vector Base Address Register 0; 0x00000384 ***/
    union {
      word Word;
      struct {
        word XGVBR       :4;                                       /* Vector Base Address */
        word             :1; 
        word             :1; 
        word             :1; 
        word             :1; 
        word             :1; 
        word             :1; 
        word             :1; 
        word             :1; 
        word             :1; 
        word             :1; 
        word             :1; 
        word             :1; 
      } Bits;
    } XGVBR0STR;
    #define XGVBR0 _XGVBR01.Overlap_STR.XGVBR0STR.Word
    #define XGVBR0_XGVBR _XGVBR01.Overlap_STR.XGVBR0STR.Bits.XGVBR
    
    /* XGVBR_ARR: Access 2 XGVBRx registers in a array */
    #define XGVBR_ARR ((Word *) &XGVBR0)
    
    #define XGVBR0_XGVBR_MASK   15
    #define XGVBR0_XGVBR_BITNUM 0


    /*** XGVBR1 - XGATE Vector Base Address Register 1; 0x00000386 ***/
    union {
      word Word;
      struct {
        word             :1; 
        word XGVBR       :15;                                      /* Vector Base Address */
      } Bits;
    } XGVBR1STR;
    #define XGVBR1 _XGVBR01.Overlap_STR.XGVBR1STR.Word
    #define XGVBR1_XGVBR _XGVBR01.Overlap_STR.XGVBR1STR.Bits.XGVBR
    
    
    #define XGVBR1_XGVBR_MASK   65534
    #define XGVBR1_XGVBR_BITNUM 1

  } Overlap_STR;

} XGVBR01STR;
