frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdp512.h
extern volatile XGIF2STR _XGIF2 @(REG_BASE + 0x0000038C);
#define XGIF2 _XGIF2.Word
#define XGIF2_XGIF_50 _XGIF2.Bits.XGIF_50
#define XGIF2_XGIF_51 _XGIF2.Bits.XGIF_51
#define XGIF2_XGIF_52 _XGIF2.Bits.XGIF_52
#define XGIF2_XGIF_53 _XGIF2.Bits.XGIF_53
#define XGIF2_XGIF_54 _XGIF2.Bits.XGIF_54
#define XGIF2_XGIF_55 _XGIF2.Bits.XGIF_55
#define XGIF2_XGIF_56 _XGIF2.Bits.XGIF_56
#define XGIF2_XGIF_57 _XGIF2.Bits.XGIF_57
#define XGIF2_XGIF_58 _XGIF2.Bits.XGIF_58
#define XGIF2_XGIF_59 _XGIF2.Bits.XGIF_59
#define XGIF2_XGIF_5A _XGIF2.Bits.XGIF_5A
#define XGIF2_XGIF_5B _XGIF2.Bits.XGIF_5B
#define XGIF2_XGIF_5C _XGIF2.Bits.XGIF_5C
#define XGIF2_XGIF_5D _XGIF2.Bits.XGIF_5D
#define XGIF2_XGIF_5E _XGIF2.Bits.XGIF_5E
#define XGIF2_XGIF_5F _XGIF2.Bits.XGIF_5F
#define XGIF2_XGIF__50 _XGIF2.MergedBits.grpXGIF__50
#define XGIF2_XGIF_ XGIF2_XGIF__50

#define XGIF2_XGIF_50_MASK   1
#define XGIF2_XGIF_51_MASK   2
#define XGIF2_XGIF_52_MASK   4
#define XGIF2_XGIF_53_MASK   8
#define XGIF2_XGIF_54_MASK   16
#define XGIF2_XGIF_55_MASK   32
#define XGIF2_XGIF_56_MASK   64
#define XGIF2_XGIF_57_MASK   128
#define XGIF2_XGIF_58_MASK   256
#define XGIF2_XGIF_59_MASK   512
#define XGIF2_XGIF_5A_MASK   1024
#define XGIF2_XGIF_5B_MASK   2048
#define XGIF2_XGIF_5C_MASK   4096
#define XGIF2_XGIF_5D_MASK   8192
#define XGIF2_XGIF_5E_MASK   16384
#define XGIF2_XGIF_5F_MASK   32768
#define XGIF2_XGIF__50_MASK  1023
#define XGIF2_XGIF__50_BITNUM  0


/*** XGIF3 - XGATE Channel Interrupt Flag Vector 3; 0x0000038E ***/
typedef union {
  word Word;
  struct {
    word XGIF_40     :1;                                       /* Channel Interrupt Flag 40 */
    word XGIF_41     :1;                                       /* Channel Interrupt Flag 41 */
    word XGIF_42     :1;                                       /* Channel Interrupt Flag 42 */
    word XGIF_43     :1;                                       /* Channel Interrupt Flag 43 */
    word XGIF_44     :1;                                       /* Channel Interrupt Flag 44 */
    word XGIF_45     :1;                                       /* Channel Interrupt Flag 45 */
    word XGIF_46     :1;                                       /* Channel Interrupt Flag 46 */
    word XGIF_47     :1;                                       /* Channel Interrupt Flag 47 */
    word XGIF_48     :1;                                       /* Channel Interrupt Flag 48 */
    word XGIF_49     :1;                                       /* Channel Interrupt Flag 49 */
    word XGIF_4A     :1;                                       /* Channel Interrupt Flag 4A */
    word XGIF_4B     :1;                                       /* Channel Interrupt Flag 4B */
    word XGIF_4C     :1;                                       /* Channel Interrupt Flag 4C */
    word XGIF_4D     :1;                                       /* Channel Interrupt Flag 4D */
    word XGIF_4E     :1;                                       /* Channel Interrupt Flag 4E */
    word XGIF_4F     :1;                                       /* Channel Interrupt Flag 4F */
  } Bits;
  struct {
    word grpXGIF__40 :10;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} XGIF3STR;
extern volatile XGIF3STR _XGIF3 @(REG_BASE + 0x0000038E);
#define XGIF3 _XGIF3.Word
#define XGIF3_XGIF_40 _XGIF3.Bits.XGIF_40
#define XGIF3_XGIF_41 _XGIF3.Bits.XGIF_41
#define XGIF3_XGIF_42 _XGIF3.Bits.XGIF_42
#define XGIF3_XGIF_43 _XGIF3.Bits.XGIF_43
#define XGIF3_XGIF_44 _XGIF3.Bits.XGIF_44
#define XGIF3_XGIF_45 _XGIF3.Bits.XGIF_45
#define XGIF3_XGIF_46 _XGIF3.Bits.XGIF_46
#define XGIF3_XGIF_47 _XGIF3.Bits.XGIF_47
#define XGIF3_XGIF_48 _XGIF3.Bits.XGIF_48
#define XGIF3_XGIF_49 _XGIF3.Bits.XGIF_49
#define XGIF3_XGIF_4A _XGIF3.Bits.XGIF_4A
#define XGIF3_XGIF_4B _XGIF3.Bits.XGIF_4B
#define XGIF3_XGIF_4C _XGIF3.Bits.XGIF_4C
#define XGIF3_XGIF_4D _XGIF3.Bits.XGIF_4D
#define XGIF3_XGIF_4E _XGIF3.Bits.XGIF_4E
#define XGIF3_XGIF_4F _XGIF3.Bits.XGIF_4F
#define XGIF3_XGIF__40 _XGIF3.MergedBits.grpXGIF__40
#define XGIF3_XGIF_ XGIF3_XGIF__40

#define XGIF3_XGIF_40_MASK   1
#define XGIF3_XGIF_41_MASK   2
#define XGIF3_XGIF_42_MASK   4
#define XGIF3_XGIF_43_MASK   8
#define XGIF3_XGIF_44_MASK   16
#define XGIF3_XGIF_45_MASK   32
#define XGIF3_XGIF_46_MASK   64
#define XGIF3_XGIF_47_MASK   128
#define XGIF3_XGIF_48_MASK   256
#define XGIF3_XGIF_49_MASK   512
#define XGIF3_XGIF_4A_MASK   1024
#define XGIF3_XGIF_4B_MASK   2048
#define XGIF3_XGIF_4C_MASK   4096
#define XGIF3_XGIF_4D_MASK   8192
#define XGIF3_XGIF_4E_MASK   16384
#define XGIF3_XGIF_4F_MASK   32768
#define XGIF3_XGIF__40_MASK  1023
#define XGIF3_XGIF__40_BITNUM  0


/*** XGIF4 - XGATE Channel Interrupt Flag Vector 4; 0x00000390 ***/
typedef union {
  word Word;
  struct {
    word XGIF_30     :1;                                       /* Channel Interrupt Flag 30 */
    word XGIF_31     :1;                                       /* Channel Interrupt Flag 31 */
    word XGIF_32     :1;                                       /* Channel Interrupt Flag 32 */
    word XGIF_33     :1;                                       /* Channel Interrupt Flag 33 */
    word XGIF_34     :1;                                       /* Channel Interrupt Flag 34 */
    word XGIF_35     :1;                                       /* Channel Interrupt Flag 35 */
    word XGIF_36     :1;                                       /* Channel Interrupt Flag 36 */
    word XGIF_37     :1;                                       /* Channel Interrupt Flag 37 */
    word XGIF_38     :1;                                       /* Channel Interrupt Flag 38 */
    word XGIF_39     :1;                                       /* Channel Interrupt Flag 39 */
    word XGIF_3A     :1;                                       /* Channel Interrupt Flag 3A */
    word XGIF_3B     :1;                                       /* Channel Interrupt Flag 3B */
    word XGIF_3C     :1;                                       /* Channel Interrupt Flag 3C */
    word XGIF_3D     :1;                                       /* Channel Interrupt Flag 3D */
    word XGIF_3E     :1;                                       /* Channel Interrupt Flag 3E */
    word XGIF_3F     :1;                                       /* Channel Interrupt Flag 3F */
  } Bits;
  struct {
    word grpXGIF__30 :10;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} XGIF4STR;
extern volatile XGIF4STR _XGIF4 @(REG_BASE + 0x00000390);
#define XGIF4 _XGIF4.Word
#define XGIF4_XGIF_30 _XGIF4.Bits.XGIF_30
#define XGIF4_XGIF_31 _XGIF4.Bits.XGIF_31
#define XGIF4_XGIF_32 _XGIF4.Bits.XGIF_32
#define XGIF4_XGIF_33 _XGIF4.Bits.XGIF_33
#define XGIF4_XGIF_34 _XGIF4.Bits.XGIF_34
#define XGIF4_XGIF_35 _XGIF4.Bits.XGIF_35
#define XGIF4_XGIF_36 _XGIF4.Bits.XGIF_36
#define XGIF4_XGIF_37 _XGIF4.Bits.XGIF_37
#define XGIF4_XGIF_38 _XGIF4.Bits.XGIF_38
#define XGIF4_XGIF_39 _XGIF4.Bits.XGIF_39
#define XGIF4_XGIF_3A _XGIF4.Bits.XGIF_3A
#define XGIF4_XGIF_3B _XGIF4.Bits.XGIF_3B
#define XGIF4_XGIF_3C _XGIF4.Bits.XGIF_3C
#define XGIF4_XGIF_3D _XGIF4.Bits.XGIF_3D
#define XGIF4_XGIF_3E _XGIF4.Bits.XGIF_3E
#define XGIF4_XGIF_3F _XGIF4.Bits.XGIF_3F
#define XGIF4_XGIF__30 _XGIF4.MergedBits.grpXGIF__30
#define XGIF4_XGIF_ XGIF4_XGIF__30

#define XGIF4_XGIF_30_MASK   1
#define XGIF4_XGIF_31_MASK   2
#define XGIF4_XGIF_32_MASK   4
#define XGIF4_XGIF_33_MASK   8
#define XGIF4_XGIF_34_MASK   16
#define XGIF4_XGIF_35_MASK   32
#define XGIF4_XGIF_36_MASK   64
#define XGIF4_XGIF_37_MASK   128
#define XGIF4_XGIF_38_MASK   256
#define XGIF4_XGIF_39_MASK   512
#define XGIF4_XGIF_3A_MASK   1024
#define XGIF4_XGIF_3B_MASK   2048
#define XGIF4_XGIF_3C_MASK   4096
#define XGIF4_XGIF_3D_MASK   8192
#define XGIF4_XGIF_3E_MASK   16384
#define XGIF4_XGIF_3F_MASK   32768
#define XGIF4_XGIF__30_MASK  1023
#define XGIF4_XGIF__30_BITNUM  0


